{
  " ": 52391,
  "<end>": 52390,
  "<start>": 52389,
  "Ba1": 52180,
  "Ba2": 50613,
  "Ba3": 50734,
  "Ba3+": 50753,
  "Ba4": 50752,
  "Ba4+": 52327,
  "Ba5": 51473,
  "Ba5+": 50449,
  "Ba6": 50618,
  "Ba6#": 50866,
  "Ba6+": 51748,
  "Ba7": 51046,
  "Ba7+": 51947,
  "Ba8": 51153,
  "Bb1": 51461,
  "Bb2": 51138,
  "Bb2+": 50595,
  "Bb3": 51581,
  "Bb3+": 51626,
  "Bb4": 50452,
  "Bb4#": 50491,
  "Bb4+": 50836,
  "Bb5": 52305,
  "Bb5#": 52123,
  "Bb5+": 52141,
  "Bb6": 51093,
  "Bb6#": 52017,
  "Bb6+": 50550,
  "Bb7": 50872,
  "Bb7+": 52090,
  "Bb8": 50467,
  "Bc1": 50545,
  "Bc1#": 50899,
  "Bc1+": 50741,
  "Bc2": 51364,
  "Bc2+": 51915,
  "Bc3": 52383,
  "Bc3#": 50489,
  "Bc3+": 50461,
  "Bc4": 51801,
  "Bc4+": 51212,
  "Bc5": 51411,
  "Bc5#": 51654,
  "Bc5+": 50903,
  "Bc6": 50804,
  "Bc6#": 50971,
  "Bc6+": 51595,
  "Bc7": 51892,
  "Bc7+": 51512,
  "Bc8": 51868,
  "Bc8#": 51256,
  "Bc8+": 50384,
  "Bd1": 50885,
  "Bd1#": 50698,
  "Bd1+": 51841,
  "Bd2": 51804,
  "Bd2+": 50912,
  "Bd3": 51415,
  "Bd3+": 50807,
  "Bd4": 52213,
  "Bd4#": 52036,
  "Bd4+": 50923,
  "Bd5": 51378,
  "Bd5#": 50406,
  "Bd5+": 52216,
  "Bd6": 52136,
  "Bd6#": 50501,
  "Bd6+": 50556,
  "Bd7": 50283,
  "Bd7#": 51907,
  "Bd7+": 51101,
  "Bd8": 50769,
  "Bd8+": 51716,
  "Be1": 50760,
  "Be1+": 51602,
  "Be2": 50659,
  "Be2+": 52371,
  "Be3": 51420,
  "Be3#": 51791,
  "Be3+": 51435,
  "Be4": 51730,
  "Be4+": 50293,
  "Be5": 51443,
  "Be5+": 50331,
  "Be6": 50865,
  "Be6#": 51991,
  "Be6+": 51866,
  "Be7": 52107,
  "Be7+": 51042,
  "Be8": 51659,
  "Be8+": 51062,
  "Bf1": 52013,
  "Bf1+": 50910,
  "Bf2": 50336,
  "Bf2#": 51603,
  "Bf2+": 52104,
  "Bf3": 52376,
  "Bf3#": 50481,
  "Bf3+": 50523,
  "Bf4": 51639,
  "Bf4#": 51403,
  "Bf4+": 52119,
  "Bf5": 52054,
  "Bf5#": 51275,
  "Bf5+": 52181,
  "Bf6": 51887,
  "Bf6#": 52227,
  "Bf6+": 51701,
  "Bf7": 51293,
  "Bf7#": 51005,
  "Bf7+": 50594,
  "Bf8": 51983,
  "Bf8+": 51282,
  "Bg1": 52179,
  "Bg1+": 50564,
  "Bg2": 51118,
  "Bg2+": 50714,
  "Bg3": 51738,
  "Bg3#": 52044,
  "Bg3+": 51213,
  "Bg4": 51264,
  "Bg4#": 51168,
  "Bg4+": 50563,
  "Bg5": 51020,
  "Bg5#": 51296,
  "Bg5+": 51030,
  "Bg6": 51129,
  "Bg6#": 51229,
  "Bg6+": 51448,
  "Bg7": 51989,
  "Bg7#": 50731,
  "Bg7+": 51428,
  "Bg8": 51893,
  "Bg8+": 51205,
  "Bh1": 51083,
  "Bh2": 52289,
  "Bh2+": 50703,
  "Bh3": 52356,
  "Bh3#": 50858,
  "Bh3+": 50485,
  "Bh4": 51506,
  "Bh4+": 50372,
  "Bh5": 50827,
  "Bh5+": 50341,
  "Bh6": 50459,
  "Bh6#": 50727,
  "Bh6+": 50512,
  "Bh7": 50380,
  "Bh7+": 52258,
  "Bh8": 50407,
  "Bxa1": 50898,
  "Bxa2": 52245,
  "Bxa3": 51341,
  "Bxa3+": 51586,
  "Bxa4": 51467,
  "Bxa4+": 51552,
  "Bxa5": 51702,
  "Bxa5+": 51456,
  "Bxa6": 51530,
  "Bxa6+": 50393,
  "Bxa7": 50850,
  "Bxa7+": 51446,
  "Bxa8": 51720,
  "Bxb1": 51477,
  "Bxb2": 51127,
  "Bxb2+": 51755,
  "Bxb3": 51527,
  "Bxb4": 52110,
  "Bxb4+": 51250,
  "Bxb5": 52088,
  "Bxb5#": 51009,
  "Bxb5+": 51886,
  "Bxb6": 51452,
  "Bxb6+": 51691,
  "Bxb7": 50497,
  "Bxb7+": 51001,
  "Bxb8": 52174,
  "Bxc1": 51851,
  "Bxc2": 52303,
  "Bxc2+": 52288,
  "Bxc3": 50924,
  "Bxc3+": 51569,
  "Bxc4": 52382,
  "Bxc4+": 51419,
  "Bxc5": 50275,
  "Bxc5+": 52233,
  "Bxc6": 52105,
  "Bxc6+": 50881,
  "Bxc7": 51405,
  "Bxc7+": 52349,
  "Bxc8": 50875,
  "Bxd1": 51780,
  "Bxd2": 51274,
  "Bxd2+": 50943,
  "Bxd3": 51486,
  "Bxd3+": 50848,
  "Bxd4": 52234,
  "Bxd4+": 50953,
  "Bxd5": 51160,
  "Bxd5+": 51505,
  "Bxd6": 51793,
  "Bxd6#": 50434,
  "Bxd6+": 50882,
  "Bxd7": 51881,
  "Bxd7+": 50933,
  "Bxd8": 51389,
  "Bxd8+": 52332,
  "Bxe1": 52192,
  "Bxe2": 51232,
  "Bxe2#": 52250,
  "Bxe2+": 51184,
  "Bxe3": 52293,
  "Bxe3+": 51361,
  "Bxe4": 51955,
  "Bxe4+": 51599,
  "Bxe5": 51285,
  "Bxe5+": 51126,
  "Bxe6": 50605,
  "Bxe6+": 51483,
  "Bxe7": 51367,
  "Bxe7#": 51829,
  "Bxe7+": 51802,
  "Bxe8": 51843,
  "Bxf1": 50904,
  "Bxf2": 51217,
  "Bxf2#": 51633,
  "Bxf2+": 50684,
  "Bxf3": 51714,
  "Bxf3#": 52167,
  "Bxf3+": 50678,
  "Bxf4": 51770,
  "Bxf4+": 50942,
  "Bxf5": 51683,
  "Bxf5+": 51845,
  "Bxf6": 51333,
  "Bxf6#": 50842,
  "Bxf6+": 52187,
  "Bxf7": 52295,
  "Bxf7#": 51632,
  "Bxf7+": 50357,
  "Bxf8": 51012,
  "Bxf8+": 52188,
  "Bxg1": 50798,
  "Bxg2": 50986,
  "Bxg2+": 50319,
  "Bxg3": 51562,
  "Bxg3#": 50286,
  "Bxg3+": 50737,
  "Bxg4": 50379,
  "Bxg4+": 51760,
  "Bxg5": 51774,
  "Bxg5+": 52359,
  "Bxg6": 51970,
  "Bxg6+": 52106,
  "Bxg7": 51484,
  "Bxg7+": 51257,
  "Bxg8": 52148,
  "Bxg8+": 50863,
  "Bxh1": 50482,
  "Bxh2": 51280,
  "Bxh2+": 51119,
  "Bxh3": 51805,
  "Bxh3+": 51198,
  "Bxh4": 51271,
  "Bxh4+": 51824,
  "Bxh5": 50994,
  "Bxh5+": 50644,
  "Bxh6": 51321,
  "Bxh6+": 50423,
  "Bxh7": 51742,
  "Bxh7#": 52200,
  "Bxh7+": 52271,
  "Bxh8": 50697,
  "Ka1": 50303,
  "Ka2": 51438,
  "Ka3": 51053,
  "Ka4": 51135,
  "Ka5": 50414,
  "Ka6": 50978,
  "Ka7": 51874,
  "Ka8": 51899,
  "Kb1": 51873,
  "Kb2": 50332,
  "Kb3": 50499,
  "Kb4": 51571,
  "Kb5": 51771,
  "Kb6": 52238,
  "Kb7": 50404,
  "Kb8": 51594,
  "Kc1": 50796,
  "Kc2": 51497,
  "Kc3": 51050,
  "Kc4": 52170,
  "Kc5": 51013,
  "Kc6": 50533,
  "Kc7": 50616,
  "Kc8": 50893,
  "Kd1": 50366,
  "Kd1+": 50702,
  "Kd2": 50947,
  "Kd3": 51003,
  "Kd4": 51044,
  "Kd5": 50887,
  "Kd6": 51455,
  "Kd7": 50327,
  "Kd8": 51819,
  "Ke1": 50873,
  "Ke2": 51778,
  "Ke3": 52265,
  "Ke4": 52323,
  "Ke5": 51313,
  "Ke6": 52154,
  "Ke7": 51546,
  "Ke8": 52301,
  "Kf1": 50975,
  "Kf2": 50418,
  "Kf3": 51811,
  "Kf4": 52045,
  "Kf5": 52267,
  "Kf6": 51808,
  "Kf6+": 50725,
  "Kf7": 51406,
  "Kf8": 51283,
  "Kg1": 50998,
  "Kg2": 50365,
  "Kg3": 50851,
  "Kg3+": 50907,
  "Kg4": 51071,
  "Kg5": 50344,
  "Kg6": 50686,
  "Kg7": 50486,
  "Kg8": 51481,
  "Kh1": 50440,
  "Kh2": 51663,
  "Kh3": 52035,
  "Kh4": 51662,
  "Kh5": 50861,
  "Kh6": 51350,
  "Kh7": 51807,
  "Kh8": 50516,
  "Kh8+": 51017,
  "Kxa1": 52270,
  "Kxa2": 51366,
  "Kxa3": 51465,
  "Kxa4": 50464,
  "Kxa5": 50808,
  "Kxa6": 50518,
  "Kxa7": 52169,
  "Kxa8": 51490,
  "Kxb1": 51297,
  "Kxb2": 51706,
  "Kxb3": 50987,
  "Kxb4": 51027,
  "Kxb5": 51957,
  "Kxb6": 51359,
  "Kxb7": 51450,
  "Kxb8": 52070,
  "Kxc1": 50792,
  "Kxc2": 51966,
  "Kxc3": 52217,
  "Kxc4": 51016,
  "Kxc5": 51941,
  "Kxc6": 51606,
  "Kxc7": 50744,
  "Kxc8": 51422,
  "Kxd1": 51346,
  "Kxd2": 52074,
  "Kxd3": 51836,
  "Kxd4": 52341,
  "Kxd5": 50355,
  "Kxd6": 52055,
  "Kxd7": 50891,
  "Kxd8": 51323,
  "Kxe1": 51514,
  "Kxe2": 51532,
  "Kxe3": 51543,
  "Kxe4": 51548,
  "Kxe5": 51917,
  "Kxe6": 50540,
  "Kxe7": 51884,
  "Kxe8": 50544,
  "Kxf1": 51077,
  "Kxf2": 50306,
  "Kxf3": 50646,
  "Kxf4": 50583,
  "Kxf5": 51888,
  "Kxf6": 52259,
  "Kxf7": 51023,
  "Kxf8": 51356,
  "Kxg1": 50430,
  "Kxg2": 51761,
  "Kxg3": 51577,
  "Kxg4": 51762,
  "Kxg5": 51690,
  "Kxg6": 51243,
  "Kxg7": 51788,
  "Kxg8": 51580,
  "Kxh1": 50409,
  "Kxh2": 50632,
  "Kxh3": 50825,
  "Kxh4": 52173,
  "Kxh5": 50625,
  "Kxh6": 52158,
  "Kxh7": 50880,
  "Kxh8": 52272,
  "Na1": 51383,
  "Na2": 50670,
  "Na2#": 50918,
  "Na2+": 51924,
  "Na3": 50493,
  "Na3+": 52059,
  "Na4": 51769,
  "Na4+": 51687,
  "Na5": 51776,
  "Na5+": 51480,
  "Na6": 50634,
  "Na6+": 52370,
  "Na7": 50517,
  "Na7#": 51231,
  "Na7+": 51840,
  "Na8": 50633,
  "Nab6": 51937,
  "Nac5": 51984,
  "Nac6": 51825,
  "Nac7": 51249,
  "Naxb5": 51839,
  "Naxc5": 50377,
  "Nb1": 51870,
  "Nb1+": 50968,
  "Nb1c3": 50781,
  "Nb1d2": 50707,
  "Nb2": 51638,
  "Nb2+": 51235,
  "Nb3": 50949,
  "Nb3+": 51385,
  "Nb4": 50911,
  "Nb4#": 50901,
  "Nb4+": 51904,
  "Nb5": 50539,
  "Nb5+": 51458,
  "Nb6": 52337,
  "Nb6#": 52263,
  "Nb6+": 52241,
  "Nb7": 51015,
  "Nb7+": 51238,
  "Nb8": 50664,
  "Nb8d7": 51613,
  "Nbc2": 50979,
  "Nbc3": 50590,
  "Nbc4": 51226,
  "Nbc5": 51381,
  "Nbc6": 50701,
  "Nbc7": 52291,
  "Nbc7+": 50748,
  "Nbc8": 51432,
  "Nbd2": 50371,
  "Nbd2+": 51895,
  "Nbd3": 51564,
  "Nbd4": 51177,
  "Nbd5": 52367,
  "Nbd6": 50289,
  "Nbd7": 52333,
  "Nbxc4": 52080,
  "Nbxc6": 51862,
  "Nbxd2": 50456,
  "Nbxd4": 52124,
  "Nbxd5": 51814,
  "Nbxd6": 52282,
  "Nbxd7": 50940,
  "Nc1": 52354,
  "Nc1+": 51466,
  "Nc2": 51668,
  "Nc2#": 51744,
  "Nc2+": 50920,
  "Nc3": 50716,
  "Nc3#": 51191,
  "Nc3+": 51399,
  "Nc4": 51931,
  "Nc4+": 52384,
  "Nc5": 51086,
  "Nc5#": 52363,
  "Nc5+": 51727,
  "Nc6": 51112,
  "Nc6#": 51291,
  "Nc6+": 51798,
  "Nc7": 51930,
  "Nc7#": 50603,
  "Nc7+": 51024,
  "Nc8": 51488,
  "Nc8+": 51263,
  "Nca6": 50740,
  "Ncb4": 50453,
  "Ncb5": 51826,
  "Ncb6": 52112,
  "Ncd1": 50915,
  "Ncd2": 52365,
  "Ncd3": 50680,
  "Ncd4": 50755,
  "Ncd5": 50424,
  "Ncd7": 52062,
  "Nce2": 51813,
  "Nce3": 50889,
  "Nce4": 52121,
  "Nce4+": 50931,
  "Nce5": 51993,
  "Nce6": 52071,
  "Nce6+": 51684,
  "Nce7": 51858,
  "Nce8": 51977,
  "Ncxb5": 52315,
  "Ncxd4": 51565,
  "Ncxd5": 50884,
  "Ncxe2": 50671,
  "Ncxe3": 50579,
  "Ncxe4": 52026,
  "Ncxe5": 52239,
  "Ncxe6": 52268,
  "Nd1": 50396,
  "Nd1+": 51425,
  "Nd2": 52137,
  "Nd2#": 51834,
  "Nd2+": 50433,
  "Nd2f3": 51556,
  "Nd3": 52248,
  "Nd3#": 51537,
  "Nd3+": 50811,
  "Nd4": 52283,
  "Nd4+": 51319,
  "Nd5": 51022,
  "Nd5#": 51393,
  "Nd5+": 51290,
  "Nd5b6": 50977,
  "Nd6": 50480,
  "Nd6#": 51348,
  "Nd6+": 52256,
  "Nd7": 52385,
  "Nd7+": 50774,
  "Nd7b6": 52335,
  "Nd8": 52205,
  "Nd8+": 52150,
  "Ndb1": 50541,
  "Ndb3": 50451,
  "Ndb4": 50790,
  "Ndb5": 51320,
  "Ndb6": 50269,
  "Ndb8": 50673,
  "Ndc3": 50797,
  "Ndc4": 50997,
  "Ndc5": 50309,
  "Ndc6": 51485,
  "Ndc7": 51472,
  "Nde2": 51766,
  "Nde3": 51756,
  "Nde4": 51943,
  "Nde5": 51247,
  "Nde6": 51542,
  "Nde7": 51961,
  "Ndf3": 51109,
  "Ndf4": 52019,
  "Ndf6": 50877,
  "Ndf6+": 51547,
  "Ndf7": 50758,
  "Ndxb5": 51902,
  "Ndxc5": 50902,
  "Ndxe4": 52050,
  "Ndxe5": 50964,
  "Ndxe6": 51162,
  "Ndxe6+": 51179,
  "Ndxe7": 51528,
  "Ndxf5": 50695,
  "Ndxf6": 50560,
  "Ne1": 51171,
  "Ne1+": 52348,
  "Ne2": 51629,
  "Ne2+": 51414,
  "Ne2g3": 52083,
  "Ne3": 51797,
  "Ne3#": 51747,
  "Ne3+": 50709,
  "Ne4": 52366,
  "Ne4#": 52329,
  "Ne4+": 50976,
  "Ne4xc5": 51309,
  "Ne5": 50496,
  "Ne5#": 51000,
  "Ne5+": 52155,
  "Ne5d3": 51502,
  "Ne5g6": 50513,
  "Ne6": 51859,
  "Ne6#": 51174,
  "Ne6+": 51522,
  "Ne7": 52196,
  "Ne7#": 51934,
  "Ne7+": 51377,
  "Ne7c6": 50868,
  "Ne7xg6": 51525,
  "Ne8": 51561,
  "Ne8+": 51372,
  "Nec2": 52362,
  "Nec3": 52198,
  "Nec4": 50463,
  "Nec5": 50654,
  "Nec6": 50908,
  "Nec7": 51269,
  "Ned2": 51524,
  "Ned4": 51749,
  "Ned5": 50346,
  "Ned6": 51554,
  "Ned6+": 51051,
  "Ned7": 51942,
  "Nef1": 51148,
  "Nef2": 51117,
  "Nef2+": 51113,
  "Nef3": 51709,
  "Nef4": 52378,
  "Nef5": 50961,
  "Nef5+": 50739,
  "Nef6": 51289,
  "Neg4": 51147,
  "Neg4+": 52087,
  "Neg5": 50529,
  "Neg5+": 50766,
  "Neg8": 51214,
  "Nexc5": 50348,
  "Nexd4": 51600,
  "Nexd5": 51091,
  "Nexd7": 52302,
  "Nexf2": 52195,
  "Nexf4": 51979,
  "Nexg3": 51523,
  "Nexg4": 51585,
  "Nf1": 50791,
  "Nf1+": 51288,
  "Nf1d2": 51647,
  "Nf2": 51344,
  "Nf2#": 50561,
  "Nf2+": 51056,
  "Nf3": 51218,
  "Nf3#": 51094,
  "Nf3+": 50657,
  "Nf3d2": 50784,
  "Nf3xd4": 51510,
  "Nf4": 51534,
  "Nf4+": 51889,
  "Nf5": 52336,
  "Nf5#": 51060,
  "Nf5+": 51751,
  "Nf6": 51286,
  "Nf6#": 51018,
  "Nf6+": 50749,
  "Nf7": 50650,
  "Nf7#": 51842,
  "Nf7+": 51281,
  "Nf8": 52133,
  "Nf8+": 51768,
  "Nf8d7": 51208,
  "Nfd2": 52012,
  "Nfd3": 51396,
  "Nfd3+": 50515,
  "Nfd4": 52344,
  "Nfd5": 50441,
  "Nfd7": 51400,
  "Nfe2": 52100,
  "Nfe3": 52252,
  "Nfe4": 50350,
  "Nfe5": 52338,
  "Nfe7": 50400,
  "Nfe7+": 51475,
  "Nfg3": 50855,
  "Nfg4": 51767,
  "Nfg4+": 52310,
  "Nfg5": 51551,
  "Nfg5+": 51362,
  "Nfh2": 52307,
  "Nfxd2": 51067,
  "Nfxd4": 51143,
  "Nfxd5": 51665,
  "Nfxe4": 51929,
  "Nfxe5": 50849,
  "Nfxg4": 51923,
  "Nfxg5": 51588,
  "Ng1": 51155,
  "Ng1+": 50719,
  "Ng2": 52264,
  "Ng2+": 50510,
  "Ng3": 51103,
  "Ng3#": 51655,
  "Ng3+": 51489,
  "Ng4": 52028,
  "Ng4#": 52218,
  "Ng4+": 52022,
  "Ng5": 50410,
  "Ng5#": 51610,
  "Ng5+": 51215,
  "Ng6": 50385,
  "Ng6#": 51650,
  "Ng6+": 52130,
  "Ng7": 51719,
  "Ng7+": 51648,
  "Ng8": 50993,
  "Ng8+": 50323,
  "Ng8e7": 52165,
  "Nge2": 51230,
  "Nge3": 51409,
  "Nge4": 50392,
  "Nge5": 50952,
  "Nge7": 50361,
  "Ngf1": 51495,
  "Ngf3": 52043,
  "Ngf4+": 51324,
  "Ngf6": 51641,
  "Ngxe2": 50972,
  "Ngxe4": 51423,
  "Ngxe5": 50524,
  "Ngxe7": 51427,
  "Ngxf2": 51154,
  "Ngxf2+": 52008,
  "Ngxf6": 50777,
  "Nh1": 50685,
  "Nh2": 52132,
  "Nh2+": 51905,
  "Nh3": 52255,
  "Nh3#": 50721,
  "Nh3+": 51254,
  "Nh4": 51593,
  "Nh4+": 51597,
  "Nh5": 51589,
  "Nh5+": 51964,
  "Nh6": 51740,
  "Nh6#": 50576,
  "Nh6+": 50378,
  "Nh7": 52286,
  "Nh7+": 50662,
  "Nh8": 51476,
  "Nh8+": 51357,
  "Nhf2": 50989,
  "Nhf3": 51570,
  "Nhf4": 52001,
  "Nhf6": 51090,
  "Nhf7": 50268,
  "Nhg1": 51453,
  "Nhg5": 50726,
  "Nhxf5": 50688,
  "Nhxf6": 52231,
  "Nhxf6+": 50778,
  "Nhxg6": 51671,
  "Nxa1": 50763,
  "Nxa2": 51391,
  "Nxa2+": 51087,
  "Nxa3": 52223,
  "Nxa3+": 51926,
  "Nxa4": 51555,
  "Nxa5": 51583,
  "Nxa5+": 51800,
  "Nxa6": 51835,
  "Nxa7": 51559,
  "Nxa7#": 50601,
  "Nxa7+": 51700,
  "Nxa8": 51969,
  "Nxa8+": 50408,
  "Nxb1": 50349,
  "Nxb2": 52176,
  "Nxb2+": 51707,
  "Nxb3": 50935,
  "Nxb3+": 50847,
  "Nxb4": 51566,
  "Nxb4+": 50551,
  "Nxb5": 50621,
  "Nxb6": 51142,
  "Nxb6+": 51306,
  "Nxb7": 50338,
  "Nxb7+": 51130,
  "Nxb8": 50577,
  "Nxc1": 50443,
  "Nxc1+": 50460,
  "Nxc2": 50965,
  "Nxc2+": 50800,
  "Nxc3": 51085,
  "Nxc3+": 50730,
  "Nxc4": 51669,
  "Nxc4+": 50818,
  "Nxc5": 52204,
  "Nxc5+": 51677,
  "Nxc6": 50957,
  "Nxc6+": 50938,
  "Nxc7": 50313,
  "Nxc7#": 51240,
  "Nxc7+": 50642,
  "Nxc8": 50536,
  "Nxc8+": 50630,
  "Nxd1": 51345,
  "Nxd1+": 51936,
  "Nxd2": 51262,
  "Nxd2+": 50447,
  "Nxd3": 50388,
  "Nxd3+": 51896,
  "Nxd4": 51951,
  "Nxd4#": 50896,
  "Nxd4+": 51468,
  "Nxd5": 51906,
  "Nxd5+": 51852,
  "Nxd6": 50905,
  "Nxd6+": 52152,
  "Nxd7": 51865,
  "Nxd7+": 51910,
  "Nxd8": 51457,
  "Nxd8+": 52011,
  "Nxe1": 50317,
  "Nxe1+": 51049,
  "Nxe2": 52361,
  "Nxe2+": 51006,
  "Nxe3": 51259,
  "Nxe3+": 52322,
  "Nxe4": 50557,
  "Nxe4#": 50265,
  "Nxe4+": 50588,
  "Nxe5": 51267,
  "Nxe5+": 51676,
  "Nxe6": 50299,
  "Nxe6+": 50360,
  "Nxe7": 52352,
  "Nxe7+": 51759,
  "Nxe8": 51095,
  "Nxe8+": 51928,
  "Nxf1": 51334,
  "Nxf1+": 51591,
  "Nxf2": 52357,
  "Nxf2#": 51508,
  "Nxf2+": 51789,
  "Nxf3": 50301,
  "Nxf3+": 51786,
  "Nxf4": 51898,
  "Nxf4+": 51935,
  "Nxf5": 50770,
  "Nxf5+": 50534,
  "Nxf6": 50498,
  "Nxf6+": 52339,
  "Nxf7": 52242,
  "Nxf7#": 50990,
  "Nxf7+": 50878,
  "Nxf8": 50626,
  "Nxf8+": 51869,
  "Nxg1": 50600,
  "Nxg1+": 50826,
  "Nxg2": 50679,
  "Nxg2+": 50820,
  "Nxg3": 50624,
  "Nxg3+": 50316,
  "Nxg4": 50471,
  "Nxg4+": 50941,
  "Nxg5": 51019,
  "Nxg5+": 51998,
  "Nxg6": 51059,
  "Nxg6+": 52269,
  "Nxg7": 50692,
  "Nxg7#": 51712,
  "Nxg7+": 50356,
  "Nxg8": 52128,
  "Nxg8+": 52041,
  "Nxh1": 51628,
  "Nxh2": 51867,
  "Nxh2+": 52082,
  "Nxh3": 50573,
  "Nxh3+": 50981,
  "Nxh4": 51032,
  "Nxh4+": 51812,
  "Nxh5": 50682,
  "Nxh6": 52197,
  "Nxh6+": 50343,
  "Nxh7": 51397,
  "Nxh7+": 51612,
  "Nxh8": 50419,
  "O-O": 50667,
  "O-O+": 51440,
  "O-O-O": 51974,
  "O-O-O+": 50484,
  "Qa1": 51651,
  "Qa1#": 51133,
  "Qa1+": 50733,
  "Qa2": 51876,
  "Qa2+": 51144,
  "Qa3": 51773,
  "Qa3+": 51604,
  "Qa4": 50504,
  "Qa4#": 51014,
  "Qa4+": 52236,
  "Qa5": 50779,
  "Qa5#": 51261,
  "Qa5+": 51872,
  "Qa6": 50683,
  "Qa6#": 51688,
  "Qa6+": 51387,
  "Qa7": 51783,
  "Qa7#": 50960,
  "Qa7+": 50677,
  "Qa8": 51478,
  "Qa8#": 50537,
  "Qa8+": 51470,
  "Qb1": 51616,
  "Qb1#": 52142,
  "Qb1+": 50575,
  "Qb2": 50620,
  "Qb2#": 50876,
  "Qb2+": 51031,
  "Qb3": 50547,
  "Qb3#": 50589,
  "Qb3+": 50623,
  "Qb4": 51945,
  "Qb4#": 51221,
  "Qb4+": 50412,
  "Qb5": 52210,
  "Qb5#": 51721,
  "Qb5+": 51903,
  "Qb6": 52094,
  "Qb6+": 50765,
  "Qb7": 51100,
  "Qb7#": 51636,
  "Qb7+": 52126,
  "Qb8": 50995,
  "Qb8#": 52157,
  "Qb8+": 52006,
  "Qc1": 50403,
  "Qc1#": 52113,
  "Qc1+": 52007,
  "Qc2": 50922,
  "Qc2#": 50980,
  "Qc2+": 50390,
  "Qc3": 52077,
  "Qc3#": 50469,
  "Qc3+": 50490,
  "Qc4": 51370,
  "Qc4+": 51630,
  "Qc5": 50663,
  "Qc5#": 51193,
  "Qc5+": 50474,
  "Qc6": 50867,
  "Qc6#": 51055,
  "Qc6+": 50397,
  "Qc7": 52342,
  "Qc7#": 50376,
  "Qc7+": 52260,
  "Qc8": 50815,
  "Qc8#": 51376,
  "Qc8+": 51620,
  "Qd1": 51183,
  "Qd1#": 52039,
  "Qd1+": 50596,
  "Qd2": 51439,
  "Qd2#": 51681,
  "Qd2+": 50340,
  "Qd3": 50312,
  "Qd3#": 51830,
  "Qd3+": 52010,
  "Qd4": 51519,
  "Qd4#": 50672,
  "Qd4+": 51956,
  "Qd5": 50345,
  "Qd5#": 50742,
  "Qd5+": 50532,
  "Qd6": 51181,
  "Qd6+": 52003,
  "Qd7": 51252,
  "Qd7#": 52373,
  "Qd7+": 52221,
  "Qd8": 50900,
  "Qd8#": 52038,
  "Qd8+": 50909,
  "Qe1": 52163,
  "Qe1#": 50822,
  "Qe1+": 50945,
  "Qe2": 51048,
  "Qe2#": 51402,
  "Qe2+": 50708,
  "Qe3": 50837,
  "Qe3+": 50823,
  "Qe4": 50500,
  "Qe4#": 51726,
  "Qe4+": 51794,
  "Qe5": 51125,
  "Qe5#": 52162,
  "Qe5+": 51772,
  "Qe6": 51355,
  "Qe6#": 50681,
  "Qe6+": 50308,
  "Qe7": 52108,
  "Qe7#": 50645,
  "Qe7+": 50342,
  "Qe8": 52224,
  "Qe8#": 51500,
  "Qe8+": 51392,
  "Qf1": 50913,
  "Qf1#": 52186,
  "Qf1+": 50615,
  "Qf2": 50478,
  "Qf2#": 51058,
  "Qf2+": 51098,
  "Qf3": 50814,
  "Qf3#": 51877,
  "Qf3+": 50353,
  "Qf4": 52143,
  "Qf4#": 52262,
  "Qf4+": 51499,
  "Qf5": 50751,
  "Qf5#": 51736,
  "Qf5+": 50636,
  "Qf6": 51810,
  "Qf6#": 50465,
  "Qf6+": 51471,
  "Qf7": 51567,
  "Qf7#": 52211,
  "Qf7+": 51815,
  "Qf8": 50992,
  "Qf8#": 52284,
  "Qf8+": 50438,
  "Qg1": 51849,
  "Qg1#": 51474,
  "Qg1+": 50864,
  "Qg2": 52325,
  "Qg2#": 50468,
  "Qg2+": 52191,
  "Qg3": 50783,
  "Qg3#": 51614,
  "Qg3+": 51635,
  "Qg4": 50879,
  "Qg4#": 52316,
  "Qg4+": 51729,
  "Qg5": 51627,
  "Qg5#": 51809,
  "Qg5+": 51255,
  "Qg6": 51732,
  "Qg6#": 50999,
  "Qg6+": 50649,
  "Qg7": 52202,
  "Qg7#": 51349,
  "Qg7+": 50295,
  "Qg8": 51584,
  "Qg8#": 50991,
  "Qg8+": 51503,
  "Qh1": 52135,
  "Qh1#": 51482,
  "Qh1+": 51451,
  "Qh2": 51526,
  "Qh2#": 51327,
  "Qh2+": 50458,
  "Qh3": 50298,
  "Qh3#": 50569,
  "Qh3+": 51199,
  "Qh4": 50368,
  "Qh4#": 50330,
  "Qh4+": 51246,
  "Qh5": 51157,
  "Qh5#": 50374,
  "Qh5+": 52254,
  "Qh6": 51637,
  "Qh6#": 51354,
  "Qh6+": 51187,
  "Qh7": 51167,
  "Qh7#": 52099,
  "Qh7+": 51645,
  "Qh8": 50604,
  "Qh8#": 51329,
  "Qh8+": 50422,
  "Qxa1": 51340,
  "Qxa1+": 51375,
  "Qxa2": 51069,
  "Qxa2#": 51507,
  "Qxa2+": 50363,
  "Qxa3": 51123,
  "Qxa3#": 52194,
  "Qxa3+": 52175,
  "Qxa4": 51644,
  "Qxa4+": 50519,
  "Qxa5": 51545,
  "Qxa5#": 51011,
  "Qxa5+": 51224,
  "Qxa6": 51390,
  "Qxa6+": 51785,
  "Qxa7": 52033,
  "Qxa7#": 50665,
  "Qxa7+": 51137,
  "Qxa8": 50450,
  "Qxa8#": 51782,
  "Qxa8+": 51335,
  "Qxb1": 50553,
  "Qxb1+": 52064,
  "Qxb2": 52347,
  "Qxb2#": 50846,
  "Qxb2+": 51064,
  "Qxb3": 52379,
  "Qxb3+": 51295,
  "Qxb4": 51331,
  "Qxb4+": 52134,
  "Qxb5": 50334,
  "Qxb5#": 50656,
  "Qxb5+": 51694,
  "Qxb6": 50318,
  "Qxb6+": 50507,
  "Qxb7": 50373,
  "Qxb7+": 51652,
  "Qxb8": 50351,
  "Qxb8#": 50571,
  "Qxb8+": 51426,
  "Qxc1": 51661,
  "Qxc1+": 51116,
  "Qxc2": 51579,
  "Qxc2#": 52377,
  "Qxc2+": 51667,
  "Qxc3": 51994,
  "Qxc3#": 51932,
  "Qxc3+": 51733,
  "Qxc4": 50958,
  "Qxc4+": 51781,
  "Qxc5": 51515,
  "Qxc5+": 52000,
  "Qxc6": 51037,
  "Qxc6+": 51351,
  "Qxc7": 51040,
  "Qxc7#": 52097,
  "Qxc7+": 52160,
  "Qxc8": 51531,
  "Qxc8#": 51303,
  "Qxc8+": 50828,
  "Qxd1": 50387,
  "Qxd1#": 52068,
  "Qxd1+": 51097,
  "Qxd2": 51831,
  "Qxd2#": 51251,
  "Qxd2+": 51445,
  "Qxd3": 51509,
  "Qxd3+": 51186,
  "Qxd4": 51469,
  "Qxd4#": 51750,
  "Qxd4+": 50928,
  "Qxd5": 51879,
  "Qxd5+": 51316,
  "Qxd6": 51207,
  "Qxd6+": 50843,
  "Qxd7": 52292,
  "Qxd7#": 51108,
  "Qxd7+": 51036,
  "Qxd8": 50276,
  "Qxd8#": 51846,
  "Qxd8+": 51576,
  "Qxe1": 51111,
  "Qxe1#": 51657,
  "Qxe1+": 50444,
  "Qxe2": 50429,
  "Qxe2#": 51572,
  "Qxe2+": 52334,
  "Qxe3": 50325,
  "Qxe3#": 50398,
  "Qxe3+": 52114,
  "Qxe4": 50294,
  "Qxe4#": 51141,
  "Qxe4+": 52061,
  "Qxe5": 52177,
  "Qxe5#": 50581,
  "Qxe5+": 51909,
  "Qxe6": 51795,
  "Qxe6+": 51068,
  "Qxe7": 51353,
  "Qxe7#": 51611,
  "Qxe7+": 50479,
  "Qxe8": 50307,
  "Qxe8#": 52237,
  "Qxe8+": 51634,
  "Qxf1": 52115,
  "Qxf1#": 50917,
  "Qxf1+": 51128,
  "Qxf2": 50337,
  "Qxf2#": 50955,
  "Qxf2+": 51617,
  "Qxf3": 51940,
  "Qxf3#": 50466,
  "Qxf3+": 52311,
  "Qxf4": 50871,
  "Qxf4#": 50370,
  "Qxf4+": 52053,
  "Qxf5": 51322,
  "Qxf5#": 51875,
  "Qxf5+": 50612,
  "Qxf6": 51656,
  "Qxf6#": 51619,
  "Qxf6+": 51621,
  "Qxf7": 51689,
  "Qxf7#": 51960,
  "Qxf7+": 50859,
  "Qxf8": 50890,
  "Qxf8#": 50745,
  "Qxf8+": 52257,
  "Qxg1": 51082,
  "Qxg1#": 51981,
  "Qxg1+": 50982,
  "Qxg2": 51992,
  "Qxg2#": 52275,
  "Qxg2+": 50967,
  "Qxg3": 51175,
  "Qxg3#": 51995,
  "Qxg3+": 50718,
  "Qxg4": 51041,
  "Qxg4#": 52281,
  "Qxg4+": 52225,
  "Qxg5": 51314,
  "Qxg5#": 52145,
  "Qxg5+": 50962,
  "Qxg6": 50402,
  "Qxg6#": 51670,
  "Qxg6+": 50445,
  "Qxg7": 51170,
  "Qxg7#": 52374,
  "Qxg7+": 51219,
  "Qxg8": 51279,
  "Qxg8+": 50592,
  "Qxh1": 50845,
  "Qxh1+": 50475,
  "Qxh2": 50611,
  "Qxh2#": 50853,
  "Qxh2+": 51360,
  "Qxh3": 50720,
  "Qxh3#": 51921,
  "Qxh3+": 52046,
  "Qxh4": 51717,
  "Qxh4+": 50831,
  "Qxh5": 51358,
  "Qxh5#": 50531,
  "Qxh5+": 51004,
  "Qxh6": 50347,
  "Qxh6#": 52171,
  "Qxh6+": 52031,
  "Qxh7": 51975,
  "Qxh7#": 51739,
  "Qxh7+": 51541,
  "Qxh8": 50339,
  "Qxh8+": 50566,
  "Ra1": 51908,
  "Ra1#": 52220,
  "Ra1+": 51827,
  "Ra2": 50528,
  "Ra2#": 50278,
  "Ra2+": 50543,
  "Ra3": 50816,
  "Ra3#": 51582,
  "Ra3+": 50761,
  "Ra4": 52296,
  "Ra4#": 51646,
  "Ra4+": 51152,
  "Ra5": 50830,
  "Ra5+": 51408,
  "Ra6": 51642,
  "Ra6#": 51441,
  "Ra6+": 51536,
  "Ra7": 50288,
  "Ra7+": 51492,
  "Ra8": 50610,
  "Ra8#": 51820,
  "Ra8+": 52350,
  "Raa1": 51063,
  "Raa2": 51134,
  "Raa7": 50324,
  "Raa8": 51292,
  "Rab1": 51222,
  "Rab2": 51948,
  "Rab5": 50284,
  "Rab8": 51855,
  "Rab8+": 51897,
  "Rac1": 51382,
  "Rac7": 51685,
  "Rac8": 52095,
  "Rac8+": 51513,
  "Rad1": 51115,
  "Rad7": 50506,
  "Rad8": 52320,
  "Rad8+": 51151,
  "Rae1": 52185,
  "Rae1+": 51914,
  "Rae3": 50416,
  "Rae7": 51680,
  "Rae8": 52101,
  "Raf1": 50383,
  "Raf1+": 51816,
  "Raf8": 52079,
  "Rag1": 51369,
  "Rag8": 51287,
  "Rag8+": 51328,
  "Rah1": 51933,
  "Rah8": 51918,
  "Raxa4": 51765,
  "Raxc1": 50382,
  "Raxc8": 51516,
  "Raxd1": 51693,
  "Raxd2": 50854,
  "Raxd8": 50929,
  "Raxe1": 51520,
  "Raxe7": 51817,
  "Raxe8": 51301,
  "Raxf8": 51336,
  "Rb1": 52067,
  "Rb1#": 51735,
  "Rb1+": 50326,
  "Rb2": 51708,
  "Rb2+": 50291,
  "Rb3": 51258,
  "Rb3+": 50559,
  "Rb3b1": 50297,
  "Rb3xb2": 51674,
  "Rb4": 51741,
  "Rb5": 50840,
  "Rb5+": 51894,
  "Rb6": 50492,
  "Rb6+": 50328,
  "Rb7": 50813,
  "Rb7+": 52369,
  "Rb8": 52103,
  "Rb8#": 51745,
  "Rb8+": 52047,
  "Rb8b3": 50906,
  "Rb8b4": 50572,
  "Rba3": 50495,
  "Rbb1": 50315,
  "Rbb7": 51563,
  "Rbb8": 50764,
  "Rbc1": 52030,
  "Rbc6": 50502,
  "Rbc8": 51429,
  "Rbd1": 52247,
  "Rbd2": 52358,
  "Rbd7": 50597,
  "Rbd8": 51777,
  "Rbd8+": 51666,
  "Rbe1": 52024,
  "Rbe2": 51195,
  "Rbe8": 52297,
  "Rbf1": 51368,
  "Rbf4": 51209,
  "Rbf8": 51704,
  "Rbg1": 51272,
  "Rbg7+": 50473,
  "Rbg8": 51533,
  "Rbh8": 50799,
  "Rbxb7": 51307,
  "Rbxc8": 50715,
  "Rbxd1": 51890,
  "Rc1": 51978,
  "Rc1#": 51557,
  "Rc1+": 50712,
  "Rc2": 50526,
  "Rc2+": 50598,
  "Rc2xc5": 52274,
  "Rc3": 51521,
  "Rc3+": 52251,
  "Rc4": 51922,
  "Rc4+": 50619,
  "Rc5": 51223,
  "Rc5+": 50527,
  "Rc5xc8": 52306,
  "Rc6": 51253,
  "Rc6+": 50794,
  "Rc7": 51273,
  "Rc7+": 51784,
  "Rc8": 50723,
  "Rc8#": 51986,
  "Rc8+": 51373,
  "Rc8c5": 52127,
  "Rc8xc2": 50448,
  "Rca5": 52199,
  "Rca8": 50586,
  "Rcb1": 50729,
  "Rcb8": 51916,
  "Rcc1": 50651,
  "Rcc2": 50329,
  "Rcc3": 52209,
  "Rcc7": 50844,
  "Rcc8": 51863,
  "Rcd1": 50932,
  "Rcd3": 50969,
  "Rcd7": 50728,
  "Rcd8": 50895,
  "Rce1": 52226,
  "Rce2": 52229,
  "Rce7": 50780,
  "Rce8": 52066,
  "Rcf2": 52140,
  "Rcf3": 52178,
  "Rcf7": 51099,
  "Rcf8": 51822,
  "Rcg1": 50819,
  "Rcg2": 50892,
  "Rcxc6": 50521,
  "Rcxc7": 51972,
  "Rcxd1": 51165,
  "Rcxd6": 51731,
  "Rcxd8": 51544,
  "Rcxf8": 51494,
  "Rd1": 51052,
  "Rd1#": 51962,
  "Rd1+": 50852,
  "Rd1d2": 52330,
  "Rd2": 52149,
  "Rd2+": 50738,
  "Rd3": 52279,
  "Rd3#": 50483,
  "Rd3+": 50894,
  "Rd4": 51047,
  "Rd4+": 51854,
  "Rd5": 51374,
  "Rd5+": 52014,
  "Rd5d7": 50834,
  "Rd6": 50305,
  "Rd6+": 51891,
  "Rd7": 51236,
  "Rd7#": 52086,
  "Rd7+": 50694,
  "Rd8": 51416,
  "Rd8#": 51999,
  "Rd8+": 52147,
  "Rd8d2+": 51197,
  "Rda1": 50655,
  "Rda2": 52002,
  "Rda8": 51339,
  "Rdb1": 51188,
  "Rdb8": 50427,
  "Rdc1": 50546,
  "Rdc7": 50775,
  "Rdc8": 51938,
  "Rdd1": 50883,
  "Rdd2": 50736,
  "Rdd6": 51754,
  "Rdd7": 52060,
  "Rdd8": 51300,
  "Rde1": 52085,
  "Rde1+": 52321,
  "Rde2": 50279,
  "Rde4": 52129,
  "Rde6": 50927,
  "Rde7": 51380,
  "Rde8": 50970,
  "Rdf1": 50629,
  "Rdf8": 52109,
  "Rdg1": 52387,
  "Rdg2": 50364,
  "Rdg8": 50267,
  "Rdh1": 51412,
  "Rdh8": 50668,
  "Rdxc5": 52318,
  "Rdxd3": 52300,
  "Rdxd6": 51540,
  "Rdxd7": 51605,
  "Rdxe5": 51092,
  "Rdxf1": 50839,
  "Rdxf2": 52276,
  "Re1": 50897,
  "Re1#": 51517,
  "Re1+": 51434,
  "Re2": 51939,
  "Re2#": 50578,
  "Re2+": 52172,
  "Re2e3": 50926,
  "Re3": 52052,
  "Re3+": 51437,
  "Re4": 51114,
  "Re4+": 50310,
  "Re4e2": 52072,
  "Re5": 52144,
  "Re5#": 51120,
  "Re5+": 51424,
  "Re6": 51233,
  "Re6+": 51882,
  "Re7": 50711,
  "Re7+": 52304,
  "Re7xe4": 51779,
  "Re8": 50937,
  "Re8#": 51211,
  "Re8+": 50320,
  "Re8e7": 51949,
  "Rea1": 51574,
  "Rea8": 50652,
  "Reb1": 52096,
  "Reb1+": 52290,
  "Reb8": 51268,
  "Rec1": 52159,
  "Rec2": 51568,
  "Rec3": 51675,
  "Rec8": 51573,
  "Red1": 52116,
  "Red2": 50614,
  "Red3": 51220,
  "Red5": 50617,
  "Red7": 52228,
  "Red8": 51696,
  "Ree1": 52122,
  "Ree2": 50415,
  "Ree3": 51072,
  "Ree6": 50602,
  "Ree7": 51900,
  "Ree8": 52091,
  "Ref1": 52190,
  "Ref2": 52057,
  "Ref8": 50369,
  "Reg3": 50956,
  "Reg5": 51026,
  "Rexc1": 52020,
  "Rexc2": 50417,
  "Rexc6": 51352,
  "Rexd1": 50713,
  "Rexd3": 50585,
  "Rexd7": 52092,
  "Rexe6": 51140,
  "Rf1": 51200,
  "Rf1#": 52249,
  "Rf1+": 51371,
  "Rf1xf5": 52360,
  "Rf2": 50505,
  "Rf2#": 51201,
  "Rf2+": 50311,
  "Rf3": 50290,
  "Rf3#": 51308,
  "Rf3+": 52346,
  "Rf4": 50939,
  "Rf4+": 51228,
  "Rf5": 51558,
  "Rf5+": 50950,
  "Rf6": 52299,
  "Rf6#": 51326,
  "Rf6+": 50812,
  "Rf7": 51553,
  "Rf7#": 51728,
  "Rf7+": 51150,
  "Rf8": 50743,
  "Rf8#": 52328,
  "Rf8+": 52184,
  "Rfa1": 50689,
  "Rfa8": 50535,
  "Rfb1": 50421,
  "Rfb1+": 51913,
  "Rfb8": 52253,
  "Rfc1": 51710,
  "Rfc8": 51615,
  "Rfd1": 50520,
  "Rfd1+": 50405,
  "Rfd2": 51038,
  "Rfd3": 50829,
  "Rfd7": 51025,
  "Rfd8": 50587,
  "Rfe1": 52125,
  "Rfe1+": 52138,
  "Rfe2": 52151,
  "Rfe3": 51084,
  "Rfe6": 51299,
  "Rfe7": 52212,
  "Rfe8": 51145,
  "Rfe8+": 50835,
  "Rff2": 52368,
  "Rff6": 50287,
  "Rfg8": 51861,
  "Rfh3": 52219,
  "Rfh8": 50857,
  "Rfxc1": 51990,
  "Rfxc8": 51132,
  "Rfxd1": 51189,
  "Rfxd8": 52215,
  "Rfxe8": 50455,
  "Rfxf2": 50457,
  "Rg1": 51880,
  "Rg1#": 51245,
  "Rg1+": 51850,
  "Rg2": 51763,
  "Rg2+": 51498,
  "Rg2g3": 50446,
  "Rg2g3#": 51631,
  "Rg3": 50699,
  "Rg3#": 51790,
  "Rg3+": 50886,
  "Rg4": 52244,
  "Rg4#": 50591,
  "Rg4+": 51136,
  "Rg5": 51725,
  "Rg5+": 51997,
  "Rg6": 51982,
  "Rg6#": 52073,
  "Rg6+": 51643,
  "Rg7": 51347,
  "Rg7#": 52093,
  "Rg7+": 50574,
  "Rg8": 51007,
  "Rg8#": 51342,
  "Rg8+": 50803,
  "Rgb1": 51237,
  "Rgd8": 52206,
  "Rge4": 50801,
  "Rge5": 52069,
  "Rge6": 51102,
  "Rge7": 50426,
  "Rge8": 51844,
  "Rgf1": 51176,
  "Rgf5": 50795,
  "Rgf8": 51139,
  "Rgg2": 50470,
  "Rgg4": 50542,
  "Rgg7": 52298,
  "Rgh1": 51318,
  "Rgh6": 51088,
  "Rgxf4": 50462,
  "Rgxg7": 50631,
  "Rh1": 51045,
  "Rh1#": 50367,
  "Rh1+": 51550,
  "Rh2": 50525,
  "Rh2#": 52381,
  "Rh2+": 52324,
  "Rh3": 50435,
  "Rh3#": 51122,
  "Rh3+": 51078,
  "Rh4": 52201,
  "Rh4#": 50273,
  "Rh4+": 51743,
  "Rh5": 50570,
  "Rh5#": 50522,
  "Rh5+": 50793,
  "Rh6": 52386,
  "Rh6#": 51035,
  "Rh6+": 50333,
  "Rh7": 50391,
  "Rh7#": 51278,
  "Rh7+": 50676,
  "Rh8": 52343,
  "Rh8#": 50988,
  "Rh8+": 50916,
  "Rha1": 51447,
  "Rha8": 50805,
  "Rhb1": 51033,
  "Rhb7": 51560,
  "Rhb8": 51241,
  "Rhc1": 52312,
  "Rhc8": 51823,
  "Rhd1": 52058,
  "Rhd8": 50607,
  "Rhe1": 50700,
  "Rhe3": 51607,
  "Rhe8": 51920,
  "Rhe8+": 51609,
  "Rhf1": 50641,
  "Rhf8": 51043,
  "Rhg1": 52089,
  "Rhg2": 51146,
  "Rhg3": 51658,
  "Rhg8": 50936,
  "Rhg8+": 50809,
  "Rhh2": 52203,
  "Rhh6": 50810,
  "Rhh7": 50951,
  "Rhh8": 51394,
  "Rhxf1": 51871,
  "Rhxf8": 51578,
  "Rhxh4": 51821,
  "Rxa1": 50548,
  "Rxa1+": 51436,
  "Rxa2": 52161,
  "Rxa2+": 50567,
  "Rxa3": 51511,
  "Rxa4": 51149,
  "Rxa5": 50503,
  "Rxa5#": 51166,
  "Rxa6": 51194,
  "Rxa6+": 51305,
  "Rxa7": 51159,
  "Rxa7#": 52048,
  "Rxa7+": 51623,
  "Rxa8": 52331,
  "Rxa8+": 50314,
  "Rxb1": 51442,
  "Rxb1#": 51294,
  "Rxb1+": 52120,
  "Rxb2": 52021,
  "Rxb2+": 52025,
  "Rxb3": 50747,
  "Rxb3+": 50954,
  "Rxb4": 51158,
  "Rxb4+": 51958,
  "Rxb5": 50959,
  "Rxb5+": 52005,
  "Rxb6": 50925,
  "Rxb6+": 52314,
  "Rxb7": 51598,
  "Rxb7+": 50756,
  "Rxb8": 50841,
  "Rxb8+": 51057,
  "Rxc1": 51310,
  "Rxc1+": 51156,
  "Rxc2": 50304,
  "Rxc2+": 52235,
  "Rxc3": 52308,
  "Rxc3+": 51034,
  "Rxc4": 51664,
  "Rxc4+": 50874,
  "Rxc5": 51315,
  "Rxc5+": 51549,
  "Rxc6": 52117,
  "Rxc6+": 52037,
  "Rxc7": 52004,
  "Rxc7+": 51317,
  "Rxc8": 51860,
  "Rxc8#": 50773,
  "Rxc8+": 51971,
  "Rxd1": 52029,
  "Rxd1#": 51164,
  "Rxd1+": 50824,
  "Rxd2": 50776,
  "Rxd2+": 50436,
  "Rxd3": 51065,
  "Rxd3+": 51463,
  "Rxd4": 51266,
  "Rxd4+": 50772,
  "Rxd5": 51302,
  "Rxd5+": 50395,
  "Rxd6": 50996,
  "Rxd6+": 52313,
  "Rxd7": 50669,
  "Rxd7+": 51963,
  "Rxd8": 51265,
  "Rxd8#": 51104,
  "Rxd8+": 51407,
  "Rxe1": 51337,
  "Rxe1#": 51479,
  "Rxe1+": 52042,
  "Rxe2": 51678,
  "Rxe2+": 50280,
  "Rxe3": 52278,
  "Rxe3+": 51757,
  "Rxe4": 51298,
  "Rxe4+": 50788,
  "Rxe5": 51242,
  "Rxe5+": 52131,
  "Rxe6": 51061,
  "Rxe6+": 50782,
  "Rxe7": 51640,
  "Rxe7+": 50762,
  "Rxe8": 50687,
  "Rxe8#": 50722,
  "Rxe8+": 51919,
  "Rxf1": 51838,
  "Rxf1#": 51343,
  "Rxf1+": 51954,
  "Rxf2": 51172,
  "Rxf2+": 51073,
  "Rxf3": 51965,
  "Rxf3+": 50562,
  "Rxf4": 51163,
  "Rxf4+": 52326,
  "Rxf5": 51454,
  "Rxf5+": 51538,
  "Rxf6": 51724,
  "Rxf6+": 50767,
  "Rxf7": 51107,
  "Rxf7#": 50554,
  "Rxf7+": 51529,
  "Rxf8": 51410,
  "Rxf8#": 51856,
  "Rxf8+": 50966,
  "Rxg1": 51590,
  "Rxg1#": 51697,
  "Rxg1+": 51723,
  "Rxg2": 51952,
  "Rxg2+": 51695,
  "Rxg3": 50454,
  "Rxg3+": 52246,
  "Rxg4": 52294,
  "Rxg4+": 52317,
  "Rxg5": 52353,
  "Rxg5+": 51398,
  "Rxg6": 50759,
  "Rxg6#": 50771,
  "Rxg6+": 52040,
  "Rxg7": 50555,
  "Rxg7#": 51833,
  "Rxg7+": 50660,
  "Rxg8": 51079,
  "Rxg8#": 51066,
  "Rxg8+": 51363,
  "Rxh1": 51746,
  "Rxh1+": 50691,
  "Rxh2": 52351,
  "Rxh2#": 52156,
  "Rxh2+": 51792,
  "Rxh3": 50628,
  "Rxh3+": 50584,
  "Rxh4": 50675,
  "Rxh4+": 51234,
  "Rxh5": 51649,
  "Rxh5#": 50674,
  "Rxh5+": 52214,
  "Rxh6": 51624,
  "Rxh6#": 50973,
  "Rxh6+": 50914,
  "Rxh7": 51535,
  "Rxh7#": 52273,
  "Rxh7+": 52340,
  "Rxh8": 51173,
  "Rxh8+": 51968,
  "a1=Q": 52015,
  "a1=Q+": 50437,
  "a2": 52193,
  "a2+": 51985,
  "a3": 50266,
  "a3#": 50322,
  "a3+": 51848,
  "a4": 50856,
  "a4#": 50292,
  "a4+": 51433,
  "a5": 51878,
  "a5#": 50870,
  "a5+": 50549,
  "a6": 52345,
  "a6+": 52182,
  "a7": 51713,
  "a7+": 51711,
  "a8=Q": 50690,
  "a8=Q+": 52309,
  "axb2": 52139,
  "axb2+": 51379,
  "axb3": 50869,
  "axb4": 52355,
  "axb4+": 51953,
  "axb5": 51653,
  "axb5+": 51110,
  "axb6": 50359,
  "axb7": 50921,
  "b1=Q": 51121,
  "b1=Q+": 50643,
  "b2": 51404,
  "b2+": 51276,
  "b3": 50653,
  "b3#": 50735,
  "b3+": 51185,
  "b4": 50963,
  "b4+": 50509,
  "b5": 52016,
  "b5#": 50750,
  "b5+": 51837,
  "b6": 50431,
  "b6#": 51386,
  "b6+": 51679,
  "b7": 51010,
  "b7#": 51722,
  "b7+": 50428,
  "b8=Q": 51758,
  "b8=Q+": 51244,
  "bxa1=Q": 50277,
  "bxa1=Q+": 50477,
  "bxa2": 50635,
  "bxa2+": 52243,
  "bxa3": 52287,
  "bxa3+": 50985,
  "bxa4": 51625,
  "bxa5": 51988,
  "bxa5+": 50983,
  "bxa6": 51070,
  "bxa6+": 51028,
  "bxa7": 50710,
  "bxa7+": 51601,
  "bxc1=Q+": 50335,
  "bxc2": 50648,
  "bxc2+": 50285,
  "bxc3": 52084,
  "bxc3+": 52280,
  "bxc4": 50640,
  "bxc4+": 50487,
  "bxc5": 50270,
  "bxc5+": 51270,
  "bxc6": 51192,
  "bxc6+": 51089,
  "bxc7": 52208,
  "c1=N": 50608,
  "c1=Q": 51911,
  "c1=Q+": 50488,
  "c2": 51384,
  "c2+": 51996,
  "c3": 51673,
  "c3+": 51608,
  "c4": 50399,
  "c4+": 51775,
  "c5": 51239,
  "c5#": 51587,
  "c5+": 52364,
  "c6": 51487,
  "c6+": 51692,
  "c7": 51703,
  "c7+": 51444,
  "c8=Q": 52078,
  "c8=Q#": 51504,
  "c8=Q+": 51491,
  "cxb1=Q": 50599,
  "cxb2": 50568,
  "cxb2+": 51575,
  "cxb3": 50538,
  "cxb4": 52063,
  "cxb4+": 52261,
  "cxb5": 51787,
  "cxb5+": 51853,
  "cxb6": 51325,
  "cxb6+": 51944,
  "cxb7": 51464,
  "cxb7+": 51075,
  "cxd2": 51462,
  "cxd2+": 51180,
  "cxd3": 50637,
  "cxd3+": 51106,
  "cxd4": 51493,
  "cxd5": 50746,
  "cxd5+": 50582,
  "cxd6": 52081,
  "cxd6+": 51388,
  "cxd7": 51927,
  "cxd7+": 51672,
  "d1=Q": 52076,
  "d1=Q+": 50817,
  "d2": 51847,
  "d2+": 50732,
  "d3": 50785,
  "d3+": 52032,
  "d4": 51832,
  "d4#": 50514,
  "d4+": 51864,
  "d5": 51459,
  "d5+": 52023,
  "d6": 50282,
  "d6#": 50394,
  "d6+": 50386,
  "d7": 51248,
  "d7#": 51430,
  "d7+": 51883,
  "d8=Q": 50609,
  "d8=Q+": 51796,
  "dxc2": 50274,
  "dxc3": 51686,
  "dxc3+": 51718,
  "dxc4": 51311,
  "dxc4+": 52034,
  "dxc5": 51912,
  "dxc5+": 51131,
  "dxc6": 50860,
  "dxc6+": 50802,
  "dxc7": 51413,
  "dxc7+": 51081,
  "dxc8=Q": 51976,
  "dxe2": 52027,
  "dxe3": 51169,
  "dxe3+": 52168,
  "dxe4": 51105,
  "dxe4+": 50425,
  "dxe5": 52207,
  "dxe5+": 50934,
  "dxe6": 52056,
  "dxe6+": 52049,
  "dxe7": 51054,
  "dxe7+": 50401,
  "dxe8=Q": 52118,
  "dxe8=Q+": 50432,
  "e1=Q": 50494,
  "e1=Q+": 51431,
  "e2": 51330,
  "e2+": 50627,
  "e3": 51987,
  "e3+": 51395,
  "e4": 51124,
  "e4+": 50838,
  "e5": 50930,
  "e5+": 51365,
  "e6": 51210,
  "e6#": 52232,
  "e6+": 52266,
  "e7": 51074,
  "e7+": 50833,
  "e8=Q": 50639,
  "e8=Q+": 50888,
  "exd2": 51764,
  "exd2+": 52222,
  "exd3": 50754,
  "exd3+": 51857,
  "exd4": 52372,
  "exd4+": 51421,
  "exd5": 51277,
  "exd5+": 51076,
  "exd6": 50565,
  "exd6+": 51950,
  "exd7": 50946,
  "exd7+": 50508,
  "exd8=Q": 51699,
  "exd8=Q+": 50789,
  "exf1=Q+": 51332,
  "exf2": 50658,
  "exf2+": 52164,
  "exf3": 51449,
  "exf3+": 51204,
  "exf4": 50638,
  "exf4+": 50661,
  "exf5": 51460,
  "exf5+": 51418,
  "exf6": 50442,
  "exf6+": 50704,
  "exf7": 50984,
  "exf7+": 50706,
  "f1=Q": 51182,
  "f1=Q+": 50558,
  "f2": 50919,
  "f2+": 51206,
  "f3": 52111,
  "f3#": 50622,
  "f3+": 52075,
  "f4": 50476,
  "f4#": 50786,
  "f4+": 51596,
  "f5": 52375,
  "f5+": 52240,
  "f6": 50757,
  "f6+": 50787,
  "f7": 51039,
  "f7#": 50974,
  "f7+": 52009,
  "f8=Q": 51225,
  "f8=Q+": 50389,
  "fxe1=Q+": 50413,
  "fxe2": 51304,
  "fxe2+": 52098,
  "fxe3": 52102,
  "fxe3+": 50420,
  "fxe4": 50381,
  "fxe4+": 51202,
  "fxe5": 51002,
  "fxe5+": 51618,
  "fxe6": 51080,
  "fxe6+": 52153,
  "fxe7": 50862,
  "fxg1=N+": 52166,
  "fxg2": 52230,
  "fxg2+": 50647,
  "fxg3": 50302,
  "fxg3+": 50696,
  "fxg4": 50717,
  "fxg4+": 51501,
  "fxg5": 51190,
  "fxg6": 50724,
  "fxg6+": 51799,
  "fxg7": 50705,
  "fxg7+": 51021,
  "fxg8=Q": 52051,
  "fxg8=Q+": 52065,
  "g1=Q": 51338,
  "g2": 50768,
  "g2+": 51518,
  "g3": 51828,
  "g3#": 51705,
  "g3+": 51901,
  "g4": 51753,
  "g4#": 50606,
  "g4+": 50593,
  "g5": 51698,
  "g5#": 51715,
  "g5+": 50511,
  "g6": 51734,
  "g6+": 51980,
  "g7": 51803,
  "g7#": 51592,
  "g7+": 50944,
  "g8=Q": 51161,
  "g8=Q+": 51818,
  "gxf1=Q": 52285,
  "gxf2": 50580,
  "gxf2+": 50411,
  "gxf3": 50321,
  "gxf4": 50472,
  "gxf4+": 50375,
  "gxf5": 51967,
  "gxf6": 52183,
  "gxf6+": 51096,
  "gxf7": 51008,
  "gxf7+": 52146,
  "gxf8=Q": 50354,
  "gxf8=Q+": 51496,
  "gxh1=Q": 50948,
  "gxh2": 52380,
  "gxh2+": 51885,
  "gxh3": 50693,
  "gxh3+": 50352,
  "gxh4": 51029,
  "gxh4+": 51959,
  "gxh5": 51401,
  "gxh5+": 51806,
  "gxh6": 50272,
  "gxh6+": 51973,
  "gxh7": 50530,
  "gxh7+": 51196,
  "gxh8=Q": 51682,
  "h1=Q": 50358,
  "h2": 50832,
  "h2#": 51417,
  "h2+": 51622,
  "h3": 50821,
  "h3+": 51178,
  "h4": 51752,
  "h4#": 52277,
  "h4+": 51216,
  "h5": 51946,
  "h5#": 50362,
  "h5+": 50271,
  "h6": 50281,
  "h6#": 51737,
  "h6+": 52319,
  "h7": 51203,
  "h7+": 51227,
  "h8=Q": 51260,
  "h8=Q+": 52388,
  "hxg2": 50552,
  "hxg2+": 50806,
  "hxg3": 51312,
  "hxg4": 51284,
  "hxg4#": 51539,
  "hxg4+": 50666,
  "hxg5": 51660,
  "hxg5+": 50296,
  "hxg6": 50300,
  "hxg6+": 51925,
  "hxg7": 52189,
  "hxg7+": 52018,
  "hxg8=Q+": 50439
}
