{
  " ": 50267,
  "<end_fen>": 50266,
  "<end_uci>": 50269,
  "<start_fen>": 50265,
  "<start_uci>": 50268,
  "Ba1": 53600,
  "Ba2": 50950,
  "Ba2+": 52673,
  "Ba3": 51148,
  "Ba3#": 50728,
  "Ba3+": 51177,
  "Ba4": 51176,
  "Ba4+": 53837,
  "Ba5": 52398,
  "Ba5+": 50661,
  "Ba6": 50965,
  "Ba6#": 51388,
  "Ba6+": 52875,
  "Ba7": 51689,
  "Ba7+": 53183,
  "Ba8": 51866,
  "Bb1": 52375,
  "Bb2": 51844,
  "Bb2#": 52265,
  "Bb2+": 50914,
  "Bb3": 52590,
  "Bb3#": 51348,
  "Bb3+": 52668,
  "Bb4": 50667,
  "Bb4#": 50730,
  "Bb4+": 51332,
  "Bb5": 53803,
  "Bb5#": 53491,
  "Bb5+": 53533,
  "Bb6": 51774,
  "Bb6#": 53303,
  "Bb6+": 50840,
  "Bb7": 51396,
  "Bb7+": 53438,
  "Bb8": 50695,
  "Bb8+": 51728,
  "Bc1": 50834,
  "Bc1#": 51448,
  "Bc1+": 51157,
  "Bc2": 52203,
  "Bc2+": 53129,
  "Bc3": 53924,
  "Bc3#": 50725,
  "Bc3+": 50686,
  "Bc4": 52958,
  "Bc4+": 51953,
  "Bc5": 52284,
  "Bc5#": 52723,
  "Bc5+": 51454,
  "Bc6": 51276,
  "Bc6#": 51566,
  "Bc6+": 52609,
  "Bc7": 53093,
  "Bc7+": 52474,
  "Bc8": 53063,
  "Bc8#": 52029,
  "Bc8+": 50543,
  "Bd1": 51418,
  "Bd1#": 51096,
  "Bd1+": 53022,
  "Bd2": 52960,
  "Bd2+": 51470,
  "Bd3": 52289,
  "Bd3+": 51279,
  "Bd4": 53648,
  "Bd4#": 53340,
  "Bd4+": 51489,
  "Bd5": 52228,
  "Bd5#": 50581,
  "Bd5+": 53651,
  "Bd6": 53515,
  "Bd6#": 50749,
  "Bd6+": 50848,
  "Bd7": 50370,
  "Bd7#": 53119,
  "Bd7+": 51787,
  "Bd8": 51206,
  "Bd8#": 51564,
  "Bd8+": 52829,
  "Be1": 51190,
  "Be1+": 52617,
  "Be2": 51032,
  "Be2+": 53908,
  "Be3": 52295,
  "Be3#": 52938,
  "Be3+": 52326,
  "Be4": 52849,
  "Be4+": 50383,
  "Be5": 52341,
  "Be5+": 50456,
  "Be6": 51386,
  "Be6#": 53251,
  "Be6+": 53061,
  "Be7": 53468,
  "Be7#": 50799,
  "Be7+": 51681,
  "Be8": 52733,
  "Be8+": 51721,
  "Bf1": 53299,
  "Bf1#": 53271,
  "Bf1+": 51468,
  "Bf2": 50465,
  "Bf2#": 52619,
  "Bf2+": 53460,
  "Bf3": 53916,
  "Bf3#": 50711,
  "Bf3+": 50790,
  "Bf4": 52694,
  "Bf4#": 52275,
  "Bf4+": 53486,
  "Bf5": 53373,
  "Bf5#": 52058,
  "Bf5+": 53601,
  "Bf6": 53087,
  "Bf6#": 53678,
  "Bf6+": 52805,
  "Bf7": 52093,
  "Bf7#": 51620,
  "Bf7+": 50913,
  "Bf8": 53239,
  "Bf8+": 52071,
  "Bg1": 53598,
  "Bg1+": 50862,
  "Bg2": 51812,
  "Bg2#": 51118,
  "Bg2+": 51121,
  "Bg3": 52858,
  "Bg3#": 53352,
  "Bg3+": 51954,
  "Bg4": 52032,
  "Bg4#": 51889,
  "Bg4+": 50861,
  "Bg5": 51643,
  "Bg5#": 52097,
  "Bg5+": 51661,
  "Bg6": 51829,
  "Bg6#": 51979,
  "Bg6+": 52349,
  "Bg7": 53247,
  "Bg7#": 51144,
  "Bg7+": 52309,
  "Bg8": 53094,
  "Bg8+": 51945,
  "Bh1": 51761,
  "Bh2": 53774,
  "Bh2+": 51103,
  "Bh3": 53886,
  "Bh3#": 51377,
  "Bh3+": 50718,
  "Bh4": 52462,
  "Bh4#": 53854,
  "Bh4+": 50524,
  "Bh5": 51318,
  "Bh5#": 52512,
  "Bh5+": 50474,
  "Bh6": 50683,
  "Bh6#": 51138,
  "Bh6+": 50767,
  "Bh7": 50538,
  "Bh7+": 53722,
  "Bh8": 50582,
  "Bxa1": 51447,
  "Bxa2": 53704,
  "Bxa2+": 53095,
  "Bxa3": 52167,
  "Bxa3+": 52597,
  "Bxa4": 52382,
  "Bxa4+": 52533,
  "Bxa5": 52806,
  "Bxa5+": 52360,
  "Bxa6": 52503,
  "Bxa6#": 53490,
  "Bxa6+": 50555,
  "Bxa7": 51364,
  "Bxa7+": 52345,
  "Bxa8": 52834,
  "Bxb1": 52405,
  "Bxb2": 51824,
  "Bxb2+": 52886,
  "Bxb3": 52497,
  "Bxb3+": 53443,
  "Bxb4": 53474,
  "Bxb4+": 52013,
  "Bxb5": 53435,
  "Bxb5#": 51626,
  "Bxb5+": 53085,
  "Bxb6": 52355,
  "Bxb6#": 53347,
  "Bxb6+": 52789,
  "Bxb7": 50745,
  "Bxb7+": 51616,
  "Bxb8": 53592,
  "Bxc1": 53044,
  "Bxc1+": 51709,
  "Bxc2": 53801,
  "Bxc2+": 53769,
  "Bxc3": 51491,
  "Bxc3#": 53370,
  "Bxc3+": 52567,
  "Bxc4": 53923,
  "Bxc4#": 52241,
  "Bxc4+": 52293,
  "Bxc5": 50355,
  "Bxc5#": 50488,
  "Bxc5+": 53683,
  "Bxc6": 53465,
  "Bxc6#": 51069,
  "Bxc6+": 51408,
  "Bxc7": 52276,
  "Bxc7+": 53877,
  "Bxc8": 51402,
  "Bxd1": 52925,
  "Bxd1+": 52002,
  "Bxd2": 52057,
  "Bxd2+": 51525,
  "Bxd3": 52421,
  "Bxd3#": 51685,
  "Bxd3+": 51359,
  "Bxd4": 53686,
  "Bxd4#": 50948,
  "Bxd4+": 51534,
  "Bxd5": 51876,
  "Bxd5+": 52451,
  "Bxd6": 52942,
  "Bxd6#": 50634,
  "Bxd6+": 51414,
  "Bxd7": 53078,
  "Bxd7+": 51508,
  "Bxd8": 52251,
  "Bxd8#": 52505,
  "Bxd8+": 53851,
  "Bxe1": 53615,
  "Bxe1+": 53359,
  "Bxe2": 51985,
  "Bxe2#": 53712,
  "Bxe2+": 51909,
  "Bxe3": 53785,
  "Bxe3+": 52197,
  "Bxe4": 53197,
  "Bxe4+": 52614,
  "Bxe5": 52075,
  "Bxe5#": 52070,
  "Bxe5+": 51823,
  "Bxe6": 50937,
  "Bxe6+": 52414,
  "Bxe7": 52208,
  "Bxe7#": 53004,
  "Bxe7+": 52959,
  "Bxe8": 53028,
  "Bxe8+": 53131,
  "Bxf1": 51456,
  "Bxf1+": 53333,
  "Bxf2": 51960,
  "Bxf2#": 52684,
  "Bxf2+": 51068,
  "Bxf3": 52827,
  "Bxf3#": 53583,
  "Bxf3+": 51062,
  "Bxf4": 52911,
  "Bxf4+": 51524,
  "Bxf5": 52775,
  "Bxf5+": 53033,
  "Bxf6": 52152,
  "Bxf6#": 51345,
  "Bxf6+": 53610,
  "Bxf7": 53788,
  "Bxf7#": 52682,
  "Bxf7+": 50501,
  "Bxf8": 51631,
  "Bxf8+": 53614,
  "Bxg1": 51263,
  "Bxg1+": 52579,
  "Bxg2": 51592,
  "Bxg2+": 50434,
  "Bxg3": 52552,
  "Bxg3#": 50374,
  "Bxg3+": 51150,
  "Bxg4": 50537,
  "Bxg4+": 52896,
  "Bxg5": 52915,
  "Bxg5+": 53890,
  "Bxg6": 53219,
  "Bxg6#": 53396,
  "Bxg6+": 53467,
  "Bxg7": 52416,
  "Bxg7+": 52022,
  "Bxg8": 53545,
  "Bxg8+": 51384,
  "Bxh1": 50713,
  "Bxh2": 52068,
  "Bxh2+": 51814,
  "Bxh3": 52963,
  "Bxh3#": 51059,
  "Bxh3+": 51932,
  "Bxh4": 52048,
  "Bxh4+": 52995,
  "Bxh5": 51604,
  "Bxh5#": 51099,
  "Bxh5+": 51012,
  "Bxh6": 52136,
  "Bxh6+": 50615,
  "Bxh7": 52867,
  "Bxh7#": 53631,
  "Bxh7+": 53739,
  "Bxh8": 51093,
  "Ka1": 50406,
  "Ka2": 52330,
  "Ka3": 51701,
  "Ka4": 51840,
  "Ka4+": 51976,
  "Ka5": 50599,
  "Ka6": 51580,
  "Ka6+": 52064,
  "Ka7": 53072,
  "Ka8": 53105,
  "Kb1": 53069,
  "Kb2": 50458,
  "Kb2+": 52795,
  "Kb3": 50746,
  "Kb3+": 50737,
  "Kb4": 52573,
  "Kb5": 52912,
  "Kb6": 53694,
  "Kb7": 50573,
  "Kb8": 52608,
  "Kc1": 51261,
  "Kc2": 52438,
  "Kc2+": 53469,
  "Kc3": 51695,
  "Kc3+": 50672,
  "Kc4": 53586,
  "Kc4+": 53256,
  "Kc5": 51632,
  "Kc5+": 52887,
  "Kc6": 50814,
  "Kc6+": 50439,
  "Kc7": 50962,
  "Kc8": 51436,
  "Kd1": 50516,
  "Kd1+": 51101,
  "Kd2": 51529,
  "Kd2#": 53224,
  "Kd2+": 51645,
  "Kd3": 51618,
  "Kd4": 51686,
  "Kd4+": 51366,
  "Kd5": 51423,
  "Kd6": 52358,
  "Kd6+": 52423,
  "Kd7": 50450,
  "Kd7+": 51796,
  "Kd8": 52983,
  "Ke1": 51399,
  "Ke2": 52922,
  "Ke2+": 50800,
  "Ke3": 53729,
  "Ke4": 53832,
  "Ke5": 52124,
  "Ke6": 53557,
  "Ke7": 52523,
  "Ke8": 53797,
  "Kf1": 51577,
  "Kf2": 50608,
  "Kf2#": 53528,
  "Kf3": 52971,
  "Kf4": 53353,
  "Kf5": 53731,
  "Kf6": 52966,
  "Kf6+": 51136,
  "Kf7": 52277,
  "Kf8": 52073,
  "Kf8+": 52754,
  "Kg1": 51612,
  "Kg2": 50512,
  "Kg3": 51365,
  "Kg3+": 51463,
  "Kg4": 51737,
  "Kg4+": 52928,
  "Kg5": 50479,
  "Kg6": 51071,
  "Kg7": 50719,
  "Kg8": 52411,
  "Kg8#": 53897,
  "Kg8+": 53782,
  "Kh1": 50645,
  "Kh2": 52743,
  "Kh3": 53338,
  "Kh4": 52736,
  "Kh5": 51382,
  "Kh6": 52182,
  "Kh6+": 52206,
  "Kh7": 52965,
  "Kh8": 50777,
  "Kh8+": 51639,
  "Kxa1": 53736,
  "Kxa2": 52207,
  "Kxa3": 52380,
  "Kxa4": 50692,
  "Kxa5": 51282,
  "Kxa6": 50781,
  "Kxa7": 53585,
  "Kxa8": 52428,
  "Kxb1": 52101,
  "Kxb2": 52814,
  "Kxb3": 51593,
  "Kxb4": 51656,
  "Kxb5": 53201,
  "Kxb6": 52194,
  "Kxb7": 52354,
  "Kxb8": 53404,
  "Kxc1": 51250,
  "Kxc2": 53215,
  "Kxc3": 53654,
  "Kxc4": 51638,
  "Kxc5": 53176,
  "Kxc6": 52627,
  "Kxc7": 51163,
  "Kxc8": 52297,
  "Kxd1": 52179,
  "Kxd2": 53410,
  "Kxd3": 53015,
  "Kxd4": 53863,
  "Kxd5": 50499,
  "Kxd6": 53374,
  "Kxd7": 51431,
  "Kxd8": 52138,
  "Kxe1": 52476,
  "Kxe2": 52507,
  "Kxe3": 52520,
  "Kxe4": 52526,
  "Kxe5": 53137,
  "Kxe6": 50826,
  "Kxe7": 53084,
  "Kxe8": 50831,
  "Kxf1": 51746,
  "Kxf2": 50413,
  "Kxf3": 51014,
  "Kxf4": 50891,
  "Kxf4+": 52050,
  "Kxf5": 53088,
  "Kxf6": 53723,
  "Kxf7": 51649,
  "Kxf8": 52191,
  "Kxg1": 50629,
  "Kxg2": 52897,
  "Kxg3": 52582,
  "Kxg4": 52899,
  "Kxg5": 52785,
  "Kxg6": 52001,
  "Kxg7": 52935,
  "Kxg8": 52587,
  "Kxh1": 50587,
  "Kxh2": 50990,
  "Kxh3": 51316,
  "Kxh4": 53590,
  "Kxh5": 50975,
  "Kxh6": 53566,
  "Kxh7": 51409,
  "Kxh8": 53744,
  "Na1": 52243,
  "Na2": 51049,
  "Na2#": 51482,
  "Na2+": 53154,
  "Na3": 50735,
  "Na3#": 51390,
  "Na3+": 53382,
  "Na4": 52909,
  "Na4+": 52782,
  "Na5": 52917,
  "Na5+": 52415,
  "Na6": 50995,
  "Na6+": 53906,
  "Na7": 50778,
  "Na7#": 51982,
  "Na7+": 53020,
  "Na8": 50991,
  "Na8+": 52494,
  "Nab1": 50743,
  "Nab4": 52944,
  "Nab5": 50687,
  "Nab6": 53165,
  "Nab6+": 50978,
  "Nab7": 52825,
  "Nab8": 51795,
  "Nac1": 50742,
  "Nac3": 52786,
  "Nac4": 50876,
  "Nac5": 53241,
  "Nac6": 52997,
  "Nac7": 52011,
  "Naxb5": 53021,
  "Naxc3": 53691,
  "Naxc4": 52993,
  "Naxc5": 50532,
  "Naxc6": 52195,
  "Nb1": 53065,
  "Nb1+": 51559,
  "Nb1a3": 50575,
  "Nb1c3": 51229,
  "Nb1d2": 51107,
  "Nb2": 52693,
  "Nb2+": 51990,
  "Nb3": 51531,
  "Nb3+": 52245,
  "Nb3a5": 52242,
  "Nb3d4": 52172,
  "Nb3xd4": 50791,
  "Nb4": 51469,
  "Nb4#": 51452,
  "Nb4+": 53112,
  "Nb4a6": 52969,
  "Nb4c6": 53819,
  "Nb4d5": 53539,
  "Nb5": 50824,
  "Nb5#": 50363,
  "Nb5+": 52367,
  "Nb5a3": 51458,
  "Nb5c3": 53117,
  "Nb5d4": 53200,
  "Nb6": 53857,
  "Nb6#": 53730,
  "Nb6+": 53698,
  "Nb6d7": 51826,
  "Nb6xd5": 50908,
  "Nb7": 51637,
  "Nb7+": 51993,
  "Nb8": 51040,
  "Nb8#": 52125,
  "Nb8+": 50497,
  "Nb8c6": 52107,
  "Nb8d7": 52638,
  "Nba2": 52664,
  "Nba3": 51400,
  "Nba5": 51109,
  "Nba6": 53430,
  "Nbc1": 51621,
  "Nbc2": 51583,
  "Nbc3": 50906,
  "Nbc4": 51971,
  "Nbc5": 52235,
  "Nbc6": 51100,
  "Nbc7": 53779,
  "Nbc7+": 51171,
  "Nbc8": 52317,
  "Nbd2": 50525,
  "Nbd2+": 53099,
  "Nbd3": 52556,
  "Nbd4": 51900,
  "Nbd5": 53901,
  "Nbd6": 50379,
  "Nbd6+": 53027,
  "Nbd7": 53848,
  "Nbxa3": 50623,
  "Nbxc2+": 50923,
  "Nbxc3": 50386,
  "Nbxc4": 53421,
  "Nbxc5": 51848,
  "Nbxc6": 53056,
  "Nbxc6+": 52989,
  "Nbxc7+": 52249,
  "Nbxd2": 50678,
  "Nbxd3+": 52667,
  "Nbxd4": 53492,
  "Nbxd5": 52976,
  "Nbxd6": 53759,
  "Nbxd7": 51520,
  "Nc1": 53883,
  "Nc1+": 52378,
  "Nc1a2": 53425,
  "Nc2": 52750,
  "Nc2#": 52872,
  "Nc2+": 51484,
  "Nc2d4": 50820,
  "Nc2xa3": 51198,
  "Nc3": 51122,
  "Nc3#": 51922,
  "Nc3+": 52267,
  "Nc3e2": 52760,
  "Nc4": 53157,
  "Nc4+": 53926,
  "Nc4a3": 51920,
  "Nc4a5": 53842,
  "Nc4xe5": 53305,
  "Nc5": 51765,
  "Nc5#": 53896,
  "Nc5+": 52845,
  "Nc6": 51804,
  "Nc6#": 52088,
  "Nc6+": 52954,
  "Nc6a5": 51994,
  "Nc6e5": 52357,
  "Nc7": 53156,
  "Nc7#": 50932,
  "Nc7+": 51652,
  "Nc8": 52426,
  "Nc8+": 52031,
  "Nc8a7": 51462,
  "Nc8e7": 51159,
  "Nca6": 51155,
  "Ncb1": 51074,
  "Ncb4": 50669,
  "Ncb4+": 50827,
  "Ncb5": 52998,
  "Ncb6": 53476,
  "Ncd1": 51478,
  "Ncd2": 53899,
  "Ncd2#": 51464,
  "Ncd3": 51064,
  "Ncd4": 51182,
  "Ncd5": 50617,
  "Ncd6": 50655,
  "Ncd7": 53388,
  "Ncd8": 53341,
  "Nce1": 50411,
  "Nce2": 52975,
  "Nce2+": 51941,
  "Nce3": 51429,
  "Nce4": 53488,
  "Nce4+": 51500,
  "Nce5": 53254,
  "Nce6": 53406,
  "Nce6+": 52776,
  "Nce7": 53052,
  "Nce8": 53233,
  "Ncxa8": 51996,
  "Ncxb2": 51181,
  "Ncxb4": 51833,
  "Ncxb5": 53816,
  "Ncxb6": 50628,
  "Ncxd4": 52558,
  "Ncxd4+": 51374,
  "Ncxd5": 51417,
  "Ncxd5+": 51235,
  "Ncxd6": 51034,
  "Ncxe2": 51052,
  "Ncxe3": 50886,
  "Ncxe3+": 52794,
  "Ncxe4": 53323,
  "Ncxe5": 53695,
  "Ncxe6": 53733,
  "Ncxe7": 52625,
  "Ncxe8": 53071,
  "Nd1": 50561,
  "Nd1+": 52305,
  "Nd1b2": 52333,
  "Nd2": 53516,
  "Nd2#": 53010,
  "Nd2+": 50633,
  "Nd2b3": 50338,
  "Nd2c4": 50844,
  "Nd2f3": 52540,
  "Nd2xf3": 51209,
  "Nd3": 53708,
  "Nd3#": 52513,
  "Nd3+": 51295,
  "Nd3b4": 50825,
  "Nd4": 53760,
  "Nd4#": 52809,
  "Nd4+": 52135,
  "Nd4f3": 51955,
  "Nd5": 51647,
  "Nd5#": 52256,
  "Nd5+": 52087,
  "Nd5b6": 51579,
  "Nd5f6": 51628,
  "Nd5xb4": 51554,
  "Nd6": 50710,
  "Nd6#": 52181,
  "Nd6+": 53720,
  "Nd6e4": 52623,
  "Nd6f5": 53039,
  "Nd6xc4": 51798,
  "Nd6xf5": 52004,
  "Nd7": 53930,
  "Nd7#": 53700,
  "Nd7+": 51219,
  "Nd7b6": 53852,
  "Nd7f6": 51928,
  "Nd8": 53637,
  "Nd8+": 53549,
  "Nd8f7": 50428,
  "Ndb1": 50828,
  "Ndb3": 50664,
  "Ndb4": 51246,
  "Ndb5": 52134,
  "Ndb6": 50343,
  "Ndb8": 51055,
  "Ndc2": 52953,
  "Ndc3": 51262,
  "Ndc4": 51610,
  "Ndc5": 50417,
  "Ndc6": 52419,
  "Ndc7": 52396,
  "Ndc8": 52218,
  "Nde2": 52904,
  "Nde3": 52888,
  "Nde4": 53178,
  "Nde5": 52008,
  "Nde5+": 51504,
  "Nde6": 52519,
  "Nde6+": 53544,
  "Nde7": 53207,
  "Ndf1": 51218,
  "Ndf2": 53192,
  "Ndf3": 51801,
  "Ndf4": 53310,
  "Ndf5": 50797,
  "Ndf6": 51405,
  "Ndf6+": 52521,
  "Ndf7": 51186,
  "Ndf8": 51077,
  "Ndxb3": 53001,
  "Ndxb4": 52992,
  "Ndxb5": 53109,
  "Ndxc2": 52835,
  "Ndxc4": 51363,
  "Ndxc5": 51451,
  "Ndxe2+": 52543,
  "Ndxe3+": 53524,
  "Ndxe4": 53367,
  "Ndxe5": 51549,
  "Ndxe5+": 51753,
  "Ndxe6": 51878,
  "Ndxe6+": 51903,
  "Ndxe7": 52499,
  "Ndxe7+": 51731,
  "Ndxf2": 52157,
  "Ndxf4": 51085,
  "Ndxf5": 51089,
  "Ndxf6": 50855,
  "Ndxf7": 50901,
  "Ne1": 51894,
  "Ne1+": 53872,
  "Ne1f3": 51723,
  "Ne2": 52676,
  "Ne2+": 52288,
  "Ne2c3": 53907,
  "Ne2d4": 51918,
  "Ne2g3": 53424,
  "Ne2g3+": 52591,
  "Ne3": 52949,
  "Ne3#": 52878,
  "Ne3+": 51112,
  "Ne3c4": 51179,
  "Ne3g4": 51113,
  "Ne3xc4": 51589,
  "Ne4": 53900,
  "Ne4#": 53840,
  "Ne4+": 51578,
  "Ne4c3": 50863,
  "Ne4c5": 52968,
  "Ne4g3": 52094,
  "Ne4g5": 51936,
  "Ne4xc5": 52119,
  "Ne5": 50744,
  "Ne5#": 51614,
  "Ne5+": 53560,
  "Ne5c6": 52779,
  "Ne5d3": 52446,
  "Ne5g6": 50768,
  "Ne6": 53053,
  "Ne6#": 51896,
  "Ne6+": 52490,
  "Ne6c5": 51596,
  "Ne7": 53624,
  "Ne7#": 53160,
  "Ne7+": 52226,
  "Ne7c6": 51391,
  "Ne7g6": 52187,
  "Ne7xg6": 52495,
  "Ne8": 52551,
  "Ne8+": 52213,
  "Nec1": 51942,
  "Nec2": 53894,
  "Nec2+": 51981,
  "Nec3": 53626,
  "Nec4": 50691,
  "Nec5": 51026,
  "Nec6": 51465,
  "Nec7": 52041,
  "Nec7+": 51243,
  "Nec8": 51716,
  "Ned2": 52493,
  "Ned3": 50369,
  "Ned3+": 51572,
  "Ned4": 52880,
  "Ned5": 50480,
  "Ned6": 52534,
  "Ned6+": 51699,
  "Ned7": 53177,
  "Ned8": 52865,
  "Nef1": 51856,
  "Nef2": 51811,
  "Nef2+": 51807,
  "Nef3": 52817,
  "Nef4": 53917,
  "Nef4+": 53675,
  "Nef5": 51547,
  "Nef5+": 51153,
  "Nef6": 52081,
  "Nef6+": 52334,
  "Nef7+": 52855,
  "Neg1": 51292,
  "Neg2": 50659,
  "Neg3": 53365,
  "Neg4": 51855,
  "Neg4+": 53433,
  "Neg5": 50805,
  "Neg5+": 51200,
  "Neg6": 53419,
  "Neg6+": 52178,
  "Neg7": 51696,
  "Neg8": 51957,
  "Nexc3": 53379,
  "Nexc4": 50424,
  "Nexc5": 50486,
  "Nexc6": 53518,
  "Nexc7+": 53565,
  "Nexd2": 51946,
  "Nexd4": 52615,
  "Nexd5": 51772,
  "Nexd6": 52990,
  "Nexd6+": 52501,
  "Nexd7": 53800,
  "Nexf2": 53623,
  "Nexf3": 51767,
  "Nexf3+": 53172,
  "Nexf4": 53231,
  "Nexf5": 53630,
  "Nexf6+": 53519,
  "Nexf7": 52588,
  "Nexg3": 52492,
  "Nexg4": 52595,
  "Nexg5": 52910,
  "Nf1": 51249,
  "Nf1+": 52082,
  "Nf1d2": 52713,
  "Nf1h2": 51232,
  "Nf2": 52170,
  "Nf2#": 50856,
  "Nf2+": 51705,
  "Nf3": 51961,
  "Nf3#": 51776,
  "Nf3+": 51030,
  "Nf3d2": 51234,
  "Nf3d4": 53313,
  "Nf3e5": 51051,
  "Nf3g5+": 53133,
  "Nf3h2": 53007,
  "Nf3h4": 52940,
  "Nf3xd4": 52471,
  "Nf3xg5": 50734,
  "Nf4": 52509,
  "Nf4#": 51635,
  "Nf4+": 53086,
  "Nf5": 53855,
  "Nf5#": 51714,
  "Nf5+": 52883,
  "Nf5xh4": 52080,
  "Nf6": 52077,
  "Nf6#": 51640,
  "Nf6+": 51173,
  "Nf6d5": 52952,
  "Nf6d7": 52337,
  "Nf6g4": 53928,
  "Nf6h5": 53011,
  "Nf7": 51022,
  "Nf7#": 53026,
  "Nf7+": 52069,
  "Nf7d6": 52346,
  "Nf7h6": 52076,
  "Nf8": 53510,
  "Nf8+": 52908,
  "Nf8d7": 51949,
  "Nf8e6": 51343,
  "Nf8h7": 52706,
  "Nfd2": 53298,
  "Nfd3": 52260,
  "Nfd3+": 50772,
  "Nfd4": 53868,
  "Nfd4+": 52365,
  "Nfd5": 50646,
  "Nfd6": 53008,
  "Nfd6+": 52443,
  "Nfd7": 52268,
  "Nfd8": 53781,
  "Nfe1": 50513,
  "Nfe2": 53456,
  "Nfe3": 53714,
  "Nfe3+": 53666,
  "Nfe4": 50489,
  "Nfe5": 53858,
  "Nfe5+": 51858,
  "Nfe6": 52894,
  "Nfe7": 50564,
  "Nfe7+": 52401,
  "Nfe8": 53290,
  "Nfg1": 53017,
  "Nfg3": 51375,
  "Nfg4": 52906,
  "Nfg4+": 53808,
  "Nfg5": 52530,
  "Nfg5+": 52201,
  "Nfg6": 52264,
  "Nfg8": 50943,
  "Nfh2": 53806,
  "Nfh4": 53454,
  "Nfh5": 51449,
  "Nfxd2": 51729,
  "Nfxd3+": 52974,
  "Nfxd4": 51851,
  "Nfxd5": 52742,
  "Nfxd7": 53070,
  "Nfxe1": 51378,
  "Nfxe2": 52056,
  "Nfxe4": 53151,
  "Nfxe5": 51361,
  "Nfxe5+": 51817,
  "Nfxe6": 52458,
  "Nfxe7": 53673,
  "Nfxg4": 53150,
  "Nfxg5": 52601,
  "Ng1": 51870,
  "Ng1+": 51127,
  "Ng1e2": 50766,
  "Ng1f3": 53862,
  "Ng2": 53728,
  "Ng2#": 51158,
  "Ng2+": 50758,
  "Ng3": 51790,
  "Ng3#": 52725,
  "Ng3+": 52427,
  "Ng3e4": 53220,
  "Ng3xe4+": 52541,
  "Ng4": 53325,
  "Ng4#": 53656,
  "Ng4+": 53318,
  "Ng5": 50591,
  "Ng5#": 52633,
  "Ng5+": 51958,
  "Ng5e4": 51704,
  "Ng5f3": 53903,
  "Ng6": 50544,
  "Ng6#": 52718,
  "Ng6+": 53504,
  "Ng6e7": 50953,
  "Ng7": 52833,
  "Ng7#": 50792,
  "Ng7+": 52715,
  "Ng8": 51603,
  "Ng8#": 52184,
  "Ng8+": 50443,
  "Ng8e7": 53579,
  "Ng8f6": 53612,
  "Ng8h6": 51340,
  "Ng8xe7": 51472,
  "Nge2": 51980,
  "Nge3": 52281,
  "Nge3+": 52683,
  "Nge4": 50554,
  "Nge4+": 53662,
  "Nge5": 51535,
  "Nge5+": 53856,
  "Nge6": 52807,
  "Nge6+": 52780,
  "Nge7": 50506,
  "Nge8": 53326,
  "Ngf1": 52433,
  "Ngf2+": 53395,
  "Ngf3": 53351,
  "Ngf4+": 52140,
  "Ngf5": 50973,
  "Ngf5+": 53499,
  "Ngf6": 52699,
  "Ngf6+": 50952,
  "Ngf7+": 52224,
  "Ngf8": 53740,
  "Ngh2": 52350,
  "Ngh5": 51216,
  "Ngh6": 52133,
  "Ngh7": 51162,
  "Ngxe2": 51569,
  "Ngxe3": 52003,
  "Ngxe3+": 50336,
  "Ngxe4": 52298,
  "Ngxe5": 50793,
  "Ngxe6": 52596,
  "Ngxe7": 52308,
  "Ngxf2": 51869,
  "Ngxf2+": 53287,
  "Ngxf3": 53400,
  "Ngxf5": 51281,
  "Ngxf6": 51225,
  "Ngxf7": 51523,
  "Ngxh6+": 53358,
  "Ngxh7": 51712,
  "Nh1": 51070,
  "Nh2": 53509,
  "Nh2+": 53113,
  "Nh2f3+": 51095,
  "Nh3": 53719,
  "Nh3#": 51129,
  "Nh3+": 52019,
  "Nh4": 52607,
  "Nh4#": 50505,
  "Nh4+": 52612,
  "Nh5": 52602,
  "Nh5+": 53213,
  "Nh6": 52863,
  "Nh6#": 50881,
  "Nh6+": 50536,
  "Nh7": 53765,
  "Nh7+": 51036,
  "Nh7f6": 52361,
  "Nh8": 52403,
  "Nh8+": 52192,
  "Nh8f7": 51648,
  "Nhf1": 52285,
  "Nhf2": 51598,
  "Nhf3": 52570,
  "Nhf4": 53267,
  "Nhf5": 51871,
  "Nhf6": 51771,
  "Nhf7": 50341,
  "Nhf8": 53147,
  "Nhg1": 52356,
  "Nhg3": 52604,
  "Nhg5": 51145,
  "Nhg6": 53520,
  "Nhg8": 52314,
  "Nhxf5": 51078,
  "Nhxf6": 53682,
  "Nhxf6+": 51226,
  "Nhxg5": 51998,
  "Nhxg6": 52756,
  "Nxa1": 51195,
  "Nxa1+": 52244,
  "Nxa2": 52254,
  "Nxa2+": 51766,
  "Nxa3": 53664,
  "Nxa3+": 53155,
  "Nxa4": 52539,
  "Nxa5": 52593,
  "Nxa5+": 52956,
  "Nxa6": 53013,
  "Nxa7": 52546,
  "Nxa7#": 50922,
  "Nxa7+": 52804,
  "Nxa8": 53218,
  "Nxa8+": 50586,
  "Nxb1": 50484,
  "Nxb2": 53594,
  "Nxb2+": 52815,
  "Nxb3": 51510,
  "Nxb3+": 51356,
  "Nxb4": 52560,
  "Nxb4+": 50839,
  "Nxb5": 50970,
  "Nxb5+": 53841,
  "Nxb6": 51850,
  "Nxb6#": 50356,
  "Nxb6+": 52114,
  "Nxb7": 50469,
  "Nxb7+": 51832,
  "Nxb8": 50882,
  "Nxc1": 50648,
  "Nxc1+": 50685,
  "Nxc2": 51552,
  "Nxc2+": 51265,
  "Nxc3": 51764,
  "Nxc3+": 51143,
  "Nxc4": 52752,
  "Nxc4+": 51304,
  "Nxc5": 53636,
  "Nxc5+": 52766,
  "Nxc6": 51543,
  "Nxc6#": 52098,
  "Nxc6+": 51518,
  "Nxc7": 50423,
  "Nxc7#": 51997,
  "Nxc7+": 51009,
  "Nxc8": 50821,
  "Nxc8+": 50985,
  "Nxd1": 52176,
  "Nxd1+": 53163,
  "Nxd2": 52030,
  "Nxd2+": 50654,
  "Nxd3": 50548,
  "Nxd3+": 53102,
  "Nxd4": 53187,
  "Nxd4#": 51444,
  "Nxd4+": 52386,
  "Nxd5": 53116,
  "Nxd5+": 53045,
  "Nxd6": 51460,
  "Nxd6#": 53810,
  "Nxd6+": 53553,
  "Nxd7": 53059,
  "Nxd7+": 53123,
  "Nxd8": 52366,
  "Nxd8+": 53292,
  "Nxe1": 50432,
  "Nxe1+": 51694,
  "Nxe2": 53893,
  "Nxe2#": 51048,
  "Nxe2+": 51622,
  "Nxe3": 52024,
  "Nxe3+": 53830,
  "Nxe4": 50850,
  "Nxe4#": 50334,
  "Nxe4+": 50899,
  "Nxe5": 52038,
  "Nxe5+": 52764,
  "Nxe6": 50398,
  "Nxe6+": 50502,
  "Nxe7": 53879,
  "Nxe7#": 52920,
  "Nxe7+": 52893,
  "Nxe8": 51777,
  "Nxe8+": 53149,
  "Nxf1": 52153,
  "Nxf1+": 52605,
  "Nxf2": 53888,
  "Nxf2#": 52466,
  "Nxf2+": 52936,
  "Nxf3": 50400,
  "Nxf3+": 52932,
  "Nxf4": 53104,
  "Nxf4+": 53162,
  "Nxf5": 51207,
  "Nxf5+": 50816,
  "Nxf6": 50747,
  "Nxf6#": 50934,
  "Nxf6+": 53859,
  "Nxf7": 53699,
  "Nxf7#": 51597,
  "Nxf7+": 51407,
  "Nxf8": 50977,
  "Nxf8+": 53064,
  "Nxg1": 50921,
  "Nxg1+": 51317,
  "Nxg2": 51063,
  "Nxg2+": 51307,
  "Nxg3": 50974,
  "Nxg3+": 50431,
  "Nxg4": 50699,
  "Nxg4+": 51521,
  "Nxg5": 51642,
  "Nxg5+": 53262,
  "Nxg6": 51710,
  "Nxg6#": 51268,
  "Nxg6+": 53737,
  "Nxg7": 51086,
  "Nxg7#": 52826,
  "Nxg7+": 50500,
  "Nxg8": 53501,
  "Nxg8+": 53348,
  "Nxh1": 52670,
  "Nxh1#": 50775,
  "Nxh1+": 53866,
  "Nxh2": 53062,
  "Nxh2+": 53423,
  "Nxh3": 50877,
  "Nxh3+": 51581,
  "Nxh4": 51666,
  "Nxh4+": 52973,
  "Nxh5": 51066,
  "Nxh5+": 53418,
  "Nxh6": 53625,
  "Nxh6+": 50477,
  "Nxh7": 52263,
  "Nxh7+": 52637,
  "Nxh8": 50610,
  "Nxh8#": 51323,
  "Nxh8+": 53161,
  "O-O": 51045,
  "O-O+": 52336,
  "O-O-O": 53226,
  "O-O-O+": 50715,
  "Qa1": 52720,
  "Qa1#": 51838,
  "Qa1+": 51147,
  "Qa2": 53074,
  "Qa2+": 51852,
  "Qa3": 52914,
  "Qa3+": 52620,
  "Qa4": 50754,
  "Qa4#": 51633,
  "Qa4+": 53690,
  "Qa5": 51228,
  "Qa5#": 52028,
  "Qa5+": 53068,
  "Qa5c7": 52748,
  "Qa6": 51067,
  "Qa6#": 52783,
  "Qa6+": 52248,
  "Qa7": 52929,
  "Qa7#": 51546,
  "Qa7+": 51060,
  "Qa8": 52407,
  "Qa8#": 50822,
  "Qa8+": 52387,
  "Qaa6": 52164,
  "Qac4": 53040,
  "Qaf8": 51887,
  "Qaxb7": 50601,
  "Qaxb7+": 52860,
  "Qb1": 52642,
  "Qb1#": 53535,
  "Qb1+": 50879,
  "Qb1b3": 50770,
  "Qb1b6": 51210,
  "Qb2": 50967,
  "Qb2#": 51403,
  "Qb2+": 51662,
  "Qb2xb1": 52695,
  "Qb3": 50836,
  "Qb3#": 50900,
  "Qb3+": 50972,
  "Qb3xb2": 52278,
  "Qb4": 53181,
  "Qb4#": 51965,
  "Qb4+": 50593,
  "Qb5": 53643,
  "Qb5#": 52836,
  "Qb5+": 53110,
  "Qb5a4": 51187,
  "Qb6": 53445,
  "Qb6#": 50716,
  "Qb6+": 51199,
  "Qb7": 51786,
  "Qb7#": 52689,
  "Qb7+": 53495,
  "Qb8": 51608,
  "Qb8#": 53564,
  "Qb8+": 53279,
  "Qba5": 51435,
  "Qbb2+": 52962,
  "Qbd8": 50577,
  "Qbxb3": 52259,
  "Qbxd5": 53657,
  "Qc1": 50572,
  "Qc1#": 53478,
  "Qc1+": 53286,
  "Qc2": 51488,
  "Qc2#": 51582,
  "Qc2+": 50552,
  "Qc3": 53416,
  "Qc3#": 50697,
  "Qc3+": 50727,
  "Qc4": 52211,
  "Qc4+": 52677,
  "Qc4a6#": 52452,
  "Qc4xd5": 52988,
  "Qc5": 51037,
  "Qc5#": 51924,
  "Qc5+": 50702,
  "Qc6": 51389,
  "Qc6#": 51703,
  "Qc6+": 50562,
  "Qc7": 53865,
  "Qc7#": 50531,
  "Qc7+": 53724,
  "Qc8": 51301,
  "Qc8#": 52223,
  "Qc8+": 52647,
  "Qcb7+": 50457,
  "Qcc6": 51287,
  "Qcc8": 53090,
  "Qce4": 51668,
  "Qcf5+": 53463,
  "Qcg2+": 50762,
  "Qch3": 51172,
  "Qcxb6": 53296,
  "Qcxd5": 53805,
  "Qcxf4": 52848,
  "Qd1": 51908,
  "Qd1#": 53344,
  "Qd1+": 50915,
  "Qd2": 52335,
  "Qd2#": 52772,
  "Qd2+": 50473,
  "Qd3": 50421,
  "Qd3#": 53005,
  "Qd3+": 53291,
  "Qd4": 52487,
  "Qd4#": 51054,
  "Qd4+": 53198,
  "Qd5": 50478,
  "Qd5#": 51160,
  "Qd5+": 50813,
  "Qd6": 51906,
  "Qd6#": 53874,
  "Qd6+": 53276,
  "Qd7": 52016,
  "Qd7#": 53911,
  "Qd7+": 53660,
  "Qd8": 51450,
  "Qd8#": 53345,
  "Qd8+": 51466,
  "Qd8c7": 51658,
  "Qda5": 51044,
  "Qdb1+": 51213,
  "Qdb8": 50677,
  "Qdc4+": 50940,
  "Qdd8": 53106,
  "Qde7": 53339,
  "Qde8": 53408,
  "Qdf2#": 52230,
  "Qdf6": 50998,
  "Qdg5": 50367,
  "Qdh4": 51571,
  "Qdxb4": 51309,
  "Qe1": 53573,
  "Qe1#": 51310,
  "Qe1+": 51527,
  "Qe2": 51692,
  "Qe2#": 52273,
  "Qe2+": 51110,
  "Qe3": 51333,
  "Qe3#": 50997,
  "Qe3+": 51311,
  "Qe4": 50748,
  "Qe4#": 52843,
  "Qe4+": 52941,
  "Qe4xd5": 53173,
  "Qe5": 51822,
  "Qe5#": 53572,
  "Qe5+": 52913,
  "Qe6": 52190,
  "Qe6#": 51065,
  "Qe6+": 50415,
  "Qe7": 53470,
  "Qe7#": 51013,
  "Qe7+": 50476,
  "Qe8": 53667,
  "Qe8#": 52442,
  "Qe8+": 52255,
  "Qea3+": 50437,
  "Qeb3": 50649,
  "Qeb4": 53864,
  "Qeb6": 53168,
  "Qed2": 50520,
  "Qee1": 51255,
  "Qee3+": 53238,
  "Qeg1": 53532,
  "Qeh4": 52392,
  "Qexb5#": 52033,
  "Qexd5": 50517,
  "Qf1": 51471,
  "Qf1#": 53608,
  "Qf1+": 50955,
  "Qf2": 50706,
  "Qf2#": 51708,
  "Qf2+": 51784,
  "Qf3": 51300,
  "Qf3#": 53075,
  "Qf3+": 50493,
  "Qf4": 53536,
  "Qf4#": 53726,
  "Qf4+": 52441,
  "Qf5": 51175,
  "Qf5#": 52854,
  "Qf5+": 50999,
  "Qf6": 52970,
  "Qf6#": 50693,
  "Qf6+": 52395,
  "Qf7": 52561,
  "Qf7#": 53644,
  "Qf7+": 52978,
  "Qf8": 51600,
  "Qf8#": 53761,
  "Qf8+": 50640,
  "Qfa6": 51665,
  "Qfb4": 51240,
  "Qfc8+": 52320,
  "Qfd3#": 52923,
  "Qfd4+": 51718,
  "Qfd5": 50961,
  "Qfe6": 53925,
  "Qff1": 51861,
  "Qff3": 51321,
  "Qfg2": 51813,
  "Qfxb6+": 50402,
  "Qfxd5": 50989,
  "Qfxg3": 53685,
  "Qg1": 53041,
  "Qg1#": 52399,
  "Qg1+": 51385,
  "Qg2": 53834,
  "Qg2#": 50696,
  "Qg2+": 53617,
  "Qg3": 51233,
  "Qg3#": 52639,
  "Qg3+": 52687,
  "Qg3g8+": 53261,
  "Qg4": 51410,
  "Qg4#": 53820,
  "Qg4+": 52847,
  "Qg5": 52669,
  "Qg5#": 52967,
  "Qg5+": 52021,
  "Qg6": 52852,
  "Qg6#": 51613,
  "Qg6+": 51020,
  "Qg7": 53633,
  "Qg7#": 52183,
  "Qg7+": 50385,
  "Qg8": 52594,
  "Qg8#": 51599,
  "Qg8+": 52447,
  "Qg8g3": 52132,
  "Qg8xd5+": 50917,
  "Qgb5": 53640,
  "Qgd6": 51273,
  "Qgd8+": 51627,
  "Qgf6": 51413,
  "Qgg4#": 50494,
  "Qgh4": 51935,
  "Qgxe6+": 52121,
  "Qh1": 53514,
  "Qh1#": 52412,
  "Qh1+": 52353,
  "Qh2": 52496,
  "Qh2#": 52146,
  "Qh2+": 50681,
  "Qh3": 50397,
  "Qh3#": 50869,
  "Qh3+": 51933,
  "Qh4": 50519,
  "Qh4#": 50454,
  "Qh4+": 52007,
  "Qh4f2": 51196,
  "Qh5": 51873,
  "Qh5#": 50527,
  "Qh5+": 53718,
  "Qh6": 52691,
  "Qh6#": 52189,
  "Qh6+": 51913,
  "Qh7": 51888,
  "Qh7#": 53455,
  "Qh7+": 52709,
  "Qh8": 50936,
  "Qh8#": 52149,
  "Qh8+": 50616,
  "Qhc1": 51102,
  "Qhe6": 53167,
  "Qhf5#": 50475,
  "Qhg7#": 52690,
  "Qhh3": 51398,
  "Qhh6": 50495,
  "Qhxg2": 50566,
  "Qhxg2+": 51017,
  "Qxa1": 52166,
  "Qxa1#": 53738,
  "Qxa1+": 52222,
  "Qxa2": 51734,
  "Qxa2#": 52464,
  "Qxa2+": 50509,
  "Qxa3": 51820,
  "Qxa3#": 53622,
  "Qxa3+": 53593,
  "Qxa4": 52708,
  "Qxa4+": 50783,
  "Qxa5": 52522,
  "Qxa5#": 51629,
  "Qxa5+": 51968,
  "Qxa6": 52252,
  "Qxa6#": 52422,
  "Qxa6+": 52931,
  "Qxa7": 53334,
  "Qxa7#": 51041,
  "Qxa7+": 51842,
  "Qxa8": 50662,
  "Qxa8#": 52927,
  "Qxa8+": 52154,
  "Qxb1": 50843,
  "Qxb1#": 50401,
  "Qxb1+": 53391,
  "Qxb2": 53871,
  "Qxb2#": 51355,
  "Qxb2+": 51724,
  "Qxb3": 53919,
  "Qxb3+": 52096,
  "Qxb4": 52150,
  "Qxb4#": 50801,
  "Qxb4+": 53512,
  "Qxb5": 50462,
  "Qxb5#": 51029,
  "Qxb5+": 52796,
  "Qxb6": 50433,
  "Qxb6+": 50757,
  "Qxb7": 50526,
  "Qxb7+": 52721,
  "Qxb8": 50490,
  "Qxb8#": 50871,
  "Qxb8+": 52306,
  "Qxc1": 52735,
  "Qxc1+": 51810,
  "Qxc2": 52586,
  "Qxc2#": 53918,
  "Qxc2+": 52749,
  "Qxc3": 53255,
  "Qxc3#": 53158,
  "Qxc3+": 52853,
  "Qxc4": 51542,
  "Qxc4+": 52926,
  "Qxc5": 52478,
  "Qxc5#": 51156,
  "Qxc5+": 53266,
  "Qxc6": 51676,
  "Qxc6#": 52148,
  "Qxc6+": 52185,
  "Qxc7": 51679,
  "Qxc7#": 53450,
  "Qxc7+": 53568,
  "Qxc8": 52504,
  "Qxc8#": 52110,
  "Qxc8+": 51324,
  "Qxd1": 50546,
  "Qxd1#": 53401,
  "Qxd1+": 51783,
  "Qxd2": 53006,
  "Qxd2#": 52014,
  "Qxd2+": 52343,
  "Qxd3": 52469,
  "Qxd3+": 51912,
  "Qxd4": 52385,
  "Qxd4#": 52882,
  "Qxd4+": 51497,
  "Qxd5": 53076,
  "Qxd5+": 52129,
  "Qxd6": 51948,
  "Qxd6#": 51691,
  "Qxd6+": 51346,
  "Qxd7": 53783,
  "Qxd7#": 51800,
  "Qxd7+": 51674,
  "Qxd8": 50359,
  "Qxd8#": 53034,
  "Qxd8+": 52583,
  "Qxe1": 51803,
  "Qxe1#": 52727,
  "Qxe1+": 50650,
  "Qxe2": 50626,
  "Qxe2#": 52576,
  "Qxe2+": 53850,
  "Qxe3": 50447,
  "Qxe3#": 50563,
  "Qxe3+": 53477,
  "Qxe4": 50384,
  "Qxe4#": 51849,
  "Qxe4+": 53387,
  "Qxe5": 53595,
  "Qxe5#": 50889,
  "Qxe5+": 53122,
  "Qxe6": 52946,
  "Qxe6+": 51733,
  "Qxe7": 52188,
  "Qxe7#": 52635,
  "Qxe7+": 50707,
  "Qxe8": 50414,
  "Qxe8#": 53693,
  "Qxe8+": 52685,
  "Qxf1": 53479,
  "Qxf1#": 51481,
  "Qxf1+": 51828,
  "Qxf2": 50468,
  "Qxf2#": 51539,
  "Qxf2+": 52643,
  "Qxf3": 53171,
  "Qxf3#": 50694,
  "Qxf3+": 53811,
  "Qxf4": 51394,
  "Qxf4#": 50523,
  "Qxf4+": 53372,
  "Qxf5": 52137,
  "Qxf5#": 53073,
  "Qxf5+": 50946,
  "Qxf6": 52726,
  "Qxf6#": 52646,
  "Qxf6+": 52648,
  "Qxf7": 52784,
  "Qxf7#": 53205,
  "Qxf7+": 51380,
  "Qxf8": 51430,
  "Qxf8#": 51166,
  "Qxf8+": 53721,
  "Qxg1": 51756,
  "Qxg1#": 53237,
  "Qxg1+": 51584,
  "Qxg2": 53252,
  "Qxg2#": 53748,
  "Qxg2+": 51557,
  "Qxg3": 51899,
  "Qxg3#": 53258,
  "Qxg3+": 51125,
  "Qxg4": 51680,
  "Qxg4#": 53757,
  "Qxg4+": 53670,
  "Qxg5": 52126,
  "Qxg5#": 53538,
  "Qxg5+": 51548,
  "Qxg6": 50567,
  "Qxg6#": 52755,
  "Qxg6+": 50652,
  "Qxg7": 51892,
  "Qxg7#": 53913,
  "Qxg7+": 51962,
  "Qxg8": 52066,
  "Qxg8#": 52877,
  "Qxg8+": 50909,
  "Qxh1": 51353,
  "Qxh1+": 50703,
  "Qxh2": 50945,
  "Qxh2#": 51369,
  "Qxh2+": 52196,
  "Qxh3": 51128,
  "Qxh3#": 53144,
  "Qxh3+": 53355,
  "Qxh4": 52830,
  "Qxh4+": 51327,
  "Qxh5": 52193,
  "Qxh5#": 50812,
  "Qxh5+": 51619,
  "Qxh6": 50482,
  "Qxh6#": 53588,
  "Qxh6+": 53331,
  "Qxh7": 53227,
  "Qxh7#": 52859,
  "Qxh7+": 52517,
  "Qxh8": 50471,
  "Qxh8+": 50865,
  "Ra1": 53120,
  "Ra1#": 53661,
  "Ra1+": 52999,
  "Ra1a2": 52104,
  "Ra2": 50798,
  "Ra2#": 50361,
  "Ra2+": 50830,
  "Ra2a1": 51995,
  "Ra2a1#": 52921,
  "Ra2a3": 52199,
  "Ra2a3+": 51201,
  "Ra2a5": 51970,
  "Ra2a7": 53746,
  "Ra2a7+": 51227,
  "Ra2a8": 53141,
  "Ra2xa3": 52649,
  "Ra2xa4": 53202,
  "Ra2xa5": 51254,
  "Ra2xa6": 51455,
  "Ra2xa8": 53793,
  "Ra3": 51302,
  "Ra3#": 52592,
  "Ra3+": 51192,
  "Ra3a2": 52563,
  "Ra3a2+": 53689,
  "Ra3xa2": 53927,
  "Ra3xa2+": 53383,
  "Ra3xa4": 53766,
  "Ra3xa5": 53645,
  "Ra3xa6": 53827,
  "Ra3xa7": 52383,
  "Ra4": 53789,
  "Ra4#": 52711,
  "Ra4+": 51864,
  "Ra4a3": 51038,
  "Ra4a6": 52103,
  "Ra4a8": 52388,
  "Ra4xa2": 52568,
  "Ra4xa5": 52229,
  "Ra5": 51326,
  "Ra5+": 52280,
  "Ra5a2": 52536,
  "Ra5a6": 50507,
  "Ra5a8": 52757,
  "Ra5xa1": 52562,
  "Ra5xa2": 52675,
  "Ra5xa2+": 53023,
  "Ra5xa3": 53343,
  "Ra5xa4": 50609,
  "Ra5xa6+": 50888,
  "Ra6": 52703,
  "Ra6#": 52338,
  "Ra6+": 52511,
  "Ra6a2": 51601,
  "Ra6a3+": 51636,
  "Ra6a7": 51090,
  "Ra6a8": 51320,
  "Ra6xa1": 52705,
  "Ra6xa3": 52089,
  "Ra6xa5": 52020,
  "Ra7": 50376,
  "Ra7#": 50639,
  "Ra7+": 52430,
  "Ra7a4": 53887,
  "Ra7a8": 50815,
  "Ra7xa5": 50724,
  "Ra8": 50944,
  "Ra8#": 52984,
  "Ra8+": 53875,
  "Ra8a2": 52767,
  "Ra8a3": 51335,
  "Ra8a3#": 50858,
  "Ra8a5": 53591,
  "Ra8a6": 50395,
  "Ra8a7": 53354,
  "Raa1": 51722,
  "Raa2": 51839,
  "Raa3": 53558,
  "Raa5": 51551,
  "Raa6": 52528,
  "Raa7": 50446,
  "Raa8": 52091,
  "Rab1": 51966,
  "Rab1+": 50873,
  "Rab2": 53184,
  "Rab3": 52656,
  "Rab5": 50371,
  "Rab6": 52418,
  "Rab7": 52055,
  "Rab8": 53049,
  "Rab8+": 53103,
  "Rac1": 52236,
  "Rac1+": 50930,
  "Rac2": 53794,
  "Rac4": 51154,
  "Rac6": 50492,
  "Rac7": 52777,
  "Rac7#": 51711,
  "Rac8": 53446,
  "Rac8+": 52475,
  "Rad1": 51809,
  "Rad1+": 53500,
  "Rad2": 52435,
  "Rad3": 52477,
  "Rad7": 50761,
  "Rad8": 53824,
  "Rad8+": 51863,
  "Rae1": 53607,
  "Rae1+": 53130,
  "Rae2+": 53195,
  "Rae3": 50605,
  "Rae7": 52771,
  "Rae8": 53457,
  "Rae8+": 53304,
  "Raf1": 50542,
  "Raf1+": 52979,
  "Raf2": 52364,
  "Raf3": 51951,
  "Raf4": 53912,
  "Raf7": 50618,
  "Raf8": 53420,
  "Rag1": 52210,
  "Rag3+": 52787,
  "Rag5": 52425,
  "Rag8": 52079,
  "Rag8+": 52147,
  "Rah1": 53159,
  "Rah2": 50534,
  "Rah6": 51897,
  "Rah8": 53138,
  "Raxa4": 52902,
  "Raxa6": 53773,
  "Raxa7": 50786,
  "Raxb1": 52678,
  "Raxb6": 50933,
  "Raxb8": 50912,
  "Raxc1": 50540,
  "Raxc2": 50455,
  "Raxc8": 52479,
  "Raxd1": 52791,
  "Raxd2": 51372,
  "Raxd8": 51499,
  "Raxe1": 52491,
  "Raxe2": 51245,
  "Raxe3": 52329,
  "Raxe5": 52351,
  "Raxe7": 52981,
  "Raxe8": 52108,
  "Raxf5": 50721,
  "Raxf8": 52155,
  "Rb1": 53399,
  "Rb1#": 52856,
  "Rb1+": 50448,
  "Rb1b2": 52042,
  "Rb1b3": 52214,
  "Rb1b4": 53229,
  "Rb1b6": 52363,
  "Rb1b7": 53096,
  "Rb1b7+": 50928,
  "Rb1xb5": 52344,
  "Rb2": 52816,
  "Rb2+": 50381,
  "Rb2b1": 53655,
  "Rb2b1+": 53602,
  "Rb2b3": 51651,
  "Rb2b5": 51237,
  "Rb2b8+": 51441,
  "Rb2xb1+": 53750,
  "Rb2xb3": 52626,
  "Rb2xb5": 53146,
  "Rb2xb6": 50988,
  "Rb2xb7": 53336,
  "Rb3": 52023,
  "Rb3+": 50854,
  "Rb3b1": 50393,
  "Rb3b2": 52052,
  "Rb3b2+": 52065,
  "Rb3b4": 53135,
  "Rb3b5": 52261,
  "Rb3b7": 53029,
  "Rb3xb2": 52761,
  "Rb3xb2+": 50666,
  "Rb3xb6": 52046,
  "Rb3xb8": 50444,
  "Rb4": 52864,
  "Rb4#": 52671,
  "Rb4+": 52143,
  "Rb4b1": 53025,
  "Rb4b3": 50404,
  "Rb4b5": 52945,
  "Rb4b8": 50472,
  "Rb4xb2+": 51540,
  "Rb4xb3": 50580,
  "Rb4xb6": 53836,
  "Rb4xb7": 50904,
  "Rb5": 51342,
  "Rb5+": 53098,
  "Rb5b3": 52322,
  "Rb5b7": 50653,
  "Rb5xb2": 53043,
  "Rb5xb3+": 51759,
  "Rb5xb6": 50600,
  "Rb6": 50732,
  "Rb6+": 50451,
  "Rb6b4": 53268,
  "Rb6b5+": 50435,
  "Rb6b7": 52688,
  "Rb6b7+": 50651,
  "Rb6xb3": 51370,
  "Rb6xb5": 51412,
  "Rb6xb7": 51882,
  "Rb7": 51298,
  "Rb7+": 53904,
  "Rb7b1": 52370,
  "Rb7b2": 52578,
  "Rb7b3": 52010,
  "Rb7b4": 50931,
  "Rb7b5": 52892,
  "Rb7b6": 53148,
  "Rb7b8": 53665,
  "Rb7b8+": 50407,
  "Rb7xb2": 50335,
  "Rb7xb2+": 52933,
  "Rb8": 53459,
  "Rb8#": 52874,
  "Rb8+": 53360,
  "Rb8b2+": 50658,
  "Rb8b3": 51461,
  "Rb8b4": 50875,
  "Rb8b4+": 52397,
  "Rb8b7": 52039,
  "Rb8xb4": 52884,
  "Rb8xb6": 51664,
  "Rba1": 50568,
  "Rba2": 51495,
  "Rba3": 50739,
  "Rba4": 50392,
  "Rba6": 52009,
  "Rba7": 51001,
  "Rba8": 51732,
  "Rba8+": 52719,
  "Rbb1": 50427,
  "Rbb2": 52237,
  "Rbb3": 53676,
  "Rbb4": 51511,
  "Rbb5": 50547,
  "Rbb6": 52697,
  "Rbb7": 52553,
  "Rbb8": 51194,
  "Rbc1": 53330,
  "Rbc1+": 51634,
  "Rbc2": 50342,
  "Rbc3": 52636,
  "Rbc3+": 53825,
  "Rbc4": 51792,
  "Rbc5": 53881,
  "Rbc6": 50751,
  "Rbc7": 51347,
  "Rbc7+": 51818,
  "Rbc8": 52311,
  "Rbd1": 53707,
  "Rbd2": 53889,
  "Rbd3": 50763,
  "Rbd3+": 53314,
  "Rbd4": 51367,
  "Rbd5": 52092,
  "Rbd6": 52537,
  "Rbd7": 50916,
  "Rbd8": 52919,
  "Rbd8+": 52746,
  "Rbe1": 53321,
  "Rbe2": 51929,
  "Rbe3": 53570,
  "Rbe5": 51831,
  "Rbe8": 53790,
  "Rbf1": 52209,
  "Rbf2": 53368,
  "Rbf4": 51950,
  "Rbf4+": 53780,
  "Rbf8": 52812,
  "Rbg1": 52051,
  "Rbg2+": 50919,
  "Rbg6": 50780,
  "Rbg7+": 50701,
  "Rbg8": 52508,
  "Rbh1": 51641,
  "Rbh8": 51264,
  "Rbxa6": 51490,
  "Rbxa7": 50576,
  "Rbxa7+": 52714,
  "Rbxb2+": 50352,
  "Rbxb3": 51585,
  "Rbxb3+": 51222,
  "Rbxb4": 50910,
  "Rbxb5": 51479,
  "Rbxb7": 52115,
  "Rbxc1": 52538,
  "Rbxc2": 50515,
  "Rbxc4": 50750,
  "Rbxc5": 51673,
  "Rbxc8": 51120,
  "Rbxd1": 53091,
  "Rbxd5": 51294,
  "Rbxd5+": 53496,
  "Rbxf7+": 53646,
  "Rbxh1": 53012,
  "Rc1": 53232,
  "Rc1#": 52544,
  "Rc1+": 51116,
  "Rc1c2": 53799,
  "Rc1c2+": 52323,
  "Rc1c6": 53301,
  "Rc1c7": 51308,
  "Rc1xc5": 50708,
  "Rc2": 50794,
  "Rc2+": 50918,
  "Rc2c1+": 50627,
  "Rc2c3": 52400,
  "Rc2c4": 50968,
  "Rc2c6": 51459,
  "Rc2c7": 51453,
  "Rc2c7+": 52391,
  "Rc2c8": 50846,
  "Rc2xc4": 53571,
  "Rc2xc5": 53747,
  "Rc2xc6": 53828,
  "Rc2xc6+": 51314,
  "Rc2xc7": 51762,
  "Rc2xc8": 50992,
  "Rc2xc8+": 53688,
  "Rc3": 52489,
  "Rc3+": 53713,
  "Rc3c1+": 52823,
  "Rc3c2": 53272,
  "Rc3c4+": 51266,
  "Rc3c5": 53752,
  "Rc3c6": 52417,
  "Rc3c7": 53206,
  "Rc3c8": 50726,
  "Rc3xc2": 51805,
  "Rc3xc4": 50804,
  "Rc3xc5": 52881,
  "Rc3xc6": 53125,
  "Rc3xc7": 53847,
  "Rc4": 53145,
  "Rc4#": 51973,
  "Rc4+": 50966,
  "Rc4c1+": 52680,
  "Rc4c2": 53895,
  "Rc4c3+": 51350,
  "Rc4c5": 52321,
  "Rc4c6": 51781,
  "Rc4c7": 53513,
  "Rc4xc1+": 50339,
  "Rc4xc3": 50704,
  "Rc4xc7": 52240,
  "Rc5": 51967,
  "Rc5+": 50796,
  "Rc5c2": 53427,
  "Rc5c4": 53709,
  "Rc5c7": 53451,
  "Rc5c7+": 53312,
  "Rc5xc2": 52943,
  "Rc5xc3": 51555,
  "Rc5xc4": 51684,
  "Rc5xc8": 53804,
  "Rc5xc8+": 50690,
  "Rc6": 52017,
  "Rc6+": 51256,
  "Rc6c1": 51719,
  "Rc6c1+": 53534,
  "Rc6c2+": 53392,
  "Rc6c3": 51215,
  "Rc6c4": 53705,
  "Rc6c5": 53921,
  "Rc6c7": 52253,
  "Rc6c8": 53036,
  "Rc6c8+": 51025,
  "Rc6xc3": 53627,
  "Rc6xc7": 53735,
  "Rc6xc7+": 51847,
  "Rc6xc8": 50614,
  "Rc7": 52053,
  "Rc7+": 52930,
  "Rc7c1+": 52621,
  "Rc7c2": 53891,
  "Rc7c3": 53288,
  "Rc7c4": 53792,
  "Rc7c5": 50969,
  "Rc7c6": 53861,
  "Rc7c8": 51191,
  "Rc7c8+": 52692,
  "Rc7xc2": 53245,
  "Rc7xc2+": 50467,
  "Rc7xc3": 52095,
  "Rc7xc4": 53000,
  "Rc7xc5": 51747,
  "Rc7xc8": 52751,
  "Rc8": 51134,
  "Rc8#": 53243,
  "Rc8+": 52216,
  "Rc8c2": 52572,
  "Rc8c3": 51486,
  "Rc8c3+": 51360,
  "Rc8c4": 51726,
  "Rc8c5": 53497,
  "Rc8c6": 52049,
  "Rc8c7": 51284,
  "Rc8xc2": 50656,
  "Rc8xc7": 53405,
  "Rca1": 53508,
  "Rca2": 51053,
  "Rca3": 50880,
  "Rca4": 52740,
  "Rca5": 53628,
  "Rca5+": 50817,
  "Rca7": 52653,
  "Rca8": 50895,
  "Rca8+": 52832,
  "Rcb1": 51142,
  "Rcb1+": 53048,
  "Rcb2": 51259,
  "Rcb2+": 50957,
  "Rcb3": 50682,
  "Rcb3+": 52666,
  "Rcb4": 51185,
  "Rcb7": 50485,
  "Rcb7+": 52580,
  "Rcb8": 53136,
  "Rcc1": 51023,
  "Rcc2": 50452,
  "Rcc3": 53642,
  "Rcc4": 53249,
  "Rcc5": 50676,
  "Rcc6": 50671,
  "Rcc7": 51352,
  "Rcc8": 53057,
  "Rcd1": 51507,
  "Rcd1+": 53711,
  "Rcd2": 52368,
  "Rcd2+": 53531,
  "Rcd3": 51562,
  "Rcd3+": 52739,
  "Rcd5": 51349,
  "Rcd6": 53577,
  "Rcd7": 51139,
  "Rcd8": 51442,
  "Rcd8+": 51475,
  "Rce1": 53677,
  "Rce1+": 51422,
  "Rce2": 53680,
  "Rce4": 52622,
  "Rce5": 51868,
  "Rce6": 51188,
  "Rce7": 51230,
  "Rce7+": 53269,
  "Rce8": 53394,
  "Rce8+": 51427,
  "Rcf1": 53818,
  "Rcf2": 53530,
  "Rcf3": 53596,
  "Rcf6": 51061,
  "Rcf7": 51785,
  "Rcf8": 52986,
  "Rcg1": 51306,
  "Rcg2": 51433,
  "Rcg2+": 50419,
  "Rcg7+": 51082,
  "Rcg8": 53143,
  "Rch1": 52701,
  "Rch8": 50897,
  "Rcxa1": 52404,
  "Rcxa3": 51741,
  "Rcxa7": 53669,
  "Rcxb3": 53280,
  "Rcxb5": 53755,
  "Rcxb5+": 53097,
  "Rcxb6": 52174,
  "Rcxb7": 51890,
  "Rcxc2": 50779,
  "Rcxc3": 51717,
  "Rcxc3+": 52453,
  "Rcxc6": 50787,
  "Rcxc6+": 53743,
  "Rcxc7": 53223,
  "Rcxc7+": 53599,
  "Rcxd1": 51884,
  "Rcxd6": 52851,
  "Rcxd7+": 53014,
  "Rcxd8": 52524,
  "Rcxe2": 52810,
  "Rcxe5": 52083,
  "Rcxe6": 50449,
  "Rcxf2": 50387,
  "Rcxf3": 50611,
  "Rcxf4": 52645,
  "Rcxf6+": 52873,
  "Rcxf7": 53674,
  "Rcxf8": 52434,
  "Rcxg7+": 51607,
  "Rcxh2": 50784,
  "Rd1": 51700,
  "Rd1#": 53210,
  "Rd1+": 51368,
  "Rd1d2": 53845,
  "Rd1d3": 53692,
  "Rd1d3+": 51253,
  "Rd1d4": 53846,
  "Rd1d4#": 52061,
  "Rd1d5": 52618,
  "Rd1d6+": 53432,
  "Rd1d7": 52907,
  "Rd1d7#": 52819,
  "Rd1xd3": 53284,
  "Rd2": 53546,
  "Rd2+": 51152,
  "Rd2d1": 53248,
  "Rd2d1+": 50588,
  "Rd2d3": 51371,
  "Rd2d4": 50621,
  "Rd2d6": 51606,
  "Rd2d7+": 52737,
  "Rd2d8": 52085,
  "Rd2d8+": 53309,
  "Rd2xd1+": 51244,
  "Rd2xd3": 50807,
  "Rd2xd4": 53257,
  "Rd2xd5": 51917,
  "Rd2xd6": 53929,
  "Rd2xd7+": 52072,
  "Rd2xd8+": 53822,
  "Rd3": 53754,
  "Rd3#": 50714,
  "Rd3+": 51437,
  "Rd3d2": 51672,
  "Rd3d2+": 51963,
  "Rd3d4": 51075,
  "Rd3d5": 53541,
  "Rd3d6": 52424,
  "Rd3d7": 51630,
  "Rd3xd2": 53294,
  "Rd3xd2+": 52861,
  "Rd3xd4": 53932,
  "Rd3xd5": 53717,
  "Rd3xd7": 53507,
  "Rd3xd7+": 52348,
  "Rd3xd8": 51305,
  "Rd4": 51687,
  "Rd4#": 52221,
  "Rd4+": 53047,
  "Rd4d1": 53295,
  "Rd4d2": 53555,
  "Rd4d2#": 52171,
  "Rd4d3": 51011,
  "Rd4d5": 50556,
  "Rd4d5+": 50638,
  "Rd4d6": 51334,
  "Rd4d7+": 51313,
  "Rd4d8": 50853,
  "Rd4d8+": 53175,
  "Rd4xd1": 51513,
  "Rd4xd3": 52850,
  "Rd4xd5": 51132,
  "Rd4xd6": 51485,
  "Rd4xd6+": 52679,
  "Rd4xd8": 52060,
  "Rd4xd8+": 50620,
  "Rd5": 52220,
  "Rd5+": 53300,
  "Rd5d1": 53772,
  "Rd5d1+": 53169,
  "Rd5d2": 50344,
  "Rd5d3": 53384,
  "Rd5d4": 50570,
  "Rd5d6": 50394,
  "Rd5d6+": 51740,
  "Rd5d7": 51330,
  "Rd5d7+": 50808,
  "Rd5d8+": 50947,
  "Rd5xd2": 51550,
  "Rd5xd3": 53282,
  "Rd5xd4": 52730,
  "Rd5xd6": 53461,
  "Rd5xd7": 52961,
  "Rd5xd8": 53350,
  "Rd6": 50412,
  "Rd6+": 53092,
  "Rd6d1": 51911,
  "Rd6d2": 53727,
  "Rd6d4": 50802,
  "Rd6d5": 50416,
  "Rd6d7": 51269,
  "Rd6d7+": 52660,
  "Rd6d8": 51432,
  "Rd6d8+": 51698,
  "Rd6xd1": 52731,
  "Rd6xd3": 50535,
  "Rd6xd4": 51395,
  "Rd6xd5": 52044,
  "Rd6xd7+": 51114,
  "Rd6xd8+": 52599,
  "Rd7": 51991,
  "Rd7#": 53431,
  "Rd7+": 51088,
  "Rd7d2": 51362,
  "Rd7d2+": 51283,
  "Rd7d3": 53770,
  "Rd7d3+": 50574,
  "Rd7d4": 52890,
  "Rd7d4+": 51126,
  "Rd7d5": 50729,
  "Rd7d6": 51285,
  "Rd7d6+": 51898,
  "Rd7d8": 53742,
  "Rd7d8+": 51220,
  "Rd7xd1": 53849,
  "Rd7xd1+": 52202,
  "Rd7xd2": 50803,
  "Rd7xd3": 52410,
  "Rd7xd4": 51760,
  "Rd7xd5": 50483,
  "Rd7xd5+": 50959,
  "Rd7xd6": 52035,
  "Rd7xd8+": 52652,
  "Rd8": 52290,
  "Rd8#": 53265,
  "Rd8+": 53542,
  "Rd8d2+": 51931,
  "Rd8d3": 52700,
  "Rd8d4": 52871,
  "Rd8d5": 53876,
  "Rd8d6": 51561,
  "Rd8d6+": 52698,
  "Rd8d7": 50364,
  "Rd8xd4": 50425,
  "Rd8xd7": 52270,
  "Rda1": 51027,
  "Rda1+": 50405,
  "Rda2": 53274,
  "Rda3": 52569,
  "Rda6": 50345,
  "Rda8": 52162,
  "Rdb1": 51915,
  "Rdb2": 52372,
  "Rdb3": 52793,
  "Rdb7": 50590,
  "Rdb8": 50624,
  "Rdb8+": 52465,
  "Rdc1": 50835,
  "Rdc1+": 52918,
  "Rdc2": 53390,
  "Rdc2+": 52231,
  "Rdc3": 50884,
  "Rdc3+": 51782,
  "Rdc5": 52271,
  "Rdc6": 53375,
  "Rdc7": 51223,
  "Rdc7#": 50644,
  "Rdc8": 53166,
  "Rdd1": 51416,
  "Rdd2": 51151,
  "Rdd3": 50993,
  "Rdd4": 51248,
  "Rdd6": 52885,
  "Rdd7": 53385,
  "Rdd8": 52106,
  "Rde1": 53429,
  "Rde1+": 53829,
  "Rde2": 50362,
  "Rde3": 50496,
  "Rde4": 53502,
  "Rde6": 51494,
  "Rde7": 52232,
  "Rde7+": 52502,
  "Rde8": 51565,
  "Rdf1": 50982,
  "Rdf1+": 52439,
  "Rdf2": 52246,
  "Rdf2+": 51446,
  "Rdf3": 53578,
  "Rdf4": 51502,
  "Rdf5": 52792,
  "Rdf6": 53032,
  "Rdf7": 52456,
  "Rdf8": 53471,
  "Rdf8+": 51750,
  "Rdg1": 53933,
  "Rdg1+": 53114,
  "Rdg2": 50510,
  "Rdg2#": 51857,
  "Rdg7#": 52535,
  "Rdg8": 50337,
  "Rdg8+": 51843,
  "Rdh1": 52286,
  "Rdh2": 52991,
  "Rdh2#": 53609,
  "Rdh2+": 50366,
  "Rdh5": 51713,
  "Rdh7": 53398,
  "Rdh8": 51046,
  "Rdxa2": 52047,
  "Rdxa5": 51351,
  "Rdxa7+": 52710,
  "Rdxb8": 51021,
  "Rdxc1": 52483,
  "Rdxc2": 50410,
  "Rdxc3": 52844,
  "Rdxc5": 53826,
  "Rdxc5+": 50845,
  "Rdxc6": 51501,
  "Rdxc7": 53635,
  "Rdxc7+": 51424,
  "Rdxc8": 51293,
  "Rdxd1": 51683,
  "Rdxd3": 53796,
  "Rdxd5": 52219,
  "Rdxd6": 52518,
  "Rdxd7": 52624,
  "Rdxd7+": 51671,
  "Rdxe1": 51560,
  "Rdxe2": 51426,
  "Rdxe3": 52869,
  "Rdxe4": 51707,
  "Rdxe5": 51773,
  "Rdxe8": 52798,
  "Rdxf1": 51337,
  "Rdxf2": 53749,
  "Rdxf8+": 52084,
  "Rdxg2+": 53702,
  "Re1": 51445,
  "Re1#": 52480,
  "Re1+": 52325,
  "Re1e2": 51328,
  "Re1e3": 52027,
  "Re1e4": 51615,
  "Re1e4+": 51775,
  "Re1e5": 51983,
  "Re1e6": 51015,
  "Re1e6+": 52759,
  "Re1e7": 52159,
  "Re1e7+": 52818,
  "Re1xe3": 53193,
  "Re1xe4": 50670,
  "Re1xe6": 50924,
  "Re1xe6+": 51978,
  "Re2": 53170,
  "Re2#": 50885,
  "Re2+": 53589,
  "Re2e1": 53244,
  "Re2e1+": 52165,
  "Re2e3": 51493,
  "Re2e3+": 52555,
  "Re2e4": 53629,
  "Re2e5": 51341,
  "Re2e6": 52015,
  "Re2e7": 52525,
  "Re2e8+": 52160,
  "Re2xe1": 53319,
  "Re2xe1+": 50589,
  "Re2xe3": 52215,
  "Re2xe4": 50872,
  "Re2xe5": 52457,
  "Re2xe6": 51835,
  "Re2xe6+": 53466,
  "Re2xe8": 51556,
  "Re2xe8+": 52842,
  "Re3": 53371,
  "Re3+": 52328,
  "Re3e1": 53613,
  "Re3e1+": 50898,
  "Re3e2": 50674,
  "Re3e4": 52406,
  "Re3e6": 53576,
  "Re3e7": 53672,
  "Re3e8+": 51865,
  "Re3xe1": 52841,
  "Re3xe2+": 51477,
  "Re3xe4": 53415,
  "Re3xe5": 50755,
  "Re3xe6": 51476,
  "Re3xe6+": 50372,
  "Re3xe8+": 50788,
  "Re4": 51808,
  "Re4#": 53434,
  "Re4+": 50418,
  "Re4e1": 51757,
  "Re4e1+": 51247,
  "Re4e2": 53407,
  "Re4e3": 50463,
  "Re4e5": 51595,
  "Re4e6": 50833,
  "Re4e6+": 53671,
  "Re4e7": 50598,
  "Re4e7+": 53484,
  "Re4e8+": 53605,
  "Re4xe3": 53082,
  "Re4xe3+": 51008,
  "Re4xe5": 53798,
  "Re4xe6": 52994,
  "Re4xe7": 50981,
  "Re5": 53537,
  "Re5#": 51815,
  "Re5+": 52303,
  "Re5e1+": 51028,
  "Re5e3": 53873,
  "Re5e6": 50963,
  "Re5e7": 51214,
  "Re5e7+": 51988,
  "Re5xe1": 50632,
  "Re5xe1+": 52862,
  "Re5xe2": 50903,
  "Re5xe2+": 50942,
  "Re5xe3+": 51825,
  "Re5xe4": 51926,
  "Re5xe6": 53363,
  "Re5xe7": 53473,
  "Re5xe7+": 50388,
  "Re5xe8": 51563,
  "Re5xe8+": 52895,
  "Re6": 51986,
  "Re6+": 53079,
  "Re6e1": 51170,
  "Re6e1+": 50665,
  "Re6e2": 51202,
  "Re6e3": 50438,
  "Re6e4": 52651,
  "Re6e5": 51867,
  "Re6e7": 50893,
  "Re6e7+": 52822,
  "Re6e8": 51221,
  "Re6xe3": 51794,
  "Re6xe5": 53575,
  "Re6xe7": 51537,
  "Re6xe7+": 51140,
  "Re7": 51115,
  "Re7#": 51338,
  "Re7+": 53802,
  "Re7e1+": 52550,
  "Re7e2": 53525,
  "Re7e2+": 53139,
  "Re7e3": 53211,
  "Re7e5": 53697,
  "Re7e6": 52409,
  "Re7e6+": 52300,
  "Re7xe1": 51164,
  "Re7xe1+": 51018,
  "Re7xe2": 52225,
  "Re7xe3": 53235,
  "Re7xe4": 52924,
  "Re7xe4+": 51322,
  "Re7xe6": 50596,
  "Re7xe8+": 50569,
  "Re8": 51516,
  "Re8#": 51952,
  "Re8+": 50440,
  "Re8e2": 51574,
  "Re8e2+": 50782,
  "Re8e4": 50741,
  "Re8e5": 53817,
  "Re8e5+": 50859,
  "Re8e6": 52866,
  "Re8e7": 53185,
  "Re8e7+": 53611,
  "Re8xe7": 50487,
  "Rea1": 52574,
  "Rea3": 52808,
  "Rea7": 53734,
  "Rea8": 51024,
  "Reb1": 53447,
  "Reb1+": 53776,
  "Reb2": 52112,
  "Reb7": 50663,
  "Reb7+": 52142,
  "Reb8": 52040,
  "Reb8+": 51039,
  "Rec1": 53567,
  "Rec2": 52565,
  "Rec3": 52763,
  "Rec5": 52566,
  "Rec6": 50578,
  "Rec7": 53101,
  "Rec8": 52575,
  "Rec8+": 52577,
  "Red1": 53482,
  "Red1+": 50533,
  "Red2": 50954,
  "Red3": 51964,
  "Red4": 52947,
  "Red5": 50964,
  "Red6": 52319,
  "Red7": 53679,
  "Red8": 52800,
  "Red8#": 51415,
  "Red8+": 51043,
  "Ree1": 53489,
  "Ree2": 50603,
  "Ree3": 51739,
  "Ree4": 52788,
  "Ree5": 52663,
  "Ree6": 50926,
  "Ree7": 53107,
  "Ree8": 53440,
  "Ref1": 53616,
  "Ref1+": 53230,
  "Ref2": 53380,
  "Ref3": 51339,
  "Ref6": 53134,
  "Ref7": 52090,
  "Ref7+": 50956,
  "Ref8": 50521,
  "Reg1": 51690,
  "Reg2": 53550,
  "Reg2#": 51439,
  "Reg2+": 51473,
  "Reg3": 51541,
  "Reg5": 51655,
  "Reg6": 51657,
  "Reg7#": 50874,
  "Reg7+": 52402,
  "Reg8": 52488,
  "Reg8+": 51522,
  "Reh1": 52658,
  "Reh3": 52554,
  "Reh4": 52485,
  "Reh5": 52702,
  "Reh8": 50631,
  "Reh8+": 53839,
  "Rexa2": 51272,
  "Rexa7": 53361,
  "Rexb7": 51072,
  "Rexc1": 53315,
  "Rexc2": 50606,
  "Rexc6": 52186,
  "Rexc7": 52459,
  "Rexc8": 50466,
  "Rexd1": 51117,
  "Rexd3": 50894,
  "Rexd4": 52468,
  "Rexd7": 53444,
  "Rexd8": 52686,
  "Rexe2": 51514,
  "Rexe2#": 50960,
  "Rexe2+": 50769,
  "Rexe3": 53285,
  "Rexe4": 52381,
  "Rexe5": 52454,
  "Rexe6": 51846,
  "Rexe7": 52269,
  "Rexf1": 50723,
  "Rexf2+": 52393,
  "Rexf5": 52234,
  "Rexf7": 51083,
  "Rexf7+": 52980,
  "Rexf8": 51443,
  "Rexg2+": 53915,
  "Rexg5": 53620,
  "Rexg6#": 53080,
  "Rexg7": 52304,
  "Rexg7+": 52026,
  "Rexh1": 50860,
  "Rexh7": 53449,
  "Rf1": 51934,
  "Rf1#": 53710,
  "Rf1+": 52212,
  "Rf1f2": 51545,
  "Rf1f3": 53209,
  "Rf1f4": 51137,
  "Rf1f6#": 53100,
  "Rf1f6+": 51743,
  "Rf1xf2": 51165,
  "Rf1xf5": 53892,
  "Rf2": 50756,
  "Rf2#": 51937,
  "Rf2+": 50420,
  "Rf2f1+": 52557,
  "Rf2f3": 50481,
  "Rf2f4": 51354,
  "Rf2f6": 50660,
  "Rf2f6+": 53529,
  "Rf2f7+": 50459,
  "Rf2f8+": 50983,
  "Rf2xf1+": 50594,
  "Rf2xf4": 50851,
  "Rf2xf6": 52144,
  "Rf2xf7": 53378,
  "Rf2xf7+": 53199,
  "Rf2xf8": 53777,
  "Rf2xf8+": 50679,
  "Rf3": 50380,
  "Rf3#": 52116,
  "Rf3+": 53870,
  "Rf3f1+": 50347,
  "Rf3f2": 51573,
  "Rf3f2+": 51512,
  "Rf3f4": 51806,
  "Rf3f4+": 51644,
  "Rf3f6": 53270,
  "Rf3f7": 52362,
  "Rf3xf2": 50353,
  "Rf3xf2+": 53582,
  "Rf3xf6": 53784,
  "Rf3xf7": 53179,
  "Rf3xf7+": 52481,
  "Rf4": 51519,
  "Rf4+": 51975,
  "Rf4f1": 51299,
  "Rf4f1+": 52173,
  "Rf4f2": 53556,
  "Rf4f2+": 53024,
  "Rf4f3": 53127,
  "Rf4f3+": 51984,
  "Rf4f5": 53307,
  "Rf4f5+": 50643,
  "Rf4f6": 53058,
  "Rf4f7": 50558,
  "Rf4f7+": 50585,
  "Rf4xf3": 52302,
  "Rf4xf3+": 52238,
  "Rf4xf7": 50842,
  "Rf5": 52545,
  "Rf5+": 51532,
  "Rf5f2": 52315,
  "Rf5f3": 53503,
  "Rf5f4": 53182,
  "Rf5f6": 51260,
  "Rf5f6+": 51094,
  "Rf5f7": 50731,
  "Rf5xf2": 53426,
  "Rf5xf3": 53527,
  "Rf5xf4": 52674,
  "Rf5xf6": 50514,
  "Rf5xf7": 50809,
  "Rf6": 53795,
  "Rf6#": 52145,
  "Rf6+": 51297,
  "Rf6f3": 51184,
  "Rf6f4": 53658,
  "Rf6f5": 53221,
  "Rf6f7": 50753,
  "Rf6xf1": 53115,
  "Rf6xf2": 50773,
  "Rf6xf3": 50389,
  "Rf7": 52532,
  "Rf7#": 52846,
  "Rf7+": 51862,
  "Rf7f2+": 50351,
  "Rf7f3": 53174,
  "Rf7f3+": 53278,
  "Rf7f4": 53715,
  "Rf7f5": 51927,
  "Rf7f6": 53297,
  "Rf7f8": 50810,
  "Rf7f8#": 52117,
  "Rf7f8+": 53377,
  "Rf7xf2": 53472,
  "Rf7xf2+": 52036,
  "Rf7xf3": 51438,
  "Rf7xf4": 51358,
  "Rf7xf5": 50958,
  "Rf7xf6": 53493,
  "Rf8": 51161,
  "Rf8#": 53838,
  "Rf8+": 53606,
  "Rf8f2+": 50409,
  "Rf8f3": 52634,
  "Rf8f5": 53547,
  "Rf8f7": 51745,
  "Rfa1": 51079,
  "Rfa2": 51827,
  "Rfa3": 53771,
  "Rfa7": 51904,
  "Rfa8": 50819,
  "Rfb1": 50613,
  "Rfb1#": 52747,
  "Rfb1+": 53128,
  "Rfb2": 53909,
  "Rfb3": 53652,
  "Rfb5": 52950,
  "Rfb7+": 52310,
  "Rfb8": 53716,
  "Rfc1": 52820,
  "Rfc1+": 52542,
  "Rfc2": 51611,
  "Rfc2+": 53778,
  "Rfc6": 51758,
  "Rfc7+": 52455,
  "Rfc8": 52640,
  "Rfd1": 50785,
  "Rfd1+": 50579,
  "Rfd2": 51677,
  "Rfd3": 51325,
  "Rfd4": 53083,
  "Rfd6": 53031,
  "Rfd7": 51653,
  "Rfd8": 50896,
  "Rfd8+": 51393,
  "Rfe1": 53494,
  "Rfe1+": 53517,
  "Rfe2": 53551,
  "Rfe3": 51763,
  "Rfe4+": 51940,
  "Rfe6": 52105,
  "Rfe7": 53647,
  "Rfe8": 51853,
  "Rfe8+": 51331,
  "Rff1": 52420,
  "Rff2": 53902,
  "Rff3": 51989,
  "Rff4": 52870,
  "Rff5": 51425,
  "Rff6": 50373,
  "Rff7": 53668,
  "Rff8": 51956,
  "Rfg1": 52631,
  "Rfg1+": 51834,
  "Rfg2": 51289,
  "Rfg2+": 52484,
  "Rfg3": 53436,
  "Rfg4": 53264,
  "Rfg5+": 53196,
  "Rfg6": 51969,
  "Rfg6+": 52239,
  "Rfg7": 51570,
  "Rfg7+": 50340,
  "Rfg8": 53054,
  "Rfg8+": 51859,
  "Rfh1": 52227,
  "Rfh1+": 51496,
  "Rfh2": 50357,
  "Rfh3": 53659,
  "Rfh5": 51319,
  "Rfh7": 52086,
  "Rfh7+": 53559,
  "Rfh8": 51376,
  "Rfxb6": 50811,
  "Rfxb7": 51881,
  "Rfxc1": 53250,
  "Rfxc7+": 51434,
  "Rfxc8": 51837,
  "Rfxd1": 51916,
  "Rfxd2+": 50584,
  "Rfxd7+": 50764,
  "Rfxd8": 53650,
  "Rfxd8+": 53411,
  "Rfxe1": 52765,
  "Rfxe6+": 53869,
  "Rfxe8": 50675,
  "Rfxf2": 50680,
  "Rfxf2+": 52724,
  "Rfxf3": 51780,
  "Rfxf3#": 51498,
  "Rfxf5": 51751,
  "Rfxf7": 51879,
  "Rfxg1": 50949,
  "Rfxg2": 53281,
  "Rfxg2+": 53067,
  "Rfxg5+": 51675,
  "Rfxg6": 52313,
  "Rfxg6+": 51050,
  "Rfxg7": 53914,
  "Rfxg7+": 51252,
  "Rfxh2": 52078,
  "Rfxh6": 53121,
  "Rfxh7+": 51379,
  "Rg1": 53077,
  "Rg1#": 52006,
  "Rg1+": 53042,
  "Rg1g2": 52611,
  "Rg1g6#": 51568,
  "Rg2": 52900,
  "Rg2+": 52440,
  "Rg2g1#": 50883,
  "Rg2g1+": 53552,
  "Rg2g3": 50657,
  "Rg2g3#": 52681,
  "Rg2g7": 50607,
  "Rg2g7+": 50929,
  "Rg2xg5": 51296,
  "Rg2xg6+": 53413,
  "Rg2xg7+": 51921,
  "Rg3": 51097,
  "Rg3#": 52937,
  "Rg3+": 51419,
  "Rg3g2": 53441,
  "Rg3g4": 50550,
  "Rg3g5": 52712,
  "Rg3g6+": 53521,
  "Rg3xg4": 53190,
  "Rg3xg5+": 53317,
  "Rg3xg6+": 52728,
  "Rg3xg7": 51693,
  "Rg3xg8": 52448,
  "Rg4": 53703,
  "Rg4#": 50907,
  "Rg4+": 51841,
  "Rg4g3": 51212,
  "Rg4g5": 52373,
  "Rg4g6": 53132,
  "Rg4xg2": 52903,
  "Rg4xg2+": 51977,
  "Rg4xg3+": 52898,
  "Rg4xg5+": 52821,
  "Rg4xg7+": 52770,
  "Rg5": 52840,
  "Rg5#": 50641,
  "Rg5+": 53260,
  "Rg5g3": 52951,
  "Rg5g6": 52707,
  "Rg5g8+": 51357,
  "Rg5xg6": 53035,
  "Rg5xg6+": 51943,
