{
  " ": 50267,
  "<end_fen>": 50266,
  "<end_uci>": 50269,
  "<start_fen>": 50265,
  "<start_uci>": 50268,
  "a1": 50332,
  "a2": 50270,
  "a3": 50274,
  "a4": 50283,
  "a5": 50289,
  "a6": 50317,
  "a7": 50294,
  "a8": 50322,
  "b1": 50315,
  "b2": 50314,
  "b3": 50277,
  "b4": 50296,
  "b5": 50311,
  "b6": 50321,
  "b7": 50287,
  "b8": 50290,
  "c1": 50318,
  "c2": 50313,
  "c3": 50275,
  "c4": 50286,
  "c5": 50316,
  "c6": 50280,
  "c7": 50273,
  "c8": 50323,
  "d1": 50271,
  "d2": 50285,
  "d3": 50278,
  "d4": 50303,
  "d5": 50328,
  "d6": 50298,
  "d7": 50330,
  "d8": 50307,
  "e1": 50295,
  "e2": 50284,
  "e3": 50276,
  "e4": 50310,
  "e5": 50312,
  "e6": 50293,
  "e7": 50331,
  "e8": 50319,
  "f1": 50301,
  "f2": 50320,
  "f3": 50308,
  "f4": 50282,
  "f5": 50299,
  "f6": 50306,
  "f7": 50326,
  "f8": 50333,
  "g1": 50325,
  "g2": 50291,
  "g3": 50329,
  "g4": 50302,
  "g5": 50281,
  "g6": 50297,
  "g7": 50327,
  "g8": 50305,
  "h1": 50279,
  "h2": 50324,
  "h3": 50300,
  "h4": 50304,
  "h5": 50292,
  "h6": 50309,
  "h7": 50288,
  "h8": 50272
}
