{
  " ": 250056,
  "<end_fen>": 250055,
  "<start_fen>": 250054,
  "Ba1": 253368,
  "Ba2": 250679,
  "Ba2+": 252425,
  "Ba3": 250878,
  "Ba3#": 250457,
  "Ba3+": 250907,
  "Ba4": 250906,
  "Ba4+": 253606,
  "Ba5": 252149,
  "Ba5+": 250389,
  "Ba6": 250694,
  "Ba6#": 251124,
  "Ba6+": 252632,
  "Ba7": 251430,
  "Ba7+": 252948,
  "Ba8": 251609,
  "Bb1": 252126,
  "Bb2": 251587,
  "Bb2#": 252014,
  "Bb2+": 250643,
  "Bb3": 252342,
  "Bb3#": 251083,
  "Bb3+": 252420,
  "Bb4": 250395,
  "Bb4#": 250459,
  "Bb4+": 251067,
  "Bb5": 253572,
  "Bb5#": 253259,
  "Bb5+": 253301,
  "Bb6": 251516,
  "Bb6#": 253070,
  "Bb6+": 250569,
  "Bb7": 251132,
  "Bb7+": 253205,
  "Bb8": 250423,
  "Bb8+": 251469,
  "Bc1": 250563,
  "Bc1#": 251184,
  "Bc1+": 250887,
  "Bc2": 251951,
  "Bc2+": 252893,
  "Bc3": 253695,
  "Bc3#": 250454,
  "Bc3+": 250414,
  "Bc4": 252717,
  "Bc4+": 251698,
  "Bc5": 252034,
  "Bc5#": 252475,
  "Bc5+": 251190,
  "Bc6": 251009,
  "Bc6#": 251305,
  "Bc6+": 252361,
  "Bc7": 252857,
  "Bc7+": 252226,
  "Bc8": 252826,
  "Bc8#": 251776,
  "Bc8+": 250269,
  "Bd1": 251154,
  "Bd1#": 250826,
  "Bd1+": 252784,
  "Bd2": 252720,
  "Bd2+": 251206,
  "Bd3": 252039,
  "Bd3+": 251012,
  "Bd4": 253417,
  "Bd4#": 253107,
  "Bd4+": 251226,
  "Bd5": 251976,
  "Bd5#": 250308,
  "Bd5+": 253420,
  "Bd6": 253283,
  "Bd6#": 250478,
  "Bd6+": 250577,
  "Bd7": 250096,
  "Bd7#": 252883,
  "Bd7+": 251529,
  "Bd8": 250937,
  "Bd8#": 251303,
  "Bd8+": 252585,
  "Be1": 250921,
  "Be1+": 252369,
  "Be2": 250762,
  "Be2+": 253678,
  "Be3": 252045,
  "Be3#": 252697,
  "Be3+": 252076,
  "Be4": 252605,
  "Be4+": 250109,
  "Be5": 252091,
  "Be5+": 250182,
  "Be6": 251122,
  "Be6#": 253017,
  "Be6+": 252824,
  "Be7": 253235,
  "Be7#": 250528,
  "Be7+": 251422,
  "Be8": 252485,
  "Be8+": 251462,
  "Bf1": 253065,
  "Bf1#": 253037,
  "Bf1+": 251204,
  "Bf2": 250191,
  "Bf2#": 252371,
  "Bf2+": 253227,
  "Bf3": 253687,
  "Bf3#": 250440,
  "Bf3+": 250519,
  "Bf4": 252446,
  "Bf4#": 252024,
  "Bf4+": 253254,
  "Bf5": 253140,
  "Bf5#": 251805,
  "Bf5+": 253369,
  "Bf6": 252851,
  "Bf6#": 253447,
  "Bf6+": 252559,
  "Bf7": 251840,
  "Bf7#": 251359,
  "Bf7+": 250642,
  "Bf8": 253004,
  "Bf8+": 251818,
  "Bg1": 253366,
  "Bg1+": 250591,
  "Bg2": 251554,
  "Bg2#": 250848,
  "Bg2+": 250851,
  "Bg3": 252615,
  "Bg3#": 253119,
  "Bg3+": 251699,
  "Bg4": 251779,
  "Bg4#": 251632,
  "Bg4+": 250590,
  "Bg5": 251383,
  "Bg5#": 251844,
  "Bg5+": 251401,
  "Bg6": 251572,
  "Bg6#": 251724,
  "Bg6+": 252099,
  "Bg7": 253013,
  "Bg7#": 250874,
  "Bg7+": 252059,
  "Bg8": 252858,
  "Bg8+": 251689,
  "Bh1": 251503,
  "Bh2": 253543,
  "Bh2+": 250833,
  "Bh3": 253656,
  "Bh3#": 251113,
  "Bh3+": 250447,
  "Bh4": 252214,
  "Bh4#": 253623,
  "Bh4+": 250250,
  "Bh5": 251052,
  "Bh5#": 252264,
  "Bh5+": 250200,
  "Bh6": 250411,
  "Bh6#": 250868,
  "Bh6+": 250496,
  "Bh7": 250264,
  "Bh7+": 253491,
  "Bh8": 250309,
  "Bxa1": 251183,
  "Bxa2": 253473,
  "Bxa2+": 252859,
  "Bxa3": 251915,
  "Bxa3+": 252349,
  "Bxa4": 252133,
  "Bxa4+": 252285,
  "Bxa5": 252560,
  "Bxa5+": 252110,
  "Bxa6": 252255,
  "Bxa6#": 253258,
  "Bxa6+": 250281,
  "Bxa7": 251099,
  "Bxa7+": 252095,
  "Bxa8": 252590,
  "Bxb1": 252156,
  "Bxb2": 251567,
  "Bxb2+": 252645,
  "Bxb3": 252249,
  "Bxb3+": 253210,
  "Bxb4": 253241,
  "Bxb4+": 251760,
  "Bxb5": 253202,
  "Bxb5#": 251365,
  "Bxb5+": 252849,
  "Bxb6": 252105,
  "Bxb6#": 253114,
  "Bxb6+": 252542,
  "Bxb7": 250474,
  "Bxb7+": 251355,
  "Bxb8": 253360,
  "Bxc1": 252807,
  "Bxc1+": 251450,
  "Bxc2": 253570,
  "Bxc2+": 253538,
  "Bxc3": 251228,
  "Bxc3#": 253137,
  "Bxc3+": 252319,
  "Bxc4": 253694,
  "Bxc4#": 251989,
  "Bxc4+": 252043,
  "Bxc5": 250079,
  "Bxc5#": 250214,
  "Bxc5+": 253452,
  "Bxc6": 253232,
  "Bxc6#": 250799,
  "Bxc6+": 251144,
  "Bxc7": 252026,
  "Bxc7+": 253647,
  "Bxc8": 251138,
  "Bxd1": 252684,
  "Bxd1+": 251748,
  "Bxd2": 251804,
  "Bxd2+": 251263,
  "Bxd3": 252172,
  "Bxd3#": 251426,
  "Bxd3+": 251094,
  "Bxd4": 253455,
  "Bxd4#": 250677,
  "Bxd4+": 251272,
  "Bxd5": 251619,
  "Bxd5+": 252203,
  "Bxd6": 252701,
  "Bxd6#": 250362,
  "Bxd6+": 251150,
  "Bxd7": 252842,
  "Bxd7+": 251246,
  "Bxd8": 252000,
  "Bxd8#": 252257,
  "Bxd8+": 253620,
  "Bxe1": 253383,
  "Bxe1+": 253126,
  "Bxe2": 251730,
  "Bxe2#": 253481,
  "Bxe2+": 251652,
  "Bxe3": 253554,
  "Bxe3+": 251945,
  "Bxe4": 252962,
  "Bxe4+": 252366,
  "Bxe5": 251822,
  "Bxe5#": 251817,
  "Bxe5+": 251566,
  "Bxe6": 250666,
  "Bxe6+": 252165,
  "Bxe7": 251956,
  "Bxe7#": 252765,
  "Bxe7+": 252718,
  "Bxe8": 252790,
  "Bxe8+": 252895,
  "Bxf1": 251192,
  "Bxf1+": 253100,
  "Bxf2": 251705,
  "Bxf2#": 252436,
  "Bxf2+": 250798,
  "Bxf3": 252583,
  "Bxf3#": 253351,
  "Bxf3+": 250792,
  "Bxf4": 252670,
  "Bxf4+": 251262,
  "Bxf5": 252528,
  "Bxf5+": 252795,
  "Bxf6": 251900,
  "Bxf6#": 251080,
  "Bxf6+": 253378,
  "Bxf7": 253557,
  "Bxf7#": 252434,
  "Bxf7+": 250227,
  "Bxf8": 251371,
  "Bxf8+": 253382,
  "Bxg1": 250996,
  "Bxg1+": 252331,
  "Bxg2": 251331,
  "Bxg2+": 250160,
  "Bxg3": 252304,
  "Bxg3#": 250100,
  "Bxg3+": 250880,
  "Bxg4": 250263,
  "Bxg4+": 252655,
  "Bxg5": 252674,
  "Bxg5+": 253660,
  "Bxg6": 252984,
  "Bxg6#": 253163,
  "Bxg6+": 253234,
  "Bxg7": 252167,
  "Bxg7+": 251769,
  "Bxg8": 253313,
  "Bxg8+": 251120,
  "Bxh1": 250442,
  "Bxh2": 251815,
  "Bxh2+": 251556,
  "Bxh3": 252723,
  "Bxh3#": 250789,
  "Bxh3+": 251675,
  "Bxh4": 251795,
  "Bxh4+": 252755,
  "Bxh5": 251343,
  "Bxh5#": 250829,
  "Bxh5+": 250741,
  "Bxh6": 251883,
  "Bxh6+": 250342,
  "Bxh7": 252624,
  "Bxh7#": 253400,
  "Bxh7+": 253508,
  "Bxh8": 250823,
  "Ka1": 250132,
  "Ka2": 252080,
  "Ka3": 251442,
  "Ka4": 251583,
  "Ka4+": 251721,
  "Ka5": 250326,
  "Ka6": 251319,
  "Ka6+": 251811,
  "Ka7": 252835,
  "Ka8": 252869,
  "Kb1": 252832,
  "Kb2": 250184,
  "Kb2+": 252548,
  "Kb3": 250475,
  "Kb3+": 250466,
  "Kb4": 252325,
  "Kb5": 252671,
  "Kb6": 253463,
  "Kb7": 250300,
  "Kb8": 252360,
  "Kc1": 250994,
  "Kc2": 252190,
  "Kc2+": 253236,
  "Kc3": 251436,
  "Kc3+": 250400,
  "Kc4": 253354,
  "Kc4+": 253022,
  "Kc5": 251372,
  "Kc5+": 252646,
  "Kc6": 250543,
  "Kc6+": 250165,
  "Kc7": 250691,
  "Kc8": 251172,
  "Kd1": 250242,
  "Kd1+": 250831,
  "Kd2": 251267,
  "Kd2#": 252989,
  "Kd2+": 251385,
  "Kd3": 251357,
  "Kd4": 251427,
  "Kd4+": 251101,
  "Kd5": 251159,
  "Kd6": 252108,
  "Kd6+": 252175,
  "Kd7": 250176,
  "Kd7+": 251538,
  "Kd8": 252743,
  "Ke1": 251135,
  "Ke2": 252681,
  "Ke2+": 250529,
  "Ke3": 253498,
  "Ke4": 253601,
  "Ke5": 251871,
  "Ke6": 253325,
  "Ke7": 252275,
  "Ke8": 253566,
  "Kf1": 251316,
  "Kf2": 250335,
  "Kf2#": 253296,
  "Kf3": 252731,
  "Kf4": 253120,
  "Kf5": 253500,
  "Kf6": 252726,
  "Kf6+": 250866,
  "Kf7": 252027,
  "Kf8": 251820,
  "Kf8+": 252506,
  "Kg1": 251351,
  "Kg2": 250238,
  "Kg3": 251100,
  "Kg3+": 251199,
  "Kg4": 251478,
  "Kg4+": 252687,
  "Kg5": 250205,
  "Kg6": 250801,
  "Kg7": 250448,
  "Kg8": 252162,
  "Kg8#": 253667,
  "Kg8+": 253551,
  "Kh1": 250373,
  "Kh2": 252495,
  "Kh3": 253105,
  "Kh4": 252488,
  "Kh5": 251118,
  "Kh6": 251930,
  "Kh6+": 251954,
  "Kh7": 252725,
  "Kh8": 250506,
  "Kh8+": 251379,
  "Kxa1": 253505,
  "Kxa2": 251955,
  "Kxa3": 252131,
  "Kxa4": 250420,
  "Kxa5": 251015,
  "Kxa6": 250510,
  "Kxa7": 253353,
  "Kxa8": 252180,
  "Kxb1": 251848,
  "Kxb2": 252569,
  "Kxb3": 251332,
  "Kxb4": 251396,
  "Kxb5": 252966,
  "Kxb6": 251942,
  "Kxb7": 252104,
  "Kxb8": 253171,
  "Kxc1": 250983,
  "Kxc2": 252980,
  "Kxc3": 253423,
  "Kxc4": 251378,
  "Kxc5": 252940,
  "Kxc6": 252379,
  "Kxc7": 250893,
  "Kxc8": 252047,
  "Kxd1": 251927,
  "Kxd2": 253177,
  "Kxd3": 252777,
  "Kxd4": 253632,
  "Kxd5": 250225,
  "Kxd6": 253141,
  "Kxd7": 251167,
  "Kxd8": 251885,
  "Kxe1": 252228,
  "Kxe2": 252259,
  "Kxe3": 252272,
  "Kxe4": 252278,
  "Kxe5": 252901,
  "Kxe6": 250555,
  "Kxe7": 252848,
  "Kxe8": 250560,
  "Kxf1": 251488,
  "Kxf2": 250139,
  "Kxf3": 250743,
  "Kxf4": 250620,
  "Kxf4+": 251797,
  "Kxf5": 252852,
  "Kxf6": 253492,
  "Kxf7": 251389,
  "Kxf8": 251939,
  "Kxg1": 250356,
  "Kxg2": 252656,
  "Kxg3": 252334,
  "Kxg4": 252658,
  "Kxg5": 252538,
  "Kxg6": 251747,
  "Kxg7": 252694,
  "Kxg8": 252339,
  "Kxh1": 250314,
  "Kxh2": 250719,
  "Kxh3": 251050,
  "Kxh4": 253358,
  "Kxh5": 250704,
  "Kxh6": 253334,
  "Kxh7": 251145,
  "Kxh8": 253513,
  "Na1": 251991,
  "Na2": 250779,
  "Na2#": 251218,
  "Na2+": 252918,
  "Na3": 250464,
  "Na3#": 251126,
  "Na3+": 253149,
  "Na4": 252668,
  "Na4+": 252535,
  "Na5": 252676,
  "Na5+": 252166,
  "Na6": 250724,
  "Na6+": 253676,
  "Na7": 250507,
  "Na7#": 251727,
  "Na7+": 252782,
  "Na8": 250720,
  "Na8+": 252246,
  "Nab1": 250472,
  "Nab4": 252703,
  "Nab5": 250415,
  "Nab6": 252929,
  "Nab6+": 250707,
  "Nab7": 252580,
  "Nab8": 251537,
  "Nac1": 250471,
  "Nac3": 252539,
  "Nac4": 250605,
  "Nac5": 253006,
  "Nac6": 252757,
  "Nac7": 251758,
  "Naxb5": 252783,
  "Naxc3": 253460,
  "Naxc4": 252753,
  "Naxc5": 250258,
  "Naxc6": 251943,
  "Nb1": 252828,
  "Nb1+": 251298,
  "Nb1a3": 250302,
  "Nb1c3": 250961,
  "Nb1d2": 250837,
  "Nb2": 252445,
  "Nb2+": 251735,
  "Nb3": 251269,
  "Nb3+": 251994,
  "Nb3a5": 251990,
  "Nb3d4": 251920,
  "Nb3xd4": 250520,
  "Nb4": 251205,
  "Nb4#": 251188,
  "Nb4+": 252876,
  "Nb4a6": 252729,
  "Nb4c6": 253588,
  "Nb4d5": 253307,
  "Nb5": 250553,
  "Nb5#": 250087,
  "Nb5+": 252117,
  "Nb5a3": 251194,
  "Nb5c3": 252881,
  "Nb5d4": 252965,
  "Nb6": 253626,
  "Nb6#": 253499,
  "Nb6+": 253467,
  "Nb6d7": 251569,
  "Nb6xd5": 250637,
  "Nb7": 251377,
  "Nb7+": 251738,
  "Nb8": 250770,
  "Nb8#": 251872,
  "Nb8+": 250223,
  "Nb8c6": 251854,
  "Nb8d7": 252390,
  "Nba2": 252416,
  "Nba3": 251136,
  "Nba5": 250839,
  "Nba6": 253197,
  "Nbc1": 251360,
  "Nbc2": 251322,
  "Nbc3": 250635,
  "Nbc4": 251716,
  "Nbc5": 251983,
  "Nbc6": 250830,
  "Nbc7": 253548,
  "Nbc7+": 250901,
  "Nbc8": 252067,
  "Nbd2": 250251,
  "Nbd2+": 252863,
  "Nbd3": 252308,
  "Nbd4": 251643,
  "Nbd5": 253671,
  "Nbd6": 250105,
  "Nbd6+": 252789,
  "Nbd7": 253617,
  "Nbxa3": 250350,
  "Nbxc2+": 250652,
  "Nbxc3": 250112,
  "Nbxc4": 253188,
  "Nbxc5": 251591,
  "Nbxc6": 252819,
  "Nbxc6+": 252749,
  "Nbxc7+": 251998,
  "Nbxd2": 250406,
  "Nbxd3+": 252419,
  "Nbxd4": 253260,
  "Nbxd5": 252736,
  "Nbxd6": 253528,
  "Nbxd7": 251258,
  "Nc1": 253653,
  "Nc1+": 252129,
  "Nc1a2": 253192,
  "Nc2": 252502,
  "Nc2#": 252629,
  "Nc2+": 251221,
  "Nc2d4": 250549,
  "Nc2xa3": 250929,
  "Nc3": 250852,
  "Nc3#": 251665,
  "Nc3+": 252016,
  "Nc3e2": 252513,
  "Nc4": 252921,
  "Nc4+": 253697,
  "Nc4a3": 251663,
  "Nc4a5": 253611,
  "Nc4xe5": 253072,
  "Nc5": 251507,
  "Nc5#": 253666,
  "Nc5+": 252601,
  "Nc6": 251546,
  "Nc6#": 251835,
  "Nc6+": 252713,
  "Nc6a5": 251739,
  "Nc6e5": 252107,
  "Nc7": 252920,
  "Nc7#": 250661,
  "Nc7+": 251392,
  "Nc8": 252178,
  "Nc8+": 251778,
  "Nc8a7": 251198,
  "Nc8e7": 250889,
  "Nca6": 250885,
  "Ncb1": 250804,
  "Ncb4": 250397,
  "Ncb4+": 250556,
  "Ncb5": 252758,
  "Ncb6": 253244,
  "Ncd1": 251214,
  "Ncd2": 253669,
  "Ncd2#": 251200,
  "Ncd3": 250794,
  "Ncd4": 250912,
  "Ncd5": 250344,
  "Ncd6": 250383,
  "Ncd7": 253155,
  "Ncd8": 253108,
  "Nce1": 250137,
  "Nce2": 252735,
  "Nce2+": 251684,
  "Nce3": 251165,
  "Nce4": 253256,
  "Nce4+": 251238,
  "Nce5": 253020,
  "Nce6": 253173,
  "Nce6+": 252529,
  "Nce7": 252815,
  "Nce8": 252998,
  "Ncxa8": 251742,
  "Ncxb2": 250911,
  "Ncxb4": 251576,
  "Ncxb5": 253585,
  "Ncxb6": 250355,
  "Ncxd4": 252310,
  "Ncxd4+": 251109,
  "Ncxd5": 251153,
  "Ncxd5+": 250967,
  "Ncxd6": 250764,
  "Ncxe2": 250782,
  "Ncxe3": 250615,
  "Ncxe3+": 252547,
  "Ncxe4": 253090,
  "Ncxe5": 253464,
  "Ncxe6": 253502,
  "Ncxe7": 252377,
  "Ncxe8": 252834,
  "Nd1": 250287,
  "Nd1+": 252055,
  "Nd1b2": 252083,
  "Nd2": 253284,
  "Nd2#": 252772,
  "Nd2+": 250361,
  "Nd2b3": 250062,
  "Nd2c4": 250573,
  "Nd2f3": 252292,
  "Nd2xf3": 250941,
  "Nd3": 253477,
  "Nd3#": 252265,
  "Nd3+": 251028,
  "Nd3b4": 250554,
  "Nd4": 253529,
  "Nd4#": 252563,
  "Nd4+": 251882,
  "Nd4f3": 251700,
  "Nd5": 251387,
  "Nd5#": 252005,
  "Nd5+": 251834,
  "Nd5b6": 251318,
  "Nd5f6": 251368,
  "Nd5xb4": 251293,
  "Nd6": 250439,
  "Nd6#": 251929,
  "Nd6+": 253489,
  "Nd6e4": 252375,
  "Nd6f5": 252802,
  "Nd6xc4": 251540,
  "Nd6xf5": 251750,
  "Nd7": 253701,
  "Nd7#": 253469,
  "Nd7+": 250951,
  "Nd7b6": 253621,
  "Nd7f6": 251671,
  "Nd8": 253406,
  "Nd8+": 253317,
  "Nd8f7": 250154,
  "Ndb1": 250557,
  "Ndb3": 250392,
  "Ndb4": 250979,
  "Ndb5": 251881,
  "Ndb6": 250067,
  "Ndb8": 250785,
  "Ndc2": 252712,
  "Ndc3": 250995,
  "Ndc4": 251349,
  "Ndc5": 250143,
  "Ndc6": 252170,
  "Ndc7": 252147,
  "Ndc8": 251966,
  "Nde2": 252663,
  "Nde3": 252647,
  "Nde4": 252942,
  "Nde5": 251754,
  "Nde5+": 251242,
  "Nde6": 252271,
  "Nde6+": 253312,
  "Nde7": 252972,
  "Ndf1": 250950,
  "Ndf2": 252957,
  "Ndf3": 251543,
  "Ndf4": 253077,
  "Ndf5": 250526,
  "Ndf6": 251141,
  "Ndf6+": 252273,
  "Ndf7": 250917,
  "Ndf8": 250807,
  "Ndxb3": 252761,
  "Ndxb4": 252752,
  "Ndxb5": 252873,
  "Ndxc2": 252591,
  "Ndxc4": 251098,
  "Ndxc5": 251187,
  "Ndxe2+": 252295,
  "Ndxe3+": 253292,
  "Ndxe4": 253134,
  "Ndxe5": 251288,
  "Ndxe5+": 251495,
  "Ndxe6": 251621,
  "Ndxe6+": 251646,
  "Ndxe7": 252251,
  "Ndxe7+": 251472,
  "Ndxf2": 251905,
  "Ndxf4": 250815,
  "Ndxf5": 250819,
  "Ndxf6": 250584,
  "Ndxf7": 250630,
  "Ne1": 251637,
  "Ne1+": 253642,
  "Ne1f3": 251464,
  "Ne2": 252428,
  "Ne2+": 252038,
  "Ne2c3": 253677,
  "Ne2d4": 251661,
  "Ne2g3": 253191,
  "Ne2g3+": 252343,
  "Ne3": 252708,
  "Ne3#": 252635,
  "Ne3+": 250842,
  "Ne3c4": 250909,
  "Ne3g4": 250843,
  "Ne3xc4": 251328,
  "Ne4": 253670,
  "Ne4#": 253609,
  "Ne4+": 251317,
  "Ne4c3": 250592,
  "Ne4c5": 252728,
  "Ne4g3": 251841,
  "Ne4g5": 251679,
  "Ne4xc5": 251866,
  "Ne5": 250473,
  "Ne5#": 251353,
  "Ne5+": 253328,
  "Ne5c6": 252532,
  "Ne5d3": 252198,
  "Ne5g6": 250497,
  "Ne6": 252816,
  "Ne6#": 251639,
  "Ne6+": 252242,
  "Ne6c5": 251335,
  "Ne7": 253393,
  "Ne7#": 252924,
  "Ne7+": 251974,
  "Ne7c6": 251127,
  "Ne7g6": 251935,
  "Ne7xg6": 252247,
  "Ne8": 252303,
  "Ne8+": 251961,
  "Nec1": 251686,
  "Nec2": 253664,
  "Nec2+": 251726,
  "Nec3": 253395,
  "Nec4": 250419,
  "Nec5": 250756,
  "Nec6": 251201,
  "Nec7": 251788,
  "Nec7+": 250976,
  "Nec8": 251457,
  "Ned2": 252245,
  "Ned3": 250095,
  "Ned3+": 251311,
  "Ned4": 252637,
  "Ned5": 250206,
  "Ned6": 252286,
  "Ned6+": 251440,
  "Ned7": 252941,
  "Ned8": 252622,
  "Nef1": 251599,
  "Nef2": 251553,
  "Nef2+": 251549,
  "Nef3": 252572,
  "Nef4": 253688,
  "Nef4+": 253444,
  "Nef5": 251285,
  "Nef5+": 250883,
  "Nef6": 251828,
  "Nef6+": 252084,
  "Nef7+": 252612,
  "Neg1": 251025,
  "Neg2": 250387,
  "Neg3": 253132,
  "Neg4": 251598,
  "Neg4+": 253200,
  "Neg5": 250534,
  "Neg5+": 250931,
  "Neg6": 253186,
  "Neg6+": 251926,
  "Neg7": 251437,
  "Neg8": 251702,
  "Nexc3": 253146,
  "Nexc4": 250150,
  "Nexc5": 250212,
  "Nexc6": 253286,
  "Nexc7+": 253333,
  "Nexd2": 251690,
  "Nexd4": 252367,
  "Nexd5": 251514,
  "Nexd6": 252750,
  "Nexd6+": 252253,
  "Nexd7": 253569,
  "Nexf2": 253392,
  "Nexf3": 251509,
  "Nexf3+": 252936,
  "Nexf4": 252996,
  "Nexf5": 253399,
  "Nexf6+": 253287,
  "Nexf7": 252340,
  "Nexg3": 252244,
  "Nexg4": 252347,
  "Nexg5": 252669,
  "Nf1": 250982,
  "Nf1+": 251829,
  "Nf1d2": 252465,
  "Nf1h2": 250964,
  "Nf2": 251918,
  "Nf2#": 250585,
  "Nf2+": 251446,
  "Nf3": 251706,
  "Nf3#": 251518,
  "Nf3+": 250760,
  "Nf3d2": 250966,
  "Nf3d4": 253080,
  "Nf3e5": 250781,
  "Nf3g5+": 252897,
  "Nf3h2": 252769,
  "Nf3h4": 252699,
  "Nf3xd4": 252223,
  "Nf3xg5": 250463,
  "Nf4": 252261,
  "Nf4#": 251375,
  "Nf4+": 252850,
  "Nf5": 253624,
  "Nf5#": 251455,
  "Nf5+": 252640,
  "Nf5xh4": 251827,
  "Nf6": 251824,
  "Nf6#": 251380,
  "Nf6+": 250903,
  "Nf6d5": 252711,
  "Nf6d7": 252087,
  "Nf6g4": 253699,
  "Nf6h5": 252773,
  "Nf7": 250751,
  "Nf7#": 252788,
  "Nf7+": 251816,
  "Nf7d6": 252096,
  "Nf7h6": 251823,
  "Nf8": 253278,
  "Nf8+": 252667,
  "Nf8d7": 251693,
  "Nf8e6": 251078,
  "Nf8h7": 252458,
  "Nfd2": 253064,
  "Nfd3": 252009,
  "Nfd3+": 250501,
  "Nfd4": 253637,
  "Nfd4+": 252115,
  "Nfd5": 250374,
  "Nfd6": 252770,
  "Nfd6+": 252195,
  "Nfd7": 252017,
  "Nfd8": 253550,
  "Nfe1": 250239,
  "Nfe2": 253223,
  "Nfe3": 253483,
  "Nfe3+": 253435,
  "Nfe4": 250215,
  "Nfe5": 253627,
  "Nfe5+": 251601,
  "Nfe6": 252653,
  "Nfe7": 250291,
  "Nfe7+": 252152,
  "Nfe8": 253056,
  "Nfg1": 252779,
  "Nfg3": 251110,
  "Nfg4": 252665,
  "Nfg4+": 253577,
  "Nfg5": 252282,
  "Nfg5+": 251949,
  "Nfg6": 252013,
  "Nfg8": 250672,
  "Nfh2": 253575,
  "Nfh4": 253221,
  "Nfh5": 251185,
  "Nfxd2": 251470,
  "Nfxd3+": 252734,
  "Nfxd4": 251594,
  "Nfxd5": 252494,
  "Nfxd7": 252833,
  "Nfxe1": 251114,
  "Nfxe2": 251803,
  "Nfxe4": 252915,
  "Nfxe5": 251096,
  "Nfxe5+": 251559,
  "Nfxe6": 252210,
  "Nfxe7": 253442,
  "Nfxg4": 252914,
  "Nfxg5": 252353,
  "Ng1": 251613,
  "Ng1+": 250857,
  "Ng1e2": 250495,
  "Ng1f3": 253631,
  "Ng2": 253497,
  "Ng2#": 250888,
  "Ng2+": 250487,
  "Ng3": 251532,
  "Ng3#": 252477,
  "Ng3+": 252179,
  "Ng3e4": 252985,
  "Ng3xe4+": 252293,
  "Ng4": 253092,
  "Ng4#": 253425,
  "Ng4+": 253085,
  "Ng5": 250318,
  "Ng5#": 252385,
  "Ng5+": 251703,
  "Ng5e4": 251445,
  "Ng5f3": 253673,
  "Ng6": 250270,
  "Ng6#": 252470,
  "Ng6+": 253272,
  "Ng6e7": 250682,
  "Ng7": 252589,
  "Ng7#": 250521,
  "Ng7+": 252467,
  "Ng8": 251342,
  "Ng8#": 251932,
  "Ng8+": 250169,
  "Ng8e7": 253347,
  "Ng8f6": 253380,
  "Ng8h6": 251075,
  "Ng8xe7": 251208,
  "Nge2": 251725,
  "Nge3": 252031,
  "Nge3+": 252435,
  "Nge4": 250280,
  "Nge4+": 253431,
  "Nge5": 251273,
  "Nge5+": 253625,
  "Nge6": 252561,
  "Nge6+": 252533,
  "Nge7": 250232,
  "Nge8": 253093,
  "Ngf1": 252185,
  "Ngf2+": 253162,
  "Ngf3": 253118,
  "Ngf4+": 251887,
  "Ngf5": 250702,
  "Ngf5+": 253267,
  "Ngf6": 252451,
  "Ngf6+": 250681,
  "Ngf7+": 251972,
  "Ngf8": 253509,
  "Ngh2": 252100,
  "Ngh5": 250948,
  "Ngh6": 251880,
  "Ngh7": 250892,
  "Ngxe2": 251308,
  "Ngxe3": 251749,
  "Ngxe3+": 250059,
  "Ngxe4": 252048,
  "Ngxe5": 250522,
  "Ngxe6": 252348,
  "Ngxe7": 252058,
  "Ngxf2": 251612,
  "Ngxf2+": 253053,
  "Ngxf3": 253167,
  "Ngxf5": 251014,
  "Ngxf6": 250957,
  "Ngxf7": 251261,
  "Ngxh6+": 253125,
  "Ngxh7": 251453,
  "Nh1": 250800,
  "Nh2": 253277,
  "Nh2+": 252877,
  "Nh2f3+": 250825,
  "Nh3": 253488,
  "Nh3#": 250859,
  "Nh3+": 251766,
  "Nh4": 252359,
  "Nh4#": 250231,
  "Nh4+": 252364,
  "Nh5": 252354,
  "Nh5+": 252978,
  "Nh6": 252620,
  "Nh6#": 250610,
  "Nh6+": 250262,
  "Nh7": 253534,
  "Nh7+": 250766,
  "Nh7f6": 252111,
  "Nh8": 252154,
  "Nh8+": 251940,
  "Nh8f7": 251388,
  "Nhf1": 252035,
  "Nhf2": 251337,
  "Nhf3": 252322,
  "Nhf4": 253033,
  "Nhf5": 251614,
  "Nhf6": 251513,
  "Nhf7": 250065,
  "Nhf8": 252911,
  "Nhg1": 252106,
  "Nhg3": 252356,
  "Nhg5": 250875,
  "Nhg6": 253288,
  "Nhg8": 252064,
  "Nhxf5": 250808,
  "Nhxf6": 253451,
  "Nhxf6+": 250958,
  "Nhxg5": 251744,
  "Nhxg6": 252508,
  "Nxa1": 250926,
  "Nxa1+": 251992,
  "Nxa2": 252003,
  "Nxa2+": 251508,
  "Nxa3": 253433,
  "Nxa3+": 252919,
  "Nxa4": 252291,
  "Nxa5": 252345,
  "Nxa5+": 252715,
  "Nxa6": 252775,
  "Nxa7": 252298,
  "Nxa7#": 250651,
  "Nxa7+": 252558,
  "Nxa8": 252983,
  "Nxa8+": 250313,
  "Nxb1": 250210,
  "Nxb2": 253362,
  "Nxb2+": 252570,
  "Nxb3": 251248,
  "Nxb3+": 251091,
  "Nxb4": 252312,
  "Nxb4+": 250568,
  "Nxb5": 250699,
  "Nxb5+": 253610,
  "Nxb6": 251593,
  "Nxb6#": 250080,
  "Nxb6+": 251861,
  "Nxb7": 250195,
  "Nxb7+": 251575,
  "Nxb8": 250611,
  "Nxc1": 250376,
  "Nxc1+": 250413,
  "Nxc2": 251291,
  "Nxc2+": 250998,
  "Nxc3": 251506,
  "Nxc3+": 250873,
  "Nxc4": 252504,
  "Nxc4+": 251037,
  "Nxc5": 253405,
  "Nxc5+": 252519,
  "Nxc6": 251281,
  "Nxc6#": 251845,
  "Nxc6+": 251256,
  "Nxc7": 250149,
  "Nxc7#": 251743,
  "Nxc7+": 250738,
  "Nxc8": 250550,
  "Nxc8+": 250714,
  "Nxd1": 251924,
  "Nxd1+": 252927,
  "Nxd2": 251777,
  "Nxd2+": 250382,
  "Nxd3": 250274,
  "Nxd3+": 252866,
  "Nxd4": 252952,
  "Nxd4#": 251180,
  "Nxd4+": 252137,
  "Nxd5": 252880,
  "Nxd5+": 252808,
  "Nxd6": 251196,
  "Nxd6#": 253579,
  "Nxd6+": 253321,
  "Nxd7": 252822,
  "Nxd7+": 252887,
  "Nxd8": 252116,
  "Nxd8+": 253058,
  "Nxe1": 250158,
  "Nxe1+": 251435,
  "Nxe2": 253663,
  "Nxe2#": 250778,
  "Nxe2+": 251361,
  "Nxe3": 251771,
  "Nxe3+": 253599,
  "Nxe4": 250579,
  "Nxe4#": 250057,
  "Nxe4+": 250628,
  "Nxe5": 251785,
  "Nxe5+": 252517,
  "Nxe6": 250124,
  "Nxe6+": 250228,
  "Nxe7": 253649,
  "Nxe7#": 252679,
  "Nxe7+": 252652,
  "Nxe8": 251519,
  "Nxe8+": 252913,
  "Nxf1": 251901,
  "Nxf1+": 252357,
  "Nxf2": 253658,
  "Nxf2#": 252218,
  "Nxf2+": 252695,
  "Nxf3": 250126,
  "Nxf3+": 252691,
  "Nxf4": 252868,
  "Nxf4+": 252926,
  "Nxf5": 250939,
  "Nxf5+": 250545,
  "Nxf6": 250476,
  "Nxf6#": 250663,
  "Nxf6+": 253628,
  "Nxf7": 253468,
  "Nxf7#": 251336,
  "Nxf7+": 251143,
  "Nxf8": 250706,
  "Nxf8+": 252827,
  "Nxg1": 250650,
  "Nxg1+": 251051,
  "Nxg2": 250793,
  "Nxg2+": 251040,
  "Nxg3": 250703,
  "Nxg3+": 250157,
  "Nxg4": 250427,
  "Nxg4+": 251259,
  "Nxg5": 251382,
  "Nxg5+": 253028,
  "Nxg6": 251451,
  "Nxg6#": 251001,
  "Nxg6+": 253506,
  "Nxg7": 250816,
  "Nxg7#": 252581,
  "Nxg7+": 250226,
  "Nxg8": 253269,
  "Nxg8+": 253115,
  "Nxh1": 252422,
  "Nxh1#": 250504,
  "Nxh1+": 253635,
  "Nxh2": 252825,
  "Nxh2+": 253190,
  "Nxh3": 250606,
  "Nxh3+": 251320,
  "Nxh4": 251406,
  "Nxh4+": 252733,
  "Nxh5": 250796,
  "Nxh5+": 253185,
  "Nxh6": 253394,
  "Nxh6+": 250203,
  "Nxh7": 252012,
  "Nxh7+": 252389,
  "Nxh8": 250337,
  "Nxh8#": 251057,
  "Nxh8+": 252925,
  "O-O": 250775,
  "O-O+": 252086,
  "O-O-O": 252991,
  "O-O-O+": 250444,
  "Qa1": 252472,
  "Qa1#": 251581,
  "Qa1+": 250877,
  "Qa2": 252837,
  "Qa2+": 251595,
  "Qa3": 252673,
  "Qa3+": 252372,
  "Qa4": 250483,
  "Qa4#": 251373,
  "Qa4+": 253459,
  "Qa5": 250960,
  "Qa5#": 251775,
  "Qa5+": 252831,
  "Qa5c7": 252500,
  "Qa6": 250797,
  "Qa6#": 252536,
  "Qa6+": 251997,
  "Qa7": 252688,
  "Qa7#": 251284,
  "Qa7+": 250790,
  "Qa8": 252158,
  "Qa8#": 250551,
  "Qa8+": 252138,
  "Qaa6": 251912,
  "Qac4": 252803,
  "Qaf8": 251630,
  "Qaxb7": 250328,
  "Qaxb7+": 252617,
  "Qb1": 252394,
  "Qb1#": 253303,
  "Qb1+": 250608,
  "Qb1b3": 250499,
  "Qb1b6": 250942,
  "Qb2": 250696,
  "Qb2#": 251139,
  "Qb2+": 251402,
  "Qb2xb1": 252447,
  "Qb3": 250565,
  "Qb3#": 250629,
  "Qb3+": 250701,
  "Qb3xb2": 252028,
  "Qb4": 252945,
  "Qb4#": 251710,
  "Qb4+": 250320,
  "Qb5": 253412,
  "Qb5#": 252592,
  "Qb5+": 252874,
  "Qb5a4": 250918,
  "Qb6": 253212,
  "Qb6#": 250445,
  "Qb6+": 250930,
  "Qb7": 251528,
  "Qb7#": 252441,
  "Qb7+": 253263,
  "Qb8": 251347,
  "Qb8#": 253332,
  "Qb8+": 253045,
  "Qba5": 251171,
  "Qbb2+": 252722,
  "Qbd8": 250304,
  "Qbxb3": 252008,
  "Qbxd5": 253426,
  "Qc1": 250299,
  "Qc1#": 253246,
  "Qc1+": 253052,
  "Qc2": 251225,
  "Qc2#": 251321,
  "Qc2+": 250278,
  "Qc3": 253183,
  "Qc3#": 250425,
  "Qc3+": 250456,
  "Qc4": 251959,
  "Qc4+": 252429,
  "Qc4a6#": 252204,
  "Qc4xd5": 252748,
  "Qc5": 250767,
  "Qc5#": 251667,
  "Qc5+": 250430,
  "Qc6": 251125,
  "Qc6#": 251444,
  "Qc6+": 250288,
  "Qc7": 253634,
  "Qc7#": 250257,
  "Qc7+": 253493,
  "Qc8": 251034,
  "Qc8#": 251971,
  "Qc8+": 252399,
  "Qcb7+": 250183,
  "Qcc6": 251020,
  "Qcc8": 252854,
  "Qce4": 251408,
  "Qcf5+": 253230,
  "Qcg2+": 250491,
  "Qch3": 250902,
  "Qcxb6": 253062,
  "Qcxd5": 253574,
  "Qcxf4": 252604,
  "Qd1": 251651,
  "Qd1#": 253111,
  "Qd1+": 250644,
  "Qd2": 252085,
  "Qd2#": 252525,
  "Qd2+": 250199,
  "Qd3": 250147,
  "Qd3#": 252766,
  "Qd3+": 253057,
  "Qd4": 252239,
  "Qd4#": 250784,
  "Qd4+": 252963,
  "Qd5": 250204,
  "Qd5#": 250890,
  "Qd5+": 250542,
  "Qd6": 251649,
  "Qd6#": 253644,
  "Qd6+": 253042,
  "Qd7": 251763,
  "Qd7#": 253681,
  "Qd7+": 253429,
  "Qd8": 251186,
  "Qd8#": 253112,
  "Qd8+": 251202,
  "Qd8c7": 251398,
  "Qda5": 250774,
  "Qdb1+": 250945,
  "Qdb8": 250405,
  "Qdc4+": 250669,
  "Qdd8": 252870,
  "Qde7": 253106,
  "Qde8": 253175,
  "Qdf2#": 251978,
  "Qdf6": 250727,
  "Qdg5": 250091,
  "Qdh4": 251310,
  "Qdxb4": 251043,
  "Qe1": 253341,
  "Qe1#": 251044,
  "Qe1+": 251265,
  "Qe2": 251433,
  "Qe2#": 252022,
  "Qe2+": 250840,
  "Qe3": 251068,
  "Qe3#": 250726,
  "Qe3+": 251045,
  "Qe4": 250477,
  "Qe4#": 252599,
  "Qe4+": 252700,
  "Qe4xd5": 252937,
  "Qe5": 251565,
  "Qe5#": 253340,
  "Qe5+": 252672,
  "Qe6": 251938,
  "Qe6#": 250795,
  "Qe6+": 250141,
  "Qe7": 253237,
  "Qe7#": 250742,
  "Qe7+": 250202,
  "Qe8": 253436,
  "Qe8#": 252194,
  "Qe8+": 252004,
  "Qea3+": 250163,
  "Qeb3": 250377,
  "Qeb4": 253633,
  "Qeb6": 252932,
  "Qed2": 250246,
  "Qee1": 250988,
  "Qee3+": 253003,
  "Qeg1": 253300,
  "Qeh4": 252143,
  "Qexb5#": 251780,
  "Qexd5": 250243,
  "Qf1": 251207,
  "Qf1#": 253376,
  "Qf1+": 250684,
  "Qf2": 250435,
  "Qf2#": 251449,
  "Qf2+": 251526,
  "Qf3": 251033,
  "Qf3#": 252838,
  "Qf3+": 250219,
  "Qf4": 253304,
  "Qf4#": 253495,
  "Qf4+": 252193,
  "Qf5": 250905,
  "Qf5#": 252611,
  "Qf5+": 250728,
  "Qf6": 252730,
  "Qf6#": 250421,
  "Qf6+": 252146,
  "Qf7": 252313,
  "Qf7#": 253413,
  "Qf7+": 252738,
  "Qf8": 251339,
  "Qf8#": 253530,
  "Qf8+": 250368,
  "Qfa6": 251405,
  "Qfb4": 250973,
  "Qfc8+": 252070,
  "Qfd3#": 252682,
  "Qfd4+": 251459,
  "Qfd5": 250690,
  "Qfe6": 253696,
  "Qff1": 251604,
  "Qff3": 251055,
  "Qfg2": 251555,
  "Qfxb6+": 250128,
  "Qfxd5": 250718,
  "Qfxg3": 253454,
  "Qg1": 252804,
  "Qg1#": 252150,
  "Qg1+": 251121,
  "Qg2": 253603,
  "Qg2#": 250424,
  "Qg2+": 253385,
  "Qg3": 250965,
  "Qg3#": 252391,
  "Qg3+": 252439,
  "Qg3g8+": 253027,
  "Qg4": 251146,
  "Qg4#": 253589,
  "Qg4+": 252603,
  "Qg5": 252421,
  "Qg5#": 252727,
  "Qg5+": 251768,
  "Qg6": 252608,
  "Qg6#": 251352,
  "Qg6+": 250749,
  "Qg7": 253402,
  "Qg7#": 251931,
  "Qg7+": 250111,
  "Qg8": 252346,
  "Qg8#": 251338,
  "Qg8+": 252199,
  "Qg8g3": 251879,
  "Qg8xd5+": 250646,
  "Qgb5": 253409,
  "Qgd6": 251006,
  "Qgd8+": 251367,
  "Qgf6": 251149,
  "Qgg4#": 250220,
  "Qgh4": 251678,
  "Qgxe6+": 251868,
  "Qh1": 253282,
  "Qh1#": 252163,
  "Qh1+": 252103,
  "Qh2": 252248,
  "Qh2#": 251893,
  "Qh2+": 250409,
  "Qh3": 250123,
  "Qh3#": 250598,
  "Qh3+": 251676,
  "Qh4": 250245,
  "Qh4#": 250180,
  "Qh4+": 251753,
  "Qh4f2": 250927,
  "Qh5": 251616,
  "Qh5#": 250253,
  "Qh5+": 253487,
  "Qh6": 252443,
  "Qh6#": 251937,
  "Qh6+": 251656,
  "Qh7": 251631,
  "Qh7#": 253222,
  "Qh7+": 252461,
  "Qh8": 250665,
  "Qh8#": 251896,
  "Qh8+": 250343,
  "Qhc1": 250832,
  "Qhe6": 252931,
  "Qhf5#": 250201,
  "Qhg7#": 252442,
  "Qhh3": 251134,
  "Qhh6": 250221,
  "Qhxg2": 250293,
  "Qhxg2+": 250746,
  "Qxa1": 251914,
  "Qxa1#": 253507,
  "Qxa1+": 251970,
  "Qxa2": 251475,
  "Qxa2#": 252216,
  "Qxa2+": 250235,
  "Qxa3": 251562,
  "Qxa3#": 253391,
  "Qxa3+": 253361,
  "Qxa4": 252460,
  "Qxa4+": 250512,
  "Qxa5": 252274,
  "Qxa5#": 251369,
  "Qxa5+": 251713,
  "Qxa6": 252001,
  "Qxa6#": 252174,
  "Qxa6+": 252690,
  "Qxa7": 253101,
  "Qxa7#": 250771,
  "Qxa7+": 251585,
  "Qxa8": 250390,
  "Qxa8#": 252686,
  "Qxa8+": 251902,
  "Qxb1": 250572,
  "Qxb1#": 250127,
  "Qxb1+": 253158,
  "Qxb2": 253641,
  "Qxb2#": 251090,
  "Qxb2+": 251465,
  "Qxb3": 253690,
  "Qxb3+": 251843,
  "Qxb4": 251898,
  "Qxb4#": 250530,
  "Qxb4+": 253280,
  "Qxb5": 250188,
  "Qxb5#": 250759,
  "Qxb5+": 252549,
  "Qxb6": 250159,
  "Qxb6+": 250486,
  "Qxb7": 250252,
  "Qxb7+": 252473,
  "Qxb8": 250216,
  "Qxb8#": 250600,
  "Qxb8+": 252056,
  "Qxc1": 252487,
  "Qxc1+": 251552,
  "Qxc2": 252338,
  "Qxc2#": 253689,
  "Qxc2+": 252501,
  "Qxc3": 253021,
  "Qxc3#": 252922,
  "Qxc3+": 252609,
  "Qxc4": 251280,
  "Qxc4+": 252685,
  "Qxc5": 252230,
  "Qxc5#": 250886,
  "Qxc5+": 253032,
  "Qxc6": 251416,
  "Qxc6#": 251895,
  "Qxc6+": 251933,
  "Qxc7": 251420,
  "Qxc7#": 253217,
  "Qxc7+": 253336,
  "Qxc8": 252256,
  "Qxc8#": 251857,
  "Qxc8+": 251058,
  "Qxd1": 250272,
  "Qxd1#": 253168,
  "Qxd1+": 251525,
  "Qxd2": 252767,
  "Qxd2#": 251761,
  "Qxd2+": 252093,
  "Qxd3": 252221,
  "Qxd3+": 251655,
  "Qxd4": 252136,
  "Qxd4#": 252639,
  "Qxd4+": 251234,
  "Qxd5": 252840,
  "Qxd5+": 251876,
  "Qxd6": 251692,
  "Qxd6#": 251432,
  "Qxd6+": 251081,
  "Qxd7": 253552,
  "Qxd7#": 251542,
  "Qxd7+": 251414,
  "Qxd8": 250083,
  "Qxd8#": 252796,
  "Qxd8+": 252335,
  "Qxe1": 251545,
  "Qxe1#": 252479,
  "Qxe1+": 250378,
  "Qxe2": 250353,
  "Qxe2#": 252328,
  "Qxe2+": 253619,
  "Qxe3": 250173,
  "Qxe3#": 250289,
  "Qxe3+": 253245,
  "Qxe4": 250110,
  "Qxe4#": 251592,
  "Qxe4+": 253154,
  "Qxe5": 253363,
  "Qxe5#": 250618,
  "Qxe5+": 252886,
  "Qxe6": 252705,
  "Qxe6+": 251474,
  "Qxe7": 251936,
  "Qxe7#": 252387,
  "Qxe7+": 250436,
  "Qxe8": 250140,
  "Qxe8#": 253462,
  "Qxe8+": 252437,
  "Qxf1": 253247,
  "Qxf1#": 251217,
  "Qxf1+": 251571,
  "Qxf2": 250194,
  "Qxf2#": 251277,
  "Qxf2+": 252395,
  "Qxf3": 252935,
  "Qxf3#": 250422,
  "Qxf3+": 253580,
  "Qxf4": 251130,
  "Qxf4#": 250249,
  "Qxf4+": 253139,
  "Qxf5": 251884,
  "Qxf5#": 252836,
  "Qxf5+": 250675,
  "Qxf6": 252478,
  "Qxf6#": 252398,
  "Qxf6+": 252400,
  "Qxf7": 252537,
  "Qxf7#": 252970,
  "Qxf7+": 251116,
  "Qxf8": 251166,
  "Qxf8#": 250896,
  "Qxf8+": 253490,
  "Qxg1": 251498,
  "Qxg1#": 253002,
  "Qxg1+": 251323,
  "Qxg2": 253018,
  "Qxg2#": 253517,
  "Qxg2+": 251296,
  "Qxg3": 251642,
  "Qxg3#": 253024,
  "Qxg3+": 250855,
  "Qxg4": 251421,
  "Qxg4#": 253526,
  "Qxg4+": 253439,
  "Qxg5": 251873,
  "Qxg5#": 253306,
  "Qxg5+": 251286,
  "Qxg6": 250294,
  "Qxg6#": 252507,
  "Qxg6+": 250380,
  "Qxg7": 251635,
  "Qxg7#": 253683,
  "Qxg7+": 251707,
  "Qxg8": 251813,
  "Qxg8#": 252634,
  "Qxg8+": 250638,
  "Qxh1": 251088,
  "Qxh1+": 250431,
  "Qxh2": 250674,
  "Qxh2#": 251104,
  "Qxh2+": 251944,
  "Qxh3": 250858,
  "Qxh3#": 252908,
  "Qxh3+": 253122,
  "Qxh4": 252586,
  "Qxh4+": 251061,
  "Qxh5": 251941,
  "Qxh5#": 250541,
  "Qxh5+": 251358,
  "Qxh6": 250208,
  "Qxh6#": 253356,
  "Qxh6+": 253098,
  "Qxh7": 252992,
  "Qxh7#": 252616,
  "Qxh7+": 252269,
  "Qxh8": 250197,
  "Qxh8+": 250594,
  "Ra1": 252884,
  "Ra1#": 253430,
  "Ra1+": 252759,
  "Ra1a2": 251851,
  "Ra2": 250527,
  "Ra2#": 250085,
  "Ra2+": 250559,
  "Ra2a1": 251740,
  "Ra2a1#": 252680,
  "Ra2a3": 251947,
  "Ra2a3+": 250932,
  "Ra2a5": 251715,
  "Ra2a7": 253515,
  "Ra2a7+": 250959,
  "Ra2a8": 252905,
  "Ra2xa3": 252401,
  "Ra2xa4": 252967,
  "Ra2xa5": 250987,
  "Ra2xa6": 251191,
  "Ra2xa8": 253562,
  "Ra3": 251035,
  "Ra3#": 252344,
  "Ra3+": 250923,
  "Ra3a2": 252315,
  "Ra3a2+": 253458,
  "Ra3xa2": 253698,
  "Ra3xa2+": 253150,
  "Ra3xa4": 253535,
  "Ra3xa5": 253414,
  "Ra3xa6": 253596,
  "Ra3xa7": 252134,
  "Ra4": 253558,
  "Ra4#": 252463,
  "Ra4+": 251607,
  "Ra4a3": 250768,
  "Ra4a6": 251850,
  "Ra4a8": 252139,
  "Ra4xa2": 252320,
  "Ra4xa5": 251977,
  "Ra5": 251060,
  "Ra5+": 252030,
  "Ra5a2": 252288,
  "Ra5a6": 250233,
  "Ra5a8": 252509,
  "Ra5xa1": 252314,
  "Ra5xa2": 252427,
  "Ra5xa2+": 252785,
  "Ra5xa3": 253110,
  "Ra5xa4": 250336,
  "Ra5xa6+": 250617,
  "Ra6": 252455,
  "Ra6#": 252088,
  "Ra6+": 252263,
  "Ra6a2": 251340,
  "Ra6a3+": 251376,
  "Ra6a7": 250820,
  "Ra6a8": 251054,
  "Ra6xa1": 252457,
  "Ra6xa3": 251836,
  "Ra6xa5": 251767,
  "Ra7": 250102,
  "Ra7#": 250367,
  "Ra7+": 252182,
  "Ra7a4": 253657,
  "Ra7a8": 250544,
  "Ra7xa5": 250453,
  "Ra8": 250673,
  "Ra8#": 252744,
  "Ra8+": 253645,
  "Ra8a2": 252520,
  "Ra8a3": 251070,
  "Ra8a3#": 250587,
  "Ra8a5": 253359,
  "Ra8a6": 250121,
  "Ra8a7": 253121,
  "Raa1": 251463,
  "Raa2": 251582,
  "Raa3": 253326,
  "Raa5": 251290,
  "Raa6": 252280,
  "Raa7": 250172,
  "Raa8": 251838,
  "Rab1": 251711,
  "Rab1+": 250602,
  "Rab2": 252949,
  "Rab3": 252408,
  "Rab5": 250097,
  "Rab6": 252169,
  "Rab7": 251802,
  "Rab8": 252812,
  "Rab8+": 252867,
  "Rac1": 251984,
  "Rac1+": 250659,
  "Rac2": 253563,
  "Rac4": 250884,
  "Rac6": 250218,
  "Rac7": 252530,
  "Rac7#": 251452,
  "Rac8": 253213,
  "Rac8+": 252227,
  "Rad1": 251551,
  "Rad1+": 253268,
  "Rad2": 252187,
  "Rad3": 252229,
  "Rad7": 250490,
  "Rad8": 253593,
  "Rad8+": 251606,
  "Rae1": 253375,
  "Rae1+": 252894,
  "Rae2+": 252960,
  "Rae3": 250332,
  "Rae7": 252524,
  "Rae8": 253224,
  "Rae8+": 253071,
  "Raf1": 250268,
  "Raf1+": 252739,
  "Raf2": 252114,
  "Raf3": 251696,
  "Raf4": 253682,
  "Raf7": 250345,
  "Raf8": 253187,
  "Rag1": 251958,
  "Rag3+": 252540,
  "Rag5": 252177,
  "Rag8": 251826,
  "Rag8+": 251894,
  "Rah1": 252923,
  "Rah2": 250260,
  "Rah6": 251640,
  "Rah8": 252902,
  "Raxa4": 252661,
  "Raxa6": 253542,
  "Raxa7": 250515,
  "Raxb1": 252430,
  "Raxb6": 250662,
  "Raxb8": 250641,
  "Raxc1": 250266,
  "Raxc2": 250181,
  "Raxc8": 252231,
  "Raxd1": 252544,
  "Raxd2": 251107,
  "Raxd8": 251236,
  "Raxe1": 252243,
  "Raxe2": 250978,
  "Raxe3": 252079,
  "Raxe5": 252101,
  "Raxe7": 252741,
  "Raxe8": 251855,
  "Raxf5": 250450,
  "Raxf8": 251903,
  "Rb1": 253166,
  "Rb1#": 252613,
  "Rb1+": 250174,
  "Rb1b2": 251789,
  "Rb1b3": 251962,
  "Rb1b4": 252994,
  "Rb1b6": 252113,
  "Rb1b7": 252860,
  "Rb1b7+": 250657,
  "Rb1xb5": 252094,
  "Rb2": 252571,
  "Rb2+": 250107,
  "Rb2b1": 253424,
  "Rb2b1+": 253370,
  "Rb2b3": 251391,
  "Rb2b5": 250970,
  "Rb2b8+": 251177,
  "Rb2xb1+": 253519,
  "Rb2xb3": 252378,
  "Rb2xb5": 252910,
  "Rb2xb6": 250717,
  "Rb2xb7": 253103,
  "Rb3": 251770,
  "Rb3+": 250583,
  "Rb3b1": 250119,
  "Rb3b2": 251799,
  "Rb3b2+": 251812,
  "Rb3b4": 252899,
  "Rb3b5": 252010,
  "Rb3b7": 252791,
  "Rb3xb2": 252514,
  "Rb3xb2+": 250394,
  "Rb3xb6": 251793,
  "Rb3xb8": 250170,
  "Rb4": 252621,
  "Rb4#": 252423,
  "Rb4+": 251890,
  "Rb4b1": 252787,
  "Rb4b3": 250130,
  "Rb4b5": 252704,
  "Rb4b8": 250198,
  "Rb4xb2+": 251278,
  "Rb4xb3": 250307,
  "Rb4xb6": 253605,
  "Rb4xb7": 250633,
  "Rb5": 251077,
  "Rb5+": 252862,
  "Rb5b3": 252072,
  "Rb5b7": 250381,
  "Rb5xb2": 252806,
  "Rb5xb3+": 251501,
  "Rb5xb6": 250327,
  "Rb6": 250461,
  "Rb6+": 250177,
  "Rb6b4": 253034,
  "Rb6b5+": 250161,
  "Rb6b7": 252440,
  "Rb6b7+": 250379,
  "Rb6xb3": 251105,
  "Rb6xb5": 251148,
  "Rb6xb7": 251625,
  "Rb7": 251031,
  "Rb7+": 253674,
  "Rb7b1": 252120,
  "Rb7b2": 252330,
  "Rb7b3": 251757,
  "Rb7b4": 250660,
  "Rb7b5": 252651,
  "Rb7b6": 252912,
  "Rb7b8": 253434,
  "Rb7b8+": 250133,
  "Rb7xb2": 250058,
  "Rb7xb2+": 252692,
  "Rb8": 253226,
  "Rb8#": 252631,
  "Rb8+": 253127,
  "Rb8b2+": 250386,
  "Rb8b3": 251197,
  "Rb8b4": 250604,
  "Rb8b4+": 252148,
  "Rb8b7": 251786,
  "Rb8xb4": 252642,
  "Rb8xb6": 251404,
  "Rba1": 250295,
  "Rba2": 251232,
  "Rba3": 250468,
  "Rba4": 250118,
  "Rba6": 251756,
  "Rba7": 250730,
  "Rba8": 251473,
  "Rba8+": 252471,
  "Rbb1": 250153,
  "Rbb2": 251985,
  "Rbb3": 253445,
  "Rbb4": 251249,
  "Rbb5": 250273,
  "Rbb6": 252449,
  "Rbb7": 252305,
  "Rbb8": 250925,
  "Rbc1": 253097,
  "Rbc1+": 251374,
  "Rbc2": 250066,
  "Rbc3": 252388,
  "Rbc3+": 253594,
  "Rbc4": 251534,
  "Rbc5": 253651,
  "Rbc6": 250480,
  "Rbc7": 251082,
  "Rbc7+": 251560,
  "Rbc8": 252061,
  "Rbd1": 253476,
  "Rbd2": 253659,
  "Rbd3": 250492,
  "Rbd3+": 253081,
  "Rbd4": 251102,
  "Rbd5": 251839,
  "Rbd6": 252289,
  "Rbd7": 250645,
  "Rbd8": 252678,
  "Rbd8+": 252498,
  "Rbe1": 253088,
  "Rbe2": 251672,
  "Rbe3": 253338,
  "Rbe5": 251574,
  "Rbe8": 253559,
  "Rbf1": 251957,
  "Rbf2": 253135,
  "Rbf4": 251694,
  "Rbf4+": 253549,
  "Rbf8": 252567,
  "Rbg1": 251798,
  "Rbg2+": 250648,
  "Rbg6": 250509,
  "Rbg7+": 250429,
  "Rbg8": 252260,
  "Rbh1": 251381,
  "Rbh8": 250997,
  "Rbxa6": 251227,
  "Rbxa7": 250303,
  "Rbxa7+": 252466,
  "Rbxb2+": 250076,
  "Rbxb3": 251324,
  "Rbxb3+": 250954,
  "Rbxb4": 250639,
  "Rbxb5": 251215,
  "Rbxb7": 251862,
  "Rbxc1": 252290,
  "Rbxc2": 250241,
  "Rbxc4": 250479,
  "Rbxc5": 251413,
  "Rbxc8": 250850,
  "Rbxd1": 252855,
  "Rbxd5": 251027,
  "Rbxd5+": 253264,
  "Rbxf7+": 253415,
  "Rbxh1": 252774,
  "Rc1": 252997,
  "Rc1#": 252296,
  "Rc1+": 250846,
  "Rc1c2": 253568,
  "Rc1c2+": 252073,
  "Rc1c6": 253067,
  "Rc1c7": 251041,
  "Rc1xc5": 250437,
  "Rc2": 250523,
  "Rc2+": 250647,
  "Rc2c1+": 250354,
  "Rc2c3": 252151,
  "Rc2c4": 250697,
  "Rc2c6": 251195,
  "Rc2c7": 251189,
  "Rc2c7+": 252142,
  "Rc2c8": 250575,
  "Rc2xc4": 253339,
  "Rc2xc5": 253516,
  "Rc2xc6": 253597,
  "Rc2xc6+": 251048,
  "Rc2xc7": 251504,
  "Rc2xc8": 250721,
  "Rc2xc8+": 253457,
  "Rc3": 252241,
  "Rc3+": 253482,
  "Rc3c1+": 252578,
  "Rc3c2": 253038,
  "Rc3c4+": 250999,
  "Rc3c5": 253521,
  "Rc3c6": 252168,
  "Rc3c7": 252971,
  "Rc3c8": 250455,
  "Rc3xc2": 251547,
  "Rc3xc4": 250533,
  "Rc3xc5": 252638,
  "Rc3xc6": 252889,
  "Rc3xc7": 253616,
  "Rc4": 252909,
  "Rc4#": 251718,
  "Rc4+": 250695,
  "Rc4c1+": 252432,
  "Rc4c2": 253665,
  "Rc4c3+": 251085,
  "Rc4c5": 252071,
  "Rc4c6": 251523,
  "Rc4c7": 253281,
  "Rc4xc1+": 250063,
  "Rc4xc3": 250432,
  "Rc4xc7": 251988,
  "Rc5": 251712,
  "Rc5+": 250525,
  "Rc5c2": 253194,
  "Rc5c4": 253478,
  "Rc5c7": 253218,
  "Rc5c7+": 253079,
  "Rc5xc2": 252702,
  "Rc5xc3": 251294,
  "Rc5xc4": 251425,
  "Rc5xc8": 253573,
  "Rc5xc8+": 250418,
  "Rc6": 251764,
  "Rc6+": 250989,
  "Rc6c1": 251460,
  "Rc6c1+": 253302,
  "Rc6c2+": 253159,
  "Rc6c3": 250947,
  "Rc6c4": 253474,
  "Rc6c5": 253692,
  "Rc6c7": 252002,
  "Rc6c8": 252799,
  "Rc6c8+": 250755,
  "Rc6xc3": 253396,
  "Rc6xc7": 253504,
  "Rc6xc7+": 251590,
  "Rc6xc8": 250341,
  "Rc7": 251800,
  "Rc7+": 252689,
  "Rc7c1+": 252373,
  "Rc7c2": 253661,
  "Rc7c3": 253054,
  "Rc7c4": 253561,
  "Rc7c5": 250698,
  "Rc7c6": 253630,
  "Rc7c8": 250922,
  "Rc7c8+": 252444,
  "Rc7xc2": 253010,
  "Rc7xc2+": 250193,
  "Rc7xc3": 251842,
  "Rc7xc4": 252760,
  "Rc7xc5": 251489,
  "Rc7xc8": 252503,
  "Rc8": 250864,
  "Rc8#": 253008,
  "Rc8+": 251964,
  "Rc8c2": 252324,
  "Rc8c3": 251223,
  "Rc8c3+": 251095,
  "Rc8c4": 251467,
  "Rc8c5": 253265,
  "Rc8c6": 251796,
  "Rc8c7": 251017,
  "Rc8xc2": 250384,
  "Rc8xc7": 253172,
  "Rca1": 253276,
  "Rca2": 250783,
  "Rca3": 250609,
  "Rca4": 252492,
  "Rca5": 253397,
  "Rca5+": 250546,
  "Rca7": 252405,
  "Rca8": 250624,
  "Rca8+": 252588,
  "Rcb1": 250872,
  "Rcb1+": 252811,
  "Rcb2": 250992,
  "Rcb2+": 250686,
  "Rcb3": 250410,
  "Rcb3+": 252418,
  "Rcb4": 250916,
  "Rcb7": 250211,
  "Rcb7+": 252332,
  "Rcb8": 252900,
  "Rcc1": 250752,
  "Rcc2": 250178,
  "Rcc3": 253411,
  "Rcc4": 253015,
  "Rcc5": 250404,
  "Rcc6": 250399,
  "Rcc7": 251087,
  "Rcc8": 252820,
  "Rcd1": 251245,
  "Rcd1+": 253480,
  "Rcd2": 252118,
  "Rcd2+": 253299,
  "Rcd3": 251301,
  "Rcd3+": 252491,
  "Rcd5": 251084,
  "Rcd6": 253345,
  "Rcd7": 250869,
  "Rcd8": 251178,
  "Rcd8+": 251211,
  "Rce1": 253446,
  "Rce1+": 251158,
  "Rce2": 253449,
  "Rce4": 252374,
  "Rce5": 251611,
  "Rce6": 250919,
  "Rce7": 250962,
  "Rce7+": 253035,
  "Rce8": 253161,
  "Rce8+": 251163,
  "Rcf1": 253587,
  "Rcf2": 253298,
  "Rcf3": 253364,
  "Rcf6": 250791,
  "Rcf7": 251527,
  "Rcf8": 252746,
  "Rcg1": 251039,
  "Rcg2": 251169,
  "Rcg2+": 250145,
  "Rcg7+": 250812,
  "Rcg8": 252907,
  "Rch1": 252453,
  "Rch8": 250626,
  "Rcxa1": 252155,
  "Rcxa3": 251483,
  "Rcxa7": 253438,
  "Rcxb3": 253046,
  "Rcxb5": 253524,
  "Rcxb5+": 252861,
  "Rcxb6": 251922,
  "Rcxb7": 251633,
  "Rcxc2": 250508,
  "Rcxc3": 251458,
  "Rcxc3+": 252205,
  "Rcxc6": 250516,
  "Rcxc6+": 253512,
  "Rcxc7": 252988,
  "Rcxc7+": 253367,
  "Rcxd1": 251627,
  "Rcxd6": 252607,
  "Rcxd7+": 252776,
  "Rcxd8": 252276,
  "Rcxe2": 252564,
  "Rcxe5": 251830,
  "Rcxe6": 250175,
  "Rcxf2": 250113,
  "Rcxf3": 250338,
  "Rcxf4": 252397,
  "Rcxf6+": 252630,
  "Rcxf7": 253443,
  "Rcxf8": 252186,
  "Rcxg7+": 251346,
  "Rcxh2": 250513,
  "Rd1": 251441,
  "Rd1#": 252975,
  "Rd1+": 251103,
  "Rd1d2": 253614,
  "Rd1d3": 253461,
  "Rd1d3+": 250986,
  "Rd1d4": 253615,
  "Rd1d4#": 251808,
  "Rd1d5": 252370,
  "Rd1d6+": 253199,
  "Rd1d7": 252666,
  "Rd1d7#": 252574,
  "Rd1xd3": 253050,
  "Rd2": 253314,
  "Rd2+": 250882,
  "Rd2d1": 253014,
  "Rd2d1+": 250315,
  "Rd2d3": 251106,
  "Rd2d4": 250348,
  "Rd2d6": 251345,
  "Rd2d7+": 252489,
  "Rd2d8": 251832,
  "Rd2d8+": 253076,
  "Rd2xd1+": 250977,
  "Rd2xd3": 250536,
  "Rd2xd4": 253023,
  "Rd2xd5": 251660,
  "Rd2xd6": 253700,
  "Rd2xd7+": 251819,
  "Rd2xd8+": 253591,
  "Rd3": 253523,
  "Rd3#": 250443,
  "Rd3+": 251173,
  "Rd3d2": 251412,
  "Rd3d2+": 251708,
  "Rd3d4": 250805,
  "Rd3d5": 253309,
  "Rd3d6": 252176,
  "Rd3d7": 251370,
  "Rd3xd2": 253060,
  "Rd3xd2+": 252618,
  "Rd3xd4": 253703,
  "Rd3xd5": 253486,
  "Rd3xd7": 253275,
  "Rd3xd7+": 252098,
  "Rd3xd8": 251038,
  "Rd4": 251428,
  "Rd4#": 251969,
  "Rd4+": 252810,
  "Rd4d1": 253061,
  "Rd4d2": 253323,
  "Rd4d2#": 251919,
  "Rd4d3": 250740,
  "Rd4d5": 250282,
  "Rd4d5+": 250366,
  "Rd4d6": 251069,
  "Rd4d7+": 251047,
  "Rd4d8": 250582,
  "Rd4d8+": 252939,
  "Rd4xd1": 251251,
  "Rd4xd3": 252606,
  "Rd4xd5": 250862,
  "Rd4xd6": 251222,
  "Rd4xd6+": 252431,
  "Rd4xd8": 251807,
  "Rd4xd8+": 250347,
  "Rd5": 251968,
  "Rd5+": 253066,
  "Rd5d1": 253541,
  "Rd5d1+": 252933,
  "Rd5d2": 250068,
  "Rd5d3": 253151,
  "Rd5d4": 250297,
  "Rd5d6": 250120,
  "Rd5d6+": 251481,
  "Rd5d7": 251065,
  "Rd5d7+": 250537,
  "Rd5d8+": 250676,
  "Rd5xd2": 251289,
  "Rd5xd3": 253048,
  "Rd5xd4": 252482,
  "Rd5xd6": 253228,
  "Rd5xd7": 252721,
  "Rd5xd8": 253117,
  "Rd6": 250138,
  "Rd6+": 252856,
  "Rd6d1": 251654,
  "Rd6d2": 253496,
  "Rd6d4": 250531,
  "Rd6d5": 250142,
  "Rd6d7": 251002,
  "Rd6d7+": 252412,
  "Rd6d8": 251168,
  "Rd6d8+": 251439,
  "Rd6xd1": 252483,
  "Rd6xd3": 250261,
  "Rd6xd4": 251131,
  "Rd6xd5": 251791,
  "Rd6xd7+": 250844,
  "Rd6xd8+": 252351,
  "Rd7": 251736,
  "Rd7#": 253198,
  "Rd7+": 250818,
  "Rd7d2": 251097,
  "Rd7d2+": 251016,
  "Rd7d3": 253539,
  "Rd7d3+": 250301,
  "Rd7d4": 252649,
  "Rd7d4+": 250856,
  "Rd7d5": 250458,
  "Rd7d6": 251018,
  "Rd7d6+": 251641,
  "Rd7d8": 253511,
  "Rd7d8+": 250952,
  "Rd7xd1": 253618,
  "Rd7xd1+": 251950,
  "Rd7xd2": 250532,
  "Rd7xd3": 252161,
  "Rd7xd4": 251502,
  "Rd7xd5": 250209,
  "Rd7xd5+": 250688,
  "Rd7xd6": 251782,
  "Rd7xd8+": 252404,
  "Rd8": 252040,
  "Rd8#": 253031,
  "Rd8+": 253310,
  "Rd8d2+": 251674,
  "Rd8d3": 252452,
  "Rd8d4": 252628,
  "Rd8d5": 253646,
  "Rd8d6": 251300,
  "Rd8d6+": 252450,
  "Rd8d7": 250088,
  "Rd8xd4": 250151,
  "Rd8xd7": 252019,
  "Rda1": 250757,
  "Rda1+": 250131,
  "Rda2": 253040,
  "Rda3": 252321,
  "Rda6": 250069,
  "Rda8": 251910,
  "Rdb1": 251658,
  "Rdb2": 252122,
  "Rdb3": 252546,
  "Rdb7": 250317,
  "Rdb8": 250351,
  "Rdb8+": 252217,
  "Rdc1": 250564,
  "Rdc1+": 252677,
  "Rdc2": 253157,
  "Rdc2+": 251979,
  "Rdc3": 250613,
  "Rdc3+": 251524,
  "Rdc5": 252020,
  "Rdc6": 253142,
  "Rdc7": 250955,
  "Rdc7#": 250372,
  "Rdc8": 252930,
  "Rdd1": 251152,
  "Rdd2": 250881,
  "Rdd3": 250722,
  "Rdd4": 250981,
  "Rdd6": 252644,
  "Rdd7": 253152,
  "Rdd8": 251853,
  "Rde1": 253196,
  "Rde1+": 253598,
  "Rde2": 250086,
  "Rde3": 250222,
  "Rde4": 253270,
  "Rde6": 251231,
  "Rde7": 251980,
  "Rde7+": 252254,
  "Rde8": 251304,
  "Rdf1": 250711,
  "Rdf1+": 252191,
  "Rdf2": 251995,
  "Rdf2+": 251182,
  "Rdf3": 253346,
  "Rdf4": 251240,
  "Rdf5": 252545,
  "Rdf6": 252794,
  "Rdf7": 252208,
  "Rdf8": 253238,
  "Rdf8+": 251492,
  "Rdg1": 253704,
  "Rdg1+": 252878,
  "Rdg2": 250236,
  "Rdg2#": 251600,
  "Rdg7#": 252287,
  "Rdg8": 250061,
  "Rdg8+": 251586,
  "Rdh1": 252036,
  "Rdh2": 252751,
  "Rdh2#": 253377,
  "Rdh2+": 250090,
  "Rdh5": 251454,
  "Rdh7": 253165,
  "Rdh8": 250776,
  "Rdxa2": 251794,
  "Rdxa5": 251086,
  "Rdxa7+": 252462,
  "Rdxb8": 250750,
  "Rdxc1": 252235,
  "Rdxc2": 250136,
  "Rdxc3": 252600,
  "Rdxc5": 253595,
  "Rdxc5+": 250574,
  "Rdxc6": 251239,
  "Rdxc7": 253404,
  "Rdxc7+": 251160,
  "Rdxc8": 251026,
  "Rdxd1": 251424,
  "Rdxd3": 253565,
  "Rdxd5": 251967,
  "Rdxd6": 252270,
  "Rdxd7": 252376,
  "Rdxd7+": 251411,
  "Rdxe1": 251299,
  "Rdxe2": 251162,
  "Rdxe3": 252626,
  "Rdxe4": 251448,
  "Rdxe5": 251515,
  "Rdxe8": 252551,
  "Rdxf1": 251072,
  "Rdxf2": 253518,
  "Rdxf8+": 251831,
  "Rdxg2+": 253471,
  "Re1": 251181,
  "Re1#": 252232,
  "Re1+": 252075,
  "Re1e2": 251062,
  "Re1e3": 251774,
  "Re1e4": 251354,
  "Re1e4+": 251517,
  "Re1e5": 251728,
  "Re1e6": 250744,
  "Re1e6+": 252512,
  "Re1e7": 251907,
  "Re1e7+": 252573,
  "Re1xe3": 252958,
  "Re1xe4": 250398,
  "Re1xe6": 250653,
  "Re1xe6+": 251723,
  "Re2": 252934,
  "Re2#": 250614,
  "Re2+": 253357,
  "Re2e1": 253009,
  "Re2e1+": 251913,
  "Re2e3": 251230,
  "Re2e3+": 252307,
  "Re2e4": 253398,
  "Re2e5": 251076,
  "Re2e6": 251762,
  "Re2e7": 252277,
  "Re2e8+": 251908,
  "Re2xe1": 253086,
  "Re2xe1+": 250316,
  "Re2xe3": 251963,
  "Re2xe4": 250601,
  "Re2xe5": 252209,
  "Re2xe6": 251578,
  "Re2xe6+": 253233,
  "Re2xe8": 251295,
  "Re2xe8+": 252598,
  "Re3": 253138,
  "Re3+": 252078,
  "Re3e1": 253381,
  "Re3e1+": 250627,
  "Re3e2": 250402,
  "Re3e4": 252157,
  "Re3e6": 253344,
  "Re3e7": 253441,
  "Re3e8+": 251608,
  "Re3xe1": 252597,
  "Re3xe2+": 251213,
  "Re3xe4": 253182,
  "Re3xe5": 250484,
  "Re3xe6": 251212,
  "Re3xe6+": 250098,
  "Re3xe8+": 250517,
  "Re4": 251550,
  "Re4#": 253201,
  "Re4+": 250144,
  "Re4e1": 251499,
  "Re4e1+": 250980,
  "Re4e2": 253174,
  "Re4e3": 250189,
  "Re4e5": 251334,
  "Re4e6": 250562,
  "Re4e6+": 253440,
  "Re4e7": 250325,
  "Re4e7+": 253252,
  "Re4e8+": 253373,
  "Re4xe3": 252846,
  "Re4xe3+": 250737,
  "Re4xe5": 253567,
  "Re4xe6": 252754,
  "Re4xe7": 250710,
  "Re5": 253305,
  "Re5#": 251557,
  "Re5+": 252053,
  "Re5e1+": 250758,
  "Re5e3": 253643,
  "Re5e6": 250692,
  "Re5e7": 250946,
  "Re5e7+": 251733,
  "Re5xe1": 250360,
  "Re5xe1+": 252619,
  "Re5xe2": 250632,
  "Re5xe2+": 250671,
  "Re5xe3+": 251568,
  "Re5xe4": 251669,
  "Re5xe6": 253130,
  "Re5xe7": 253240,
  "Re5xe7+": 250114,
  "Re5xe8": 251302,
  "Re5xe8+": 252654,
  "Re6": 251731,
  "Re6+": 252843,
  "Re6e1": 250900,
  "Re6e1+": 250393,
  "Re6e2": 250933,
  "Re6e3": 250164,
  "Re6e4": 252403,
  "Re6e5": 251610,
  "Re6e7": 250622,
  "Re6e7+": 252577,
  "Re6e8": 250953,
  "Re6xe3": 251536,
  "Re6xe5": 253343,
  "Re6xe7": 251275,
  "Re6xe7+": 250870,
  "Re7": 250845,
  "Re7#": 251073,
  "Re7+": 253571,
  "Re7e1+": 252302,
  "Re7e2": 253293,
  "Re7e2+": 252903,
  "Re7e3": 252976,
  "Re7e5": 253466,
  "Re7e6": 252160,
  "Re7e6+": 252050,
  "Re7xe1": 250894,
  "Re7xe1+": 250747,
  "Re7xe2": 251973,
  "Re7xe3": 253000,
  "Re7xe4": 252683,
  "Re7xe4+": 251056,
  "Re7xe6": 250323,
  "Re7xe8+": 250296,
  "Re8": 251254,
  "Re8#": 251697,
  "Re8+": 250166,
  "Re8e2": 251313,
  "Re8e2+": 250511,
  "Re8e4": 250470,
  "Re8e5": 253586,
  "Re8e5+": 250588,
  "Re8e6": 252623,
  "Re8e7": 252950,
  "Re8e7+": 253379,
  "Re8xe7": 250213,
  "Rea1": 252326,
  "Rea3": 252562,
  "Rea7": 253503,
  "Rea8": 250753,
  "Reb1": 253214,
  "Reb1+": 253545,
  "Reb2": 251859,
  "Reb7": 250391,
  "Reb7+": 251889,
  "Reb8": 251787,
  "Reb8+": 250769,
  "Rec1": 253335,
  "Rec2": 252317,
  "Rec3": 252516,
  "Rec5": 252318,
  "Rec6": 250305,
  "Rec7": 252865,
  "Rec8": 252327,
  "Rec8+": 252329,
  "Red1": 253250,
  "Red1+": 250259,
  "Red2": 250683,
  "Red3": 251709,
  "Red4": 252706,
  "Red5": 250693,
  "Red6": 252069,
  "Red7": 253448,
  "Red8": 252553,
  "Red8#": 251151,
  "Red8+": 250773,
  "Ree1": 253257,
  "Ree2": 250330,
  "Ree3": 251480,
  "Ree4": 252541,
  "Ree5": 252415,
  "Ree6": 250655,
  "Ree7": 252871,
  "Ree8": 253207,
  "Ref1": 253384,
  "Ref1+": 252995,
  "Ref2": 253147,
  "Ref3": 251074,
  "Ref6": 252898,
  "Ref7": 251837,
  "Ref7+": 250685,
  "Ref8": 250247,
  "Reg1": 251431,
  "Reg2": 253318,
  "Reg2#": 251175,
  "Reg2+": 251209,
  "Reg3": 251279,
  "Reg5": 251395,
  "Reg6": 251397,
  "Reg7#": 250603,
  "Reg7+": 252153,
  "Reg8": 252240,
  "Reg8+": 251260,
  "Reh1": 252410,
  "Reh3": 252306,
  "Reh4": 252237,
  "Reh5": 252454,
  "Reh8": 250359,
  "Reh8+": 253608,
  "Rexa2": 251005,
  "Rexa7": 253128,
  "Rexb7": 250802,
  "Rexc1": 253082,
  "Rexc2": 250333,
  "Rexc6": 251934,
  "Rexc7": 252211,
  "Rexc8": 250192,
  "Rexd1": 250847,
  "Rexd3": 250623,
  "Rexd4": 252220,
  "Rexd7": 253211,
  "Rexd8": 252438,
  "Rexe2": 251252,
  "Rexe2#": 250689,
  "Rexe2+": 250498,
  "Rexe3": 253051,
  "Rexe4": 252132,
  "Rexe5": 252206,
  "Rexe6": 251589,
  "Rexe7": 252018,
  "Rexf1": 250452,
  "Rexf2+": 252144,
  "Rexf5": 251982,
  "Rexf7": 250813,
  "Rexf7+": 252740,
  "Rexf8": 251179,
  "Rexg2+": 253686,
  "Rexg5": 253389,
  "Rexg6#": 252844,
  "Rexg7": 252054,
  "Rexg7+": 251773,
  "Rexh1": 250589,
  "Rexh7": 253216,
  "Rf1": 251677,
  "Rf1#": 253479,
  "Rf1+": 251960,
  "Rf1f2": 251283,
  "Rf1f3": 252974,
  "Rf1f4": 250867,
  "Rf1f6#": 252864,
  "Rf1f6+": 251485,
  "Rf1xf2": 250895,
  "Rf1xf5": 253662,
  "Rf2": 250485,
  "Rf2#": 251680,
  "Rf2+": 250146,
  "Rf2f1+": 252309,
  "Rf2f3": 250207,
  "Rf2f4": 251089,
  "Rf2f6": 250388,
  "Rf2f6+": 253297,
  "Rf2f7+": 250185,
  "Rf2f8+": 250712,
  "Rf2xf1+": 250321,
  "Rf2xf4": 250580,
  "Rf2xf6": 251891,
  "Rf2xf7": 253145,
  "Rf2xf7+": 252964,
  "Rf2xf8": 253546,
  "Rf2xf8+": 250407,
  "Rf3": 250106,
  "Rf3#": 251863,
  "Rf3+": 253640,
  "Rf3f1+": 250071,
  "Rf3f2": 251312,
  "Rf3f2+": 251250,
  "Rf3f4": 251548,
  "Rf3f4+": 251384,
  "Rf3f6": 253036,
  "Rf3f7": 252112,
  "Rf3xf2": 250077,
  "Rf3xf2+": 253350,
  "Rf3xf6": 253553,
  "Rf3xf7": 252943,
  "Rf3xf7+": 252233,
  "Rf4": 251257,
  "Rf4+": 251720,
  "Rf4f1": 251032,
  "Rf4f1+": 251921,
  "Rf4f2": 253324,
  "Rf4f2+": 252786,
  "Rf4f3": 252891,
  "Rf4f3+": 251729,
  "Rf4f5": 253074,
  "Rf4f5+": 250371,
  "Rf4f6": 252821,
  "Rf4f7": 250284,
  "Rf4f7+": 250312,
  "Rf4xf3": 252052,
  "Rf4xf3+": 251986,
  "Rf4xf7": 250571,
  "Rf5": 252297,
  "Rf5+": 251270,
  "Rf5f2": 252065,
  "Rf5f3": 253271,
  "Rf5f4": 252946,
  "Rf5f6": 250993,
  "Rf5f6+": 250824,
  "Rf5f7": 250460,
  "Rf5xf2": 253193,
  "Rf5xf3": 253295,
  "Rf5xf4": 252426,
  "Rf5xf6": 250240,
  "Rf5xf7": 250538,
  "Rf6": 253564,
  "Rf6#": 251892,
  "Rf6+": 251030,
  "Rf6f3": 250915,
  "Rf6f4": 253427,
  "Rf6f5": 252986,
  "Rf6f7": 250482,
  "Rf6xf1": 252879,
  "Rf6xf2": 250502,
  "Rf6xf3": 250115,
  "Rf7": 252284,
  "Rf7#": 252602,
  "Rf7+": 251605,
  "Rf7f2+": 250075,
  "Rf7f3": 252938,
  "Rf7f3+": 253044,
  "Rf7f4": 253484,
  "Rf7f5": 251670,
  "Rf7f6": 253063,
  "Rf7f8": 250539,
  "Rf7f8#": 251864,
  "Rf7f8+": 253144,
  "Rf7xf2": 253239,
  "Rf7xf2+": 251783,
  "Rf7xf3": 251174,
  "Rf7xf4": 251093,
  "Rf7xf5": 250687,
  "Rf7xf6": 253261,
  "Rf8": 250891,
  "Rf8#": 253607,
  "Rf8+": 253374,
