{
  " ": 50267,
  "<end_fen>": 50266,
  "<start_fen>": 50265,
  "Ba1": 53579,
  "Ba2": 50890,
  "Ba2+": 52636,
  "Ba3": 51089,
  "Ba3#": 50668,
  "Ba3+": 51118,
  "Ba4": 51117,
  "Ba4+": 53817,
  "Ba5": 52360,
  "Ba5+": 50600,
  "Ba6": 50905,
  "Ba6#": 51335,
  "Ba6+": 52843,
  "Ba7": 51641,
  "Ba7+": 53159,
  "Ba8": 51820,
  "Bb1": 52337,
  "Bb2": 51798,
  "Bb2#": 52225,
  "Bb2+": 50854,
  "Bb3": 52553,
  "Bb3#": 51294,
  "Bb3+": 52631,
  "Bb4": 50606,
  "Bb4#": 50670,
  "Bb4+": 51278,
  "Bb5": 53783,
  "Bb5#": 53470,
  "Bb5+": 53512,
  "Bb6": 51727,
  "Bb6#": 53281,
  "Bb6+": 50780,
  "Bb7": 51343,
  "Bb7+": 53416,
  "Bb8": 50634,
  "Bb8+": 51680,
  "Bc1": 50774,
  "Bc1#": 51395,
  "Bc1+": 51098,
  "Bc2": 52162,
  "Bc2+": 53104,
  "Bc3": 53906,
  "Bc3#": 50665,
  "Bc3+": 50625,
  "Bc4": 52928,
  "Bc4+": 51909,
  "Bc5": 52245,
  "Bc5#": 52686,
  "Bc5+": 51401,
  "Bc6": 51220,
  "Bc6#": 51516,
  "Bc6+": 52572,
  "Bc7": 53068,
  "Bc7+": 52437,
  "Bc8": 53037,
  "Bc8#": 51987,
  "Bc8+": 50480,
  "Bd1": 51365,
  "Bd1#": 51037,
  "Bd1+": 52995,
  "Bd2": 52931,
  "Bd2+": 51417,
  "Bd3": 52250,
  "Bd3+": 51223,
  "Bd4": 53628,
  "Bd4#": 53318,
  "Bd4+": 51437,
  "Bd5": 52187,
  "Bd5#": 50519,
  "Bd5+": 53631,
  "Bd6": 53494,
  "Bd6#": 50689,
  "Bd6+": 50788,
  "Bd7": 50307,
  "Bd7#": 53094,
  "Bd7+": 51740,
  "Bd8": 51148,
  "Bd8#": 51514,
  "Bd8+": 52796,
  "Be1": 51132,
  "Be1+": 52580,
  "Be2": 50973,
  "Be2+": 53889,
  "Be3": 52256,
  "Be3#": 52908,
  "Be3+": 52287,
  "Be4": 52816,
  "Be4+": 50320,
  "Be5": 52302,
  "Be5+": 50393,
  "Be6": 51333,
  "Be6#": 53228,
  "Be6+": 53035,
  "Be7": 53446,
  "Be7#": 50739,
  "Be7+": 51633,
  "Be8": 52696,
  "Be8+": 51673,
  "Bf1": 53276,
  "Bf1#": 53248,
  "Bf1+": 51415,
  "Bf2": 50402,
  "Bf2#": 52582,
  "Bf2+": 53438,
  "Bf3": 53898,
  "Bf3#": 50651,
  "Bf3+": 50730,
  "Bf4": 52657,
  "Bf4#": 52235,
  "Bf4+": 53465,
  "Bf5": 53351,
  "Bf5#": 52016,
  "Bf5+": 53580,
  "Bf6": 53062,
  "Bf6#": 53658,
  "Bf6+": 52770,
  "Bf7": 52051,
  "Bf7#": 51570,
  "Bf7+": 50853,
  "Bf8": 53215,
  "Bf8+": 52029,
  "Bg1": 53577,
  "Bg1+": 50802,
  "Bg2": 51765,
  "Bg2#": 51059,
  "Bg2+": 51062,
  "Bg3": 52826,
  "Bg3#": 53330,
  "Bg3+": 51910,
  "Bg4": 51990,
  "Bg4#": 51843,
  "Bg4+": 50801,
  "Bg5": 51594,
  "Bg5#": 52055,
  "Bg5+": 51612,
  "Bg6": 51783,
  "Bg6#": 51935,
  "Bg6+": 52310,
  "Bg7": 53224,
  "Bg7#": 51085,
  "Bg7+": 52270,
  "Bg8": 53069,
  "Bg8+": 51900,
  "Bh1": 51714,
  "Bh2": 53754,
  "Bh2+": 51044,
  "Bh3": 53867,
  "Bh3#": 51324,
  "Bh3+": 50658,
  "Bh4": 52425,
  "Bh4#": 53834,
  "Bh4+": 50461,
  "Bh5": 51263,
  "Bh5#": 52475,
  "Bh5+": 50411,
  "Bh6": 50622,
  "Bh6#": 51079,
  "Bh6+": 50707,
  "Bh7": 50475,
  "Bh7+": 53702,
  "Bh8": 50520,
  "Bxa1": 51394,
  "Bxa2": 53684,
  "Bxa2+": 53070,
  "Bxa3": 52126,
  "Bxa3+": 52560,
  "Bxa4": 52344,
  "Bxa4+": 52496,
  "Bxa5": 52771,
  "Bxa5+": 52321,
  "Bxa6": 52466,
  "Bxa6#": 53469,
  "Bxa6+": 50492,
  "Bxa7": 51310,
  "Bxa7+": 52306,
  "Bxa8": 52801,
  "Bxb1": 52367,
  "Bxb2": 51778,
  "Bxb2+": 52856,
  "Bxb3": 52460,
  "Bxb3+": 53421,
  "Bxb4": 53452,
  "Bxb4+": 51971,
  "Bxb5": 53413,
  "Bxb5#": 51576,
  "Bxb5+": 53060,
  "Bxb6": 52316,
  "Bxb6#": 53325,
  "Bxb6+": 52753,
  "Bxb7": 50685,
  "Bxb7+": 51566,
  "Bxb8": 53571,
  "Bxc1": 53018,
  "Bxc1+": 51661,
  "Bxc2": 53781,
  "Bxc2+": 53749,
  "Bxc3": 51439,
  "Bxc3#": 53348,
  "Bxc3+": 52530,
  "Bxc4": 53905,
  "Bxc4#": 52200,
  "Bxc4+": 52254,
  "Bxc5": 50290,
  "Bxc5#": 50425,
  "Bxc5+": 53663,
  "Bxc6": 53443,
  "Bxc6#": 51010,
  "Bxc6+": 51355,
  "Bxc7": 52237,
  "Bxc7+": 53858,
  "Bxc8": 51349,
  "Bxd1": 52895,
  "Bxd1+": 51959,
  "Bxd2": 52015,
  "Bxd2+": 51474,
  "Bxd3": 52383,
  "Bxd3#": 51637,
  "Bxd3+": 51305,
  "Bxd4": 53666,
  "Bxd4#": 50888,
  "Bxd4+": 51483,
  "Bxd5": 51830,
  "Bxd5+": 52414,
  "Bxd6": 52912,
  "Bxd6#": 50573,
  "Bxd6+": 51361,
  "Bxd7": 53053,
  "Bxd7+": 51457,
  "Bxd8": 52211,
  "Bxd8#": 52468,
  "Bxd8+": 53831,
  "Bxe1": 53594,
  "Bxe1+": 53337,
  "Bxe2": 51941,
  "Bxe2#": 53692,
  "Bxe2+": 51863,
  "Bxe3": 53765,
  "Bxe3+": 52156,
  "Bxe4": 53173,
  "Bxe4+": 52577,
  "Bxe5": 52033,
  "Bxe5#": 52028,
  "Bxe5+": 51777,
  "Bxe6": 50877,
  "Bxe6+": 52376,
  "Bxe7": 52167,
  "Bxe7#": 52976,
  "Bxe7+": 52929,
  "Bxe8": 53001,
  "Bxe8+": 53106,
  "Bxf1": 51403,
  "Bxf1+": 53311,
  "Bxf2": 51916,
  "Bxf2#": 52647,
  "Bxf2+": 51009,
  "Bxf3": 52794,
  "Bxf3#": 53562,
  "Bxf3+": 51003,
  "Bxf4": 52881,
  "Bxf4+": 51473,
  "Bxf5": 52739,
  "Bxf5+": 53006,
  "Bxf6": 52111,
  "Bxf6#": 51291,
  "Bxf6+": 53589,
  "Bxf7": 53768,
  "Bxf7#": 52645,
  "Bxf7+": 50438,
  "Bxf8": 51582,
  "Bxf8+": 53593,
  "Bxg1": 51207,
  "Bxg1+": 52542,
  "Bxg2": 51542,
  "Bxg2+": 50371,
  "Bxg3": 52515,
  "Bxg3#": 50311,
  "Bxg3+": 51091,
  "Bxg4": 50474,
  "Bxg4+": 52866,
  "Bxg5": 52885,
  "Bxg5+": 53871,
  "Bxg6": 53195,
  "Bxg6#": 53374,
  "Bxg6+": 53445,
  "Bxg7": 52378,
  "Bxg7+": 51980,
  "Bxg8": 53524,
  "Bxg8+": 51331,
  "Bxh1": 50653,
  "Bxh2": 52026,
  "Bxh2+": 51767,
  "Bxh3": 52934,
  "Bxh3#": 51000,
  "Bxh3+": 51886,
  "Bxh4": 52006,
  "Bxh4+": 52966,
  "Bxh5": 51554,
  "Bxh5#": 51040,
  "Bxh5+": 50952,
  "Bxh6": 52094,
  "Bxh6+": 50553,
  "Bxh7": 52835,
  "Bxh7#": 53611,
  "Bxh7+": 53719,
  "Bxh8": 51034,
  "Ka1": 50343,
  "Ka2": 52291,
  "Ka3": 51653,
  "Ka4": 51794,
  "Ka4+": 51932,
  "Ka5": 50537,
  "Ka6": 51530,
  "Ka6+": 52022,
  "Ka7": 53046,
  "Ka8": 53080,
  "Kb1": 53043,
  "Kb2": 50395,
  "Kb2+": 52759,
  "Kb3": 50686,
  "Kb3+": 50677,
  "Kb4": 52536,
  "Kb5": 52882,
  "Kb6": 53674,
  "Kb7": 50511,
  "Kb8": 52571,
  "Kc1": 51205,
  "Kc2": 52401,
  "Kc2+": 53447,
  "Kc3": 51647,
  "Kc3+": 50611,
  "Kc4": 53565,
  "Kc4+": 53233,
  "Kc5": 51583,
  "Kc5+": 52857,
  "Kc6": 50754,
  "Kc6+": 50376,
  "Kc7": 50902,
  "Kc8": 51383,
  "Kd1": 50453,
  "Kd1+": 51042,
  "Kd2": 51478,
  "Kd2#": 53200,
  "Kd2+": 51596,
  "Kd3": 51568,
  "Kd4": 51638,
  "Kd4+": 51312,
  "Kd5": 51370,
  "Kd6": 52319,
  "Kd6+": 52386,
  "Kd7": 50387,
  "Kd7+": 51749,
  "Kd8": 52954,
  "Ke1": 51346,
  "Ke2": 52892,
  "Ke2+": 50740,
  "Ke3": 53709,
  "Ke4": 53812,
  "Ke5": 52082,
  "Ke6": 53536,
  "Ke7": 52486,
  "Ke8": 53777,
  "Kf1": 51527,
  "Kf2": 50546,
  "Kf2#": 53507,
  "Kf3": 52942,
  "Kf4": 53331,
  "Kf5": 53711,
  "Kf6": 52937,
  "Kf6+": 51077,
  "Kf7": 52238,
  "Kf8": 52031,
  "Kf8+": 52717,
  "Kg1": 51562,
  "Kg2": 50449,
  "Kg3": 51311,
  "Kg3+": 51410,
  "Kg4": 51689,
  "Kg4+": 52898,
  "Kg5": 50416,
  "Kg6": 51012,
  "Kg7": 50659,
  "Kg8": 52373,
  "Kg8#": 53878,
  "Kg8+": 53762,
  "Kh1": 50584,
  "Kh2": 52706,
  "Kh3": 53316,
  "Kh4": 52699,
  "Kh5": 51329,
  "Kh6": 52141,
  "Kh6+": 52165,
  "Kh7": 52936,
  "Kh8": 50717,
  "Kh8+": 51590,
  "Kxa1": 53716,
  "Kxa2": 52166,
  "Kxa3": 52342,
  "Kxa4": 50631,
  "Kxa5": 51226,
  "Kxa6": 50721,
  "Kxa7": 53564,
  "Kxa8": 52391,
  "Kxb1": 52059,
  "Kxb2": 52780,
  "Kxb3": 51543,
  "Kxb4": 51607,
  "Kxb5": 53177,
  "Kxb6": 52153,
  "Kxb7": 52315,
  "Kxb8": 53382,
  "Kxc1": 51194,
  "Kxc2": 53191,
  "Kxc3": 53634,
  "Kxc4": 51589,
  "Kxc5": 53151,
  "Kxc6": 52590,
  "Kxc7": 51104,
  "Kxc8": 52258,
  "Kxd1": 52138,
  "Kxd2": 53388,
  "Kxd3": 52988,
  "Kxd4": 53843,
  "Kxd5": 50436,
  "Kxd6": 53352,
  "Kxd7": 51378,
  "Kxd8": 52096,
  "Kxe1": 52439,
  "Kxe2": 52470,
  "Kxe3": 52483,
  "Kxe4": 52489,
  "Kxe5": 53112,
  "Kxe6": 50766,
  "Kxe7": 53059,
  "Kxe8": 50771,
  "Kxf1": 51699,
  "Kxf2": 50350,
  "Kxf3": 50954,
  "Kxf4": 50831,
  "Kxf4+": 52008,
  "Kxf5": 53063,
  "Kxf6": 53703,
  "Kxf7": 51600,
  "Kxf8": 52150,
  "Kxg1": 50567,
  "Kxg2": 52867,
  "Kxg3": 52545,
  "Kxg4": 52869,
  "Kxg5": 52749,
  "Kxg6": 51958,
  "Kxg7": 52905,
  "Kxg8": 52550,
  "Kxh1": 50525,
  "Kxh2": 50930,
  "Kxh3": 51261,
  "Kxh4": 53569,
  "Kxh5": 50915,
  "Kxh6": 53545,
  "Kxh7": 51356,
  "Kxh8": 53724,
  "Na1": 52202,
  "Na2": 50990,
  "Na2#": 51429,
  "Na2+": 53129,
  "Na3": 50675,
  "Na3#": 51337,
  "Na3+": 53360,
  "Na4": 52879,
  "Na4+": 52746,
  "Na5": 52887,
  "Na5+": 52377,
  "Na6": 50935,
  "Na6+": 53887,
  "Na7": 50718,
  "Na7#": 51938,
  "Na7+": 52993,
  "Na8": 50931,
  "Na8+": 52457,
  "Nab1": 50683,
  "Nab4": 52914,
  "Nab5": 50626,
  "Nab6": 53140,
  "Nab6+": 50918,
  "Nab7": 52791,
  "Nab8": 51748,
  "Nac1": 50682,
  "Nac3": 52750,
  "Nac4": 50816,
  "Nac5": 53217,
  "Nac6": 52968,
  "Nac7": 51969,
  "Naxb5": 52994,
  "Naxc3": 53671,
  "Naxc4": 52964,
  "Naxc5": 50469,
  "Naxc6": 52154,
  "Nb1": 53039,
  "Nb1+": 51509,
  "Nb1a3": 50513,
  "Nb1c3": 51172,
  "Nb1d2": 51048,
  "Nb2": 52656,
  "Nb2+": 51946,
  "Nb3": 51480,
  "Nb3+": 52205,
  "Nb3a5": 52201,
  "Nb3d4": 52131,
  "Nb3xd4": 50731,
  "Nb4": 51416,
  "Nb4#": 51399,
  "Nb4+": 53087,
  "Nb4a6": 52940,
  "Nb4c6": 53799,
  "Nb4d5": 53518,
  "Nb5": 50764,
  "Nb5#": 50298,
  "Nb5+": 52328,
  "Nb5a3": 51405,
  "Nb5c3": 53092,
  "Nb5d4": 53176,
  "Nb6": 53837,
  "Nb6#": 53710,
  "Nb6+": 53678,
  "Nb6d7": 51780,
  "Nb6xd5": 50848,
  "Nb7": 51588,
  "Nb7+": 51949,
  "Nb8": 50981,
  "Nb8#": 52083,
  "Nb8+": 50434,
  "Nb8c6": 52065,
  "Nb8d7": 52601,
  "Nba2": 52627,
  "Nba3": 51347,
  "Nba5": 51050,
  "Nba6": 53408,
  "Nbc1": 51571,
  "Nbc2": 51533,
  "Nbc3": 50846,
  "Nbc4": 51927,
  "Nbc5": 52194,
  "Nbc6": 51041,
  "Nbc7": 53759,
  "Nbc7+": 51112,
  "Nbc8": 52278,
  "Nbd2": 50462,
  "Nbd2+": 53074,
  "Nbd3": 52519,
  "Nbd4": 51854,
  "Nbd5": 53882,
  "Nbd6": 50316,
  "Nbd6+": 53000,
  "Nbd7": 53828,
  "Nbxa3": 50561,
  "Nbxc2+": 50863,
  "Nbxc3": 50323,
  "Nbxc4": 53399,
  "Nbxc5": 51802,
  "Nbxc6": 53030,
  "Nbxc6+": 52960,
  "Nbxc7+": 52209,
  "Nbxd2": 50617,
  "Nbxd3+": 52630,
  "Nbxd4": 53471,
  "Nbxd5": 52947,
  "Nbxd6": 53739,
  "Nbxd7": 51469,
  "Nc1": 53864,
  "Nc1+": 52340,
  "Nc1a2": 53403,
  "Nc2": 52713,
  "Nc2#": 52840,
  "Nc2+": 51432,
  "Nc2d4": 50760,
  "Nc2xa3": 51140,
  "Nc3": 51063,
  "Nc3#": 51876,
  "Nc3+": 52227,
  "Nc3e2": 52724,
  "Nc4": 53132,
  "Nc4+": 53908,
  "Nc4a3": 51874,
  "Nc4a5": 53822,
  "Nc4xe5": 53283,
  "Nc5": 51718,
  "Nc5#": 53877,
  "Nc5+": 52812,
  "Nc6": 51757,
  "Nc6#": 52046,
  "Nc6+": 52924,
  "Nc6a5": 51950,
  "Nc6e5": 52318,
  "Nc7": 53131,
  "Nc7#": 50872,
  "Nc7+": 51603,
  "Nc8": 52389,
  "Nc8+": 51989,
  "Nc8a7": 51409,
  "Nc8e7": 51100,
  "Nca6": 51096,
  "Ncb1": 51015,
  "Ncb4": 50608,
  "Ncb4+": 50767,
  "Ncb5": 52969,
  "Ncb6": 53455,
  "Ncd1": 51425,
  "Ncd2": 53880,
  "Ncd2#": 51411,
  "Ncd3": 51005,
  "Ncd4": 51123,
  "Ncd5": 50555,
  "Ncd6": 50594,
  "Ncd7": 53366,
  "Ncd8": 53319,
  "Nce1": 50348,
  "Nce2": 52946,
  "Nce2+": 51895,
  "Nce3": 51376,
  "Nce4": 53467,
  "Nce4+": 51449,
  "Nce5": 53231,
  "Nce6": 53384,
  "Nce6+": 52740,
  "Nce7": 53026,
  "Nce8": 53209,
  "Ncxa8": 51953,
  "Ncxb2": 51122,
  "Ncxb4": 51787,
  "Ncxb5": 53796,
  "Ncxb6": 50566,
  "Ncxd4": 52521,
  "Ncxd4+": 51320,
  "Ncxd5": 51364,
  "Ncxd5+": 51178,
  "Ncxd6": 50975,
  "Ncxe2": 50993,
  "Ncxe3": 50826,
  "Ncxe3+": 52758,
  "Ncxe4": 53301,
  "Ncxe5": 53675,
  "Ncxe6": 53713,
  "Ncxe7": 52588,
  "Ncxe8": 53045,
  "Nd1": 50498,
  "Nd1+": 52266,
  "Nd1b2": 52294,
  "Nd2": 53495,
  "Nd2#": 52983,
  "Nd2+": 50572,
  "Nd2b3": 50273,
  "Nd2c4": 50784,
  "Nd2f3": 52503,
  "Nd2xf3": 51152,
  "Nd3": 53688,
  "Nd3#": 52476,
  "Nd3+": 51239,
  "Nd3b4": 50765,
  "Nd4": 53740,
  "Nd4#": 52774,
  "Nd4+": 52093,
  "Nd4f3": 51911,
  "Nd5": 51598,
  "Nd5#": 52216,
  "Nd5+": 52045,
  "Nd5b6": 51529,
  "Nd5f6": 51579,
  "Nd5xb4": 51504,
  "Nd6": 50650,
  "Nd6#": 52140,
  "Nd6+": 53700,
  "Nd6e4": 52586,
  "Nd6f5": 53013,
  "Nd6xc4": 51751,
  "Nd6xf5": 51961,
  "Nd7": 53912,
  "Nd7#": 53680,
  "Nd7+": 51162,
  "Nd7b6": 53832,
  "Nd7f6": 51882,
  "Nd8": 53617,
  "Nd8+": 53528,
  "Nd8f7": 50365,
  "Ndb1": 50768,
  "Ndb3": 50603,
  "Ndb4": 51190,
  "Ndb5": 52092,
  "Ndb6": 50278,
  "Ndb8": 50996,
  "Ndc2": 52923,
  "Ndc3": 51206,
  "Ndc4": 51560,
  "Ndc5": 50354,
  "Ndc6": 52381,
  "Ndc7": 52358,
  "Ndc8": 52177,
  "Nde2": 52874,
  "Nde3": 52858,
  "Nde4": 53153,
  "Nde5": 51965,
  "Nde5+": 51453,
  "Nde6": 52482,
  "Nde6+": 53523,
  "Nde7": 53183,
  "Ndf1": 51161,
  "Ndf2": 53168,
  "Ndf3": 51754,
  "Ndf4": 53288,
  "Ndf5": 50737,
  "Ndf6": 51352,
  "Ndf6+": 52484,
  "Ndf7": 51128,
  "Ndf8": 51018,
  "Ndxb3": 52972,
  "Ndxb4": 52963,
  "Ndxb5": 53084,
  "Ndxc2": 52802,
  "Ndxc4": 51309,
  "Ndxc5": 51398,
  "Ndxe2+": 52506,
  "Ndxe3+": 53503,
  "Ndxe4": 53345,
  "Ndxe5": 51499,
  "Ndxe5+": 51706,
  "Ndxe6": 51832,
  "Ndxe6+": 51857,
  "Ndxe7": 52462,
  "Ndxe7+": 51683,
  "Ndxf2": 52116,
  "Ndxf4": 51026,
  "Ndxf5": 51030,
  "Ndxf6": 50795,
  "Ndxf7": 50841,
  "Ne1": 51848,
  "Ne1+": 53853,
  "Ne1f3": 51675,
  "Ne2": 52639,
  "Ne2+": 52249,
  "Ne2c3": 53888,
  "Ne2d4": 51872,
  "Ne2g3": 53402,
  "Ne2g3+": 52554,
  "Ne3": 52919,
  "Ne3#": 52846,
  "Ne3+": 51053,
  "Ne3c4": 51120,
  "Ne3g4": 51054,
  "Ne3xc4": 51539,
  "Ne4": 53881,
  "Ne4#": 53820,
  "Ne4+": 51528,
  "Ne4c3": 50803,
  "Ne4c5": 52939,
  "Ne4g3": 52052,
  "Ne4g5": 51890,
  "Ne4xc5": 52077,
  "Ne5": 50684,
  "Ne5#": 51564,
  "Ne5+": 53539,
  "Ne5c6": 52743,
  "Ne5d3": 52409,
  "Ne5g6": 50708,
  "Ne6": 53027,
  "Ne6#": 51850,
  "Ne6+": 52453,
  "Ne6c5": 51546,
  "Ne7": 53604,
  "Ne7#": 53135,
  "Ne7+": 52185,
  "Ne7c6": 51338,
  "Ne7g6": 52146,
  "Ne7xg6": 52458,
  "Ne8": 52514,
  "Ne8+": 52172,
  "Nec1": 51897,
  "Nec2": 53875,
  "Nec2+": 51937,
  "Nec3": 53606,
  "Nec4": 50630,
  "Nec5": 50967,
  "Nec6": 51412,
  "Nec7": 51999,
  "Nec7+": 51187,
  "Nec8": 51668,
  "Ned2": 52456,
  "Ned3": 50306,
  "Ned3+": 51522,
  "Ned4": 52848,
  "Ned5": 50417,
  "Ned6": 52497,
  "Ned6+": 51651,
  "Ned7": 53152,
  "Ned8": 52833,
  "Nef1": 51810,
  "Nef2": 51764,
  "Nef2+": 51760,
  "Nef3": 52783,
  "Nef4": 53899,
  "Nef4+": 53655,
  "Nef5": 51496,
  "Nef5+": 51094,
  "Nef6": 52039,
  "Nef6+": 52295,
  "Nef7+": 52823,
  "Neg1": 51236,
  "Neg2": 50598,
  "Neg3": 53343,
  "Neg4": 51809,
  "Neg4+": 53411,
  "Neg5": 50745,
  "Neg5+": 51142,
  "Neg6": 53397,
  "Neg6+": 52137,
  "Neg7": 51648,
  "Neg8": 51913,
  "Nexc3": 53357,
  "Nexc4": 50361,
  "Nexc5": 50423,
  "Nexc6": 53497,
  "Nexc7+": 53544,
  "Nexd2": 51901,
  "Nexd4": 52578,
  "Nexd5": 51725,
  "Nexd6": 52961,
  "Nexd6+": 52464,
  "Nexd7": 53780,
  "Nexf2": 53603,
  "Nexf3": 51720,
  "Nexf3+": 53147,
  "Nexf4": 53207,
  "Nexf5": 53610,
  "Nexf6+": 53498,
  "Nexf7": 52551,
  "Nexg3": 52455,
  "Nexg4": 52558,
  "Nexg5": 52880,
  "Nf1": 51193,
  "Nf1+": 52040,
  "Nf1d2": 52676,
  "Nf1h2": 51175,
  "Nf2": 52129,
  "Nf2#": 50796,
  "Nf2+": 51657,
  "Nf3": 51917,
  "Nf3#": 51729,
  "Nf3+": 50971,
  "Nf3d2": 51177,
  "Nf3d4": 53291,
  "Nf3e5": 50992,
  "Nf3g5+": 53108,
  "Nf3h2": 52980,
  "Nf3h4": 52910,
  "Nf3xd4": 52434,
  "Nf3xg5": 50674,
  "Nf4": 52472,
  "Nf4#": 51586,
  "Nf4+": 53061,
  "Nf5": 53835,
  "Nf5#": 51666,
  "Nf5+": 52851,
  "Nf5xh4": 52038,
  "Nf6": 52035,
  "Nf6#": 51591,
  "Nf6+": 51114,
  "Nf6d5": 52922,
  "Nf6d7": 52298,
  "Nf6g4": 53910,
  "Nf6h5": 52984,
  "Nf7": 50962,
  "Nf7#": 52999,
  "Nf7+": 52027,
  "Nf7d6": 52307,
  "Nf7h6": 52034,
  "Nf8": 53489,
  "Nf8+": 52878,
  "Nf8d7": 51904,
  "Nf8e6": 51289,
  "Nf8h7": 52669,
  "Nfd2": 53275,
  "Nfd3": 52220,
  "Nfd3+": 50712,
  "Nfd4": 53848,
  "Nfd4+": 52326,
  "Nfd5": 50585,
  "Nfd6": 52981,
  "Nfd6+": 52406,
  "Nfd7": 52228,
  "Nfd8": 53761,
  "Nfe1": 50450,
  "Nfe2": 53434,
  "Nfe3": 53694,
  "Nfe3+": 53646,
  "Nfe4": 50426,
  "Nfe5": 53838,
  "Nfe5+": 51812,
  "Nfe6": 52864,
  "Nfe7": 50502,
  "Nfe7+": 52363,
  "Nfe8": 53267,
  "Nfg1": 52990,
  "Nfg3": 51321,
  "Nfg4": 52876,
  "Nfg4+": 53788,
  "Nfg5": 52493,
  "Nfg5+": 52160,
  "Nfg6": 52224,
  "Nfg8": 50883,
  "Nfh2": 53786,
  "Nfh4": 53432,
  "Nfh5": 51396,
  "Nfxd2": 51681,
  "Nfxd3+": 52945,
  "Nfxd4": 51805,
  "Nfxd5": 52705,
  "Nfxd7": 53044,
  "Nfxe1": 51325,
  "Nfxe2": 52014,
  "Nfxe4": 53126,
  "Nfxe5": 51307,
  "Nfxe5+": 51770,
  "Nfxe6": 52421,
  "Nfxe7": 53653,
  "Nfxg4": 53125,
  "Nfxg5": 52564,
  "Ng1": 51824,
  "Ng1+": 51068,
  "Ng1e2": 50706,
  "Ng1f3": 53842,
  "Ng2": 53708,
  "Ng2#": 51099,
  "Ng2+": 50698,
  "Ng3": 51743,
  "Ng3#": 52688,
  "Ng3+": 52390,
  "Ng3e4": 53196,
  "Ng3xe4+": 52504,
  "Ng4": 53303,
  "Ng4#": 53636,
  "Ng4+": 53296,
  "Ng5": 50529,
  "Ng5#": 52596,
  "Ng5+": 51914,
  "Ng5e4": 51656,
  "Ng5f3": 53884,
  "Ng6": 50481,
  "Ng6#": 52681,
  "Ng6+": 53483,
  "Ng6e7": 50893,
  "Ng7": 52800,
  "Ng7#": 50732,
  "Ng7+": 52678,
  "Ng8": 51553,
  "Ng8#": 52143,
  "Ng8+": 50380,
  "Ng8e7": 53558,
  "Ng8f6": 53591,
  "Ng8h6": 51286,
  "Ng8xe7": 51419,
  "Nge2": 51936,
  "Nge3": 52242,
  "Nge3+": 52646,
  "Nge4": 50491,
  "Nge4+": 53642,
  "Nge5": 51484,
  "Nge5+": 53836,
  "Nge6": 52772,
  "Nge6+": 52744,
  "Nge7": 50443,
  "Nge8": 53304,
  "Ngf1": 52396,
  "Ngf2+": 53373,
  "Ngf3": 53329,
  "Ngf4+": 52098,
  "Ngf5": 50913,
  "Ngf5+": 53478,
  "Ngf6": 52662,
  "Ngf6+": 50892,
  "Ngf7+": 52183,
  "Ngf8": 53720,
  "Ngh2": 52311,
  "Ngh5": 51159,
  "Ngh6": 52091,
  "Ngh7": 51103,
  "Ngxe2": 51519,
  "Ngxe3": 51960,
  "Ngxe3+": 50270,
  "Ngxe4": 52259,
  "Ngxe5": 50733,
  "Ngxe6": 52559,
  "Ngxe7": 52269,
  "Ngxf2": 51823,
  "Ngxf2+": 53264,
  "Ngxf3": 53378,
  "Ngxf5": 51225,
  "Ngxf6": 51168,
  "Ngxf7": 51472,
  "Ngxh6+": 53336,
  "Ngxh7": 51664,
  "Nh1": 51011,
  "Nh2": 53488,
  "Nh2+": 53088,
  "Nh2f3+": 51036,
  "Nh3": 53699,
  "Nh3#": 51070,
  "Nh3+": 51977,
  "Nh4": 52570,
  "Nh4#": 50442,
  "Nh4+": 52575,
  "Nh5": 52565,
  "Nh5+": 53189,
  "Nh6": 52831,
  "Nh6#": 50821,
  "Nh6+": 50473,
  "Nh7": 53745,
  "Nh7+": 50977,
  "Nh7f6": 52322,
  "Nh8": 52365,
  "Nh8+": 52151,
  "Nh8f7": 51599,
  "Nhf1": 52246,
  "Nhf2": 51548,
  "Nhf3": 52533,
  "Nhf4": 53244,
  "Nhf5": 51825,
  "Nhf6": 51724,
  "Nhf7": 50276,
  "Nhf8": 53122,
  "Nhg1": 52317,
  "Nhg3": 52567,
  "Nhg5": 51086,
  "Nhg6": 53499,
  "Nhg8": 52275,
  "Nhxf5": 51019,
  "Nhxf6": 53662,
  "Nhxf6+": 51169,
  "Nhxg5": 51955,
  "Nhxg6": 52719,
  "Nxa1": 51137,
  "Nxa1+": 52203,
  "Nxa2": 52214,
  "Nxa2+": 51719,
  "Nxa3": 53644,
  "Nxa3+": 53130,
  "Nxa4": 52502,
  "Nxa5": 52556,
  "Nxa5+": 52926,
  "Nxa6": 52986,
  "Nxa7": 52509,
  "Nxa7#": 50862,
  "Nxa7+": 52769,
  "Nxa8": 53194,
  "Nxa8+": 50524,
  "Nxb1": 50421,
  "Nxb2": 53573,
  "Nxb2+": 52781,
  "Nxb3": 51459,
  "Nxb3+": 51302,
  "Nxb4": 52523,
  "Nxb4+": 50779,
  "Nxb5": 50910,
  "Nxb5+": 53821,
  "Nxb6": 51804,
  "Nxb6#": 50291,
  "Nxb6+": 52072,
  "Nxb7": 50406,
  "Nxb7+": 51786,
  "Nxb8": 50822,
  "Nxc1": 50587,
  "Nxc1+": 50624,
  "Nxc2": 51502,
  "Nxc2+": 51209,
  "Nxc3": 51717,
  "Nxc3+": 51084,
  "Nxc4": 52715,
  "Nxc4+": 51248,
  "Nxc5": 53616,
  "Nxc5+": 52730,
  "Nxc6": 51492,
  "Nxc6#": 52056,
  "Nxc6+": 51467,
  "Nxc7": 50360,
  "Nxc7#": 51954,
  "Nxc7+": 50949,
  "Nxc8": 50761,
  "Nxc8+": 50925,
  "Nxd1": 52135,
  "Nxd1+": 53138,
  "Nxd2": 51988,
  "Nxd2+": 50593,
  "Nxd3": 50485,
  "Nxd3+": 53077,
  "Nxd4": 53163,
  "Nxd4#": 51391,
  "Nxd4+": 52348,
  "Nxd5": 53091,
  "Nxd5+": 53019,
  "Nxd6": 51407,
  "Nxd6#": 53790,
  "Nxd6+": 53532,
  "Nxd7": 53033,
  "Nxd7+": 53098,
  "Nxd8": 52327,
  "Nxd8+": 53269,
  "Nxe1": 50369,
  "Nxe1+": 51646,
  "Nxe2": 53874,
  "Nxe2#": 50989,
  "Nxe2+": 51572,
  "Nxe3": 51982,
  "Nxe3+": 53810,
  "Nxe4": 50790,
  "Nxe4#": 50268,
  "Nxe4+": 50839,
  "Nxe5": 51996,
  "Nxe5+": 52728,
  "Nxe6": 50335,
  "Nxe6+": 50439,
  "Nxe7": 53860,
  "Nxe7#": 52890,
  "Nxe7+": 52863,
  "Nxe8": 51730,
  "Nxe8+": 53124,
  "Nxf1": 52112,
  "Nxf1+": 52568,
  "Nxf2": 53869,
  "Nxf2#": 52429,
  "Nxf2+": 52906,
  "Nxf3": 50337,
  "Nxf3+": 52902,
  "Nxf4": 53079,
  "Nxf4+": 53137,
  "Nxf5": 51150,
  "Nxf5+": 50756,
  "Nxf6": 50687,
  "Nxf6#": 50874,
  "Nxf6+": 53839,
  "Nxf7": 53679,
  "Nxf7#": 51547,
  "Nxf7+": 51354,
  "Nxf8": 50917,
  "Nxf8+": 53038,
  "Nxg1": 50861,
  "Nxg1+": 51262,
  "Nxg2": 51004,
  "Nxg2+": 51251,
  "Nxg3": 50914,
  "Nxg3+": 50368,
  "Nxg4": 50638,
  "Nxg4+": 51470,
  "Nxg5": 51593,
  "Nxg5+": 53239,
  "Nxg6": 51662,
  "Nxg6#": 51212,
  "Nxg6+": 53717,
  "Nxg7": 51027,
  "Nxg7#": 52792,
  "Nxg7+": 50437,
  "Nxg8": 53480,
  "Nxg8+": 53326,
  "Nxh1": 52633,
  "Nxh1#": 50715,
  "Nxh1+": 53846,
  "Nxh2": 53036,
  "Nxh2+": 53401,
  "Nxh3": 50817,
  "Nxh3+": 51531,
  "Nxh4": 51617,
  "Nxh4+": 52944,
  "Nxh5": 51007,
  "Nxh5+": 53396,
  "Nxh6": 53605,
  "Nxh6+": 50414,
  "Nxh7": 52223,
  "Nxh7+": 52600,
  "Nxh8": 50548,
  "Nxh8#": 51268,
  "Nxh8+": 53136,
  "O-O": 50986,
  "O-O+": 52297,
  "O-O-O": 53202,
  "O-O-O+": 50655,
  "Qa1": 52683,
  "Qa1#": 51792,
  "Qa1+": 51088,
  "Qa2": 53048,
  "Qa2+": 51806,
  "Qa3": 52884,
  "Qa3+": 52583,
  "Qa4": 50694,
  "Qa4#": 51584,
  "Qa4+": 53670,
  "Qa5": 51171,
  "Qa5#": 51986,
  "Qa5+": 53042,
  "Qa5c7": 52711,
  "Qa6": 51008,
  "Qa6#": 52747,
  "Qa6+": 52208,
  "Qa7": 52899,
  "Qa7#": 51495,
  "Qa7+": 51001,
  "Qa8": 52369,
  "Qa8#": 50762,
  "Qa8+": 52349,
  "Qaa6": 52123,
  "Qac4": 53014,
  "Qaf8": 51841,
  "Qaxb7": 50539,
  "Qaxb7+": 52828,
  "Qb1": 52605,
  "Qb1#": 53514,
  "Qb1+": 50819,
  "Qb1b3": 50710,
  "Qb1b6": 51153,
  "Qb2": 50907,
  "Qb2#": 51350,
  "Qb2+": 51613,
  "Qb2xb1": 52658,
  "Qb3": 50776,
  "Qb3#": 50840,
  "Qb3+": 50912,
  "Qb3xb2": 52239,
  "Qb4": 53156,
  "Qb4#": 51921,
  "Qb4+": 50531,
  "Qb5": 53623,
  "Qb5#": 52803,
  "Qb5+": 53085,
  "Qb5a4": 51129,
  "Qb6": 53423,
  "Qb6#": 50656,
  "Qb6+": 51141,
  "Qb7": 51739,
  "Qb7#": 52652,
  "Qb7+": 53474,
  "Qb8": 51558,
  "Qb8#": 53543,
  "Qb8+": 53256,
  "Qba5": 51382,
  "Qbb2+": 52933,
  "Qbd8": 50515,
  "Qbxb3": 52219,
  "Qbxd5": 53637,
  "Qc1": 50510,
  "Qc1#": 53457,
  "Qc1+": 53263,
  "Qc2": 51436,
  "Qc2#": 51532,
  "Qc2+": 50489,
  "Qc3": 53394,
  "Qc3#": 50636,
  "Qc3+": 50667,
  "Qc4": 52170,
  "Qc4+": 52640,
  "Qc4a6#": 52415,
  "Qc4xd5": 52959,
  "Qc5": 50978,
  "Qc5#": 51878,
  "Qc5+": 50641,
  "Qc6": 51336,
  "Qc6#": 51655,
  "Qc6+": 50499,
  "Qc7": 53845,
  "Qc7#": 50468,
  "Qc7+": 53704,
  "Qc8": 51245,
  "Qc8#": 52182,
  "Qc8+": 52610,
  "Qcb7+": 50394,
  "Qcc6": 51231,
  "Qcc8": 53065,
  "Qce4": 51619,
  "Qcf5+": 53441,
  "Qcg2+": 50702,
  "Qch3": 51113,
  "Qcxb6": 53273,
  "Qcxd5": 53785,
  "Qcxf4": 52815,
  "Qd1": 51862,
  "Qd1#": 53322,
  "Qd1+": 50855,
  "Qd2": 52296,
  "Qd2#": 52736,
  "Qd2+": 50410,
  "Qd3": 50358,
  "Qd3#": 52977,
  "Qd3+": 53268,
  "Qd4": 52450,
  "Qd4#": 50995,
  "Qd4+": 53174,
  "Qd5": 50415,
  "Qd5#": 51101,
  "Qd5+": 50753,
  "Qd6": 51860,
  "Qd6#": 53855,
  "Qd6+": 53253,
  "Qd7": 51974,
  "Qd7#": 53892,
  "Qd7+": 53640,
  "Qd8": 51397,
  "Qd8#": 53323,
  "Qd8+": 51413,
  "Qd8c7": 51609,
  "Qda5": 50985,
  "Qdb1+": 51156,
  "Qdb8": 50616,
  "Qdc4+": 50880,
  "Qdd8": 53081,
  "Qde7": 53317,
  "Qde8": 53386,
  "Qdf2#": 52189,
  "Qdf6": 50938,
  "Qdg5": 50302,
  "Qdh4": 51521,
  "Qdxb4": 51254,
  "Qe1": 53552,
  "Qe1#": 51255,
  "Qe1+": 51476,
  "Qe2": 51644,
  "Qe2#": 52233,
  "Qe2+": 51051,
  "Qe3": 51279,
  "Qe3#": 50937,
  "Qe3+": 51256,
  "Qe4": 50688,
  "Qe4#": 52810,
  "Qe4+": 52911,
  "Qe4xd5": 53148,
  "Qe5": 51776,
  "Qe5#": 53551,
  "Qe5+": 52883,
  "Qe6": 52149,
  "Qe6#": 51006,
  "Qe6+": 50352,
  "Qe7": 53448,
  "Qe7#": 50953,
  "Qe7+": 50413,
  "Qe8": 53647,
  "Qe8#": 52405,
  "Qe8+": 52215,
  "Qea3+": 50374,
  "Qeb3": 50588,
  "Qeb4": 53844,
  "Qeb6": 53143,
  "Qed2": 50457,
  "Qee1": 51199,
  "Qee3+": 53214,
  "Qeg1": 53511,
  "Qeh4": 52354,
  "Qexb5#": 51991,
  "Qexd5": 50454,
  "Qf1": 51418,
  "Qf1#": 53587,
  "Qf1+": 50895,
  "Qf2": 50646,
  "Qf2#": 51660,
  "Qf2+": 51737,
  "Qf3": 51244,
  "Qf3#": 53049,
  "Qf3+": 50430,
  "Qf4": 53515,
  "Qf4#": 53706,
  "Qf4+": 52404,
  "Qf5": 51116,
  "Qf5#": 52822,
  "Qf5+": 50939,
  "Qf6": 52941,
  "Qf6#": 50632,
  "Qf6+": 52357,
  "Qf7": 52524,
  "Qf7#": 53624,
  "Qf7+": 52949,
  "Qf8": 51550,
  "Qf8#": 53741,
  "Qf8+": 50579,
  "Qfa6": 51616,
  "Qfb4": 51184,
  "Qfc8+": 52281,
  "Qfd3#": 52893,
  "Qfd4+": 51670,
  "Qfd5": 50901,
  "Qfe6": 53907,
  "Qff1": 51815,
  "Qff3": 51266,
  "Qfg2": 51766,
  "Qfxb6+": 50339,
  "Qfxd5": 50929,
  "Qfxg3": 53665,
  "Qg1": 53015,
  "Qg1#": 52361,
  "Qg1+": 51332,
  "Qg2": 53814,
  "Qg2#": 50635,
  "Qg2+": 53596,
  "Qg3": 51176,
  "Qg3#": 52602,
  "Qg3+": 52650,
  "Qg3g8+": 53238,
  "Qg4": 51357,
  "Qg4#": 53800,
  "Qg4+": 52814,
  "Qg5": 52632,
  "Qg5#": 52938,
  "Qg5+": 51979,
  "Qg6": 52819,
  "Qg6#": 51563,
  "Qg6+": 50960,
  "Qg7": 53613,
  "Qg7#": 52142,
  "Qg7+": 50322,
  "Qg8": 52557,
  "Qg8#": 51549,
  "Qg8+": 52410,
  "Qg8g3": 52090,
  "Qg8xd5+": 50857,
  "Qgb5": 53620,
  "Qgd6": 51217,
  "Qgd8+": 51578,
  "Qgf6": 51360,
  "Qgg4#": 50431,
  "Qgh4": 51889,
  "Qgxe6+": 52079,
  "Qh1": 53493,
  "Qh1#": 52374,
  "Qh1+": 52314,
  "Qh2": 52459,
  "Qh2#": 52104,
  "Qh2+": 50620,
  "Qh3": 50334,
  "Qh3#": 50809,
  "Qh3+": 51887,
  "Qh4": 50456,
  "Qh4#": 50391,
  "Qh4+": 51964,
  "Qh4f2": 51138,
  "Qh5": 51827,
  "Qh5#": 50464,
  "Qh5+": 53698,
  "Qh6": 52654,
  "Qh6#": 52148,
  "Qh6+": 51867,
  "Qh7": 51842,
  "Qh7#": 53433,
  "Qh7+": 52672,
  "Qh8": 50876,
  "Qh8#": 52107,
  "Qh8+": 50554,
  "Qhc1": 51043,
  "Qhe6": 53142,
  "Qhf5#": 50412,
  "Qhg7#": 52653,
  "Qhh3": 51345,
  "Qhh6": 50432,
  "Qhxg2": 50504,
  "Qhxg2+": 50957,
  "Qxa1": 52125,
  "Qxa1#": 53718,
  "Qxa1+": 52181,
  "Qxa2": 51686,
  "Qxa2#": 52427,
  "Qxa2+": 50446,
  "Qxa3": 51773,
  "Qxa3#": 53602,
  "Qxa3+": 53572,
  "Qxa4": 52671,
  "Qxa4+": 50723,
  "Qxa5": 52485,
  "Qxa5#": 51580,
  "Qxa5+": 51924,
  "Qxa6": 52212,
  "Qxa6#": 52385,
  "Qxa6+": 52901,
  "Qxa7": 53312,
  "Qxa7#": 50982,
  "Qxa7+": 51796,
  "Qxa8": 50601,
  "Qxa8#": 52897,
  "Qxa8+": 52113,
  "Qxb1": 50783,
  "Qxb1#": 50338,
  "Qxb1+": 53369,
  "Qxb2": 53852,
  "Qxb2#": 51301,
  "Qxb2+": 51676,
  "Qxb3": 53901,
  "Qxb3+": 52054,
  "Qxb4": 52109,
  "Qxb4#": 50741,
  "Qxb4+": 53491,
  "Qxb5": 50399,
  "Qxb5#": 50970,
  "Qxb5+": 52760,
  "Qxb6": 50370,
  "Qxb6+": 50697,
  "Qxb7": 50463,
  "Qxb7+": 52684,
  "Qxb8": 50427,
  "Qxb8#": 50811,
  "Qxb8+": 52267,
  "Qxc1": 52698,
  "Qxc1+": 51763,
  "Qxc2": 52549,
  "Qxc2#": 53900,
  "Qxc2+": 52712,
  "Qxc3": 53232,
  "Qxc3#": 53133,
  "Qxc3+": 52820,
  "Qxc4": 51491,
  "Qxc4+": 52896,
  "Qxc5": 52441,
  "Qxc5#": 51097,
  "Qxc5+": 53243,
  "Qxc6": 51627,
  "Qxc6#": 52106,
  "Qxc6+": 52144,
  "Qxc7": 51631,
  "Qxc7#": 53428,
  "Qxc7+": 53547,
  "Qxc8": 52467,
  "Qxc8#": 52068,
  "Qxc8+": 51269,
  "Qxd1": 50483,
  "Qxd1#": 53379,
  "Qxd1+": 51736,
  "Qxd2": 52978,
  "Qxd2#": 51972,
  "Qxd2+": 52304,
  "Qxd3": 52432,
  "Qxd3+": 51866,
  "Qxd4": 52347,
  "Qxd4#": 52850,
  "Qxd4+": 51445,
  "Qxd5": 53051,
  "Qxd5+": 52087,
  "Qxd6": 51903,
  "Qxd6#": 51643,
  "Qxd6+": 51292,
  "Qxd7": 53763,
  "Qxd7#": 51753,
  "Qxd7+": 51625,
  "Qxd8": 50294,
  "Qxd8#": 53007,
  "Qxd8+": 52546,
  "Qxe1": 51756,
  "Qxe1#": 52690,
  "Qxe1+": 50589,
  "Qxe2": 50564,
  "Qxe2#": 52539,
  "Qxe2+": 53830,
  "Qxe3": 50384,
  "Qxe3#": 50500,
  "Qxe3+": 53456,
  "Qxe4": 50321,
  "Qxe4#": 51803,
  "Qxe4+": 53365,
  "Qxe5": 53574,
  "Qxe5#": 50829,
  "Qxe5+": 53097,
  "Qxe6": 52916,
  "Qxe6+": 51685,
  "Qxe7": 52147,
  "Qxe7#": 52598,
  "Qxe7+": 50647,
  "Qxe8": 50351,
  "Qxe8#": 53673,
  "Qxe8+": 52648,
  "Qxf1": 53458,
  "Qxf1#": 51428,
  "Qxf1+": 51782,
  "Qxf2": 50405,
  "Qxf2#": 51488,
  "Qxf2+": 52606,
  "Qxf3": 53146,
  "Qxf3#": 50633,
  "Qxf3+": 53791,
  "Qxf4": 51341,
  "Qxf4#": 50460,
  "Qxf4+": 53350,
  "Qxf5": 52095,
  "Qxf5#": 53047,
  "Qxf5+": 50886,
  "Qxf6": 52689,
  "Qxf6#": 52609,
  "Qxf6+": 52611,
  "Qxf7": 52748,
  "Qxf7#": 53181,
  "Qxf7+": 51327,
  "Qxf8": 51377,
  "Qxf8#": 51107,
  "Qxf8+": 53701,
  "Qxg1": 51709,
  "Qxg1#": 53213,
  "Qxg1+": 51534,
  "Qxg2": 53229,
  "Qxg2#": 53728,
  "Qxg2+": 51507,
  "Qxg3": 51853,
  "Qxg3#": 53235,
  "Qxg3+": 51066,
  "Qxg4": 51632,
  "Qxg4#": 53737,
  "Qxg4+": 53650,
  "Qxg5": 52084,
  "Qxg5#": 53517,
  "Qxg5+": 51497,
  "Qxg6": 50505,
  "Qxg6#": 52718,
  "Qxg6+": 50591,
  "Qxg7": 51846,
  "Qxg7#": 53894,
  "Qxg7+": 51918,
  "Qxg8": 52024,
  "Qxg8#": 52845,
  "Qxg8+": 50849,
  "Qxh1": 51299,
  "Qxh1+": 50642,
  "Qxh2": 50885,
  "Qxh2#": 51315,
  "Qxh2+": 52155,
  "Qxh3": 51069,
  "Qxh3#": 53119,
  "Qxh3+": 53333,
  "Qxh4": 52797,
  "Qxh4+": 51272,
  "Qxh5": 52152,
  "Qxh5#": 50752,
  "Qxh5+": 51569,
  "Qxh6": 50419,
  "Qxh6#": 53567,
  "Qxh6+": 53309,
  "Qxh7": 53203,
  "Qxh7#": 52827,
  "Qxh7+": 52480,
  "Qxh8": 50408,
  "Qxh8+": 50805,
  "Ra1": 53095,
  "Ra1#": 53641,
  "Ra1+": 52970,
  "Ra1a2": 52062,
  "Ra2": 50738,
  "Ra2#": 50296,
  "Ra2+": 50770,
  "Ra2a1": 51951,
  "Ra2a1#": 52891,
  "Ra2a3": 52158,
  "Ra2a3+": 51143,
  "Ra2a5": 51926,
  "Ra2a7": 53726,
  "Ra2a7+": 51170,
  "Ra2a8": 53116,
  "Ra2xa3": 52612,
  "Ra2xa4": 53178,
  "Ra2xa5": 51198,
  "Ra2xa6": 51402,
  "Ra2xa8": 53773,
  "Ra3": 51246,
  "Ra3#": 52555,
  "Ra3+": 51134,
  "Ra3a2": 52526,
  "Ra3a2+": 53669,
  "Ra3xa2": 53909,
  "Ra3xa2+": 53361,
  "Ra3xa4": 53746,
  "Ra3xa5": 53625,
  "Ra3xa6": 53807,
  "Ra3xa7": 52345,
  "Ra4": 53769,
  "Ra4#": 52674,
  "Ra4+": 51818,
  "Ra4a3": 50979,
  "Ra4a6": 52061,
  "Ra4a8": 52350,
  "Ra4xa2": 52531,
  "Ra4xa5": 52188,
  "Ra5": 51271,
  "Ra5+": 52241,
  "Ra5a2": 52499,
  "Ra5a6": 50444,
  "Ra5a8": 52720,
  "Ra5xa1": 52525,
  "Ra5xa2": 52638,
  "Ra5xa2+": 52996,
  "Ra5xa3": 53321,
  "Ra5xa4": 50547,
  "Ra5xa6+": 50828,
  "Ra6": 52666,
  "Ra6#": 52299,
  "Ra6+": 52474,
  "Ra6a2": 51551,
  "Ra6a3+": 51587,
  "Ra6a7": 51031,
  "Ra6a8": 51265,
  "Ra6xa1": 52668,
  "Ra6xa3": 52047,
  "Ra6xa5": 51978,
  "Ra7": 50313,
  "Ra7#": 50578,
  "Ra7+": 52393,
  "Ra7a4": 53868,
  "Ra7a8": 50755,
  "Ra7xa5": 50664,
  "Ra8": 50884,
  "Ra8#": 52955,
  "Ra8+": 53856,
  "Ra8a2": 52731,
  "Ra8a3": 51281,
  "Ra8a3#": 50798,
  "Ra8a5": 53570,
  "Ra8a6": 50332,
  "Ra8a7": 53332,
  "Raa1": 51674,
  "Raa2": 51793,
  "Raa3": 53537,
  "Raa5": 51501,
  "Raa6": 52491,
  "Raa7": 50383,
  "Raa8": 52049,
  "Rab1": 51922,
  "Rab1+": 50813,
  "Rab2": 53160,
  "Rab3": 52619,
  "Rab5": 50308,
  "Rab6": 52380,
  "Rab7": 52013,
  "Rab8": 53023,
  "Rab8+": 53078,
  "Rac1": 52195,
  "Rac1+": 50870,
  "Rac2": 53774,
  "Rac4": 51095,
  "Rac6": 50429,
  "Rac7": 52741,
  "Rac7#": 51663,
  "Rac8": 53424,
  "Rac8+": 52438,
  "Rad1": 51762,
  "Rad1+": 53479,
  "Rad2": 52398,
  "Rad3": 52440,
  "Rad7": 50701,
  "Rad8": 53804,
  "Rad8+": 51817,
  "Rae1": 53586,
  "Rae1+": 53105,
  "Rae2+": 53171,
  "Rae3": 50543,
  "Rae7": 52735,
  "Rae8": 53435,
  "Rae8+": 53282,
  "Raf1": 50479,
  "Raf1+": 52950,
  "Raf2": 52325,
  "Raf3": 51907,
  "Raf4": 53893,
  "Raf7": 50556,
  "Raf8": 53398,
  "Rag1": 52169,
  "Rag3+": 52751,
  "Rag5": 52388,
  "Rag8": 52037,
  "Rag8+": 52105,
  "Rah1": 53134,
  "Rah2": 50471,
  "Rah6": 51851,
  "Rah8": 53113,
  "Raxa4": 52872,
  "Raxa6": 53753,
  "Raxa7": 50726,
  "Raxb1": 52641,
  "Raxb6": 50873,
  "Raxb8": 50852,
  "Raxc1": 50477,
  "Raxc2": 50392,
  "Raxc8": 52442,
  "Raxd1": 52755,
  "Raxd2": 51318,
  "Raxd8": 51447,
  "Raxe1": 52454,
  "Raxe2": 51189,
  "Raxe3": 52290,
  "Raxe5": 52312,
  "Raxe7": 52952,
  "Raxe8": 52066,
  "Raxf5": 50661,
  "Raxf8": 52114,
  "Rb1": 53377,
  "Rb1#": 52824,
  "Rb1+": 50385,
  "Rb1b2": 52000,
  "Rb1b3": 52173,
  "Rb1b4": 53205,
  "Rb1b6": 52324,
  "Rb1b7": 53071,
  "Rb1b7+": 50868,
  "Rb1xb5": 52305,
  "Rb2": 52782,
  "Rb2+": 50318,
  "Rb2b1": 53635,
  "Rb2b1+": 53581,
  "Rb2b3": 51602,
  "Rb2b5": 51181,
  "Rb2b8+": 51388,
  "Rb2xb1+": 53730,
  "Rb2xb3": 52589,
  "Rb2xb5": 53121,
  "Rb2xb6": 50928,
  "Rb2xb7": 53314,
  "Rb3": 51981,
  "Rb3+": 50794,
  "Rb3b1": 50330,
  "Rb3b2": 52010,
  "Rb3b2+": 52023,
  "Rb3b4": 53110,
  "Rb3b5": 52221,
  "Rb3b7": 53002,
  "Rb3xb2": 52725,
  "Rb3xb2+": 50605,
  "Rb3xb6": 52004,
  "Rb3xb8": 50381,
  "Rb4": 52832,
  "Rb4#": 52634,
  "Rb4+": 52101,
  "Rb4b1": 52998,
  "Rb4b3": 50341,
  "Rb4b5": 52915,
  "Rb4b8": 50409,
  "Rb4xb2+": 51489,
  "Rb4xb3": 50518,
  "Rb4xb6": 53816,
  "Rb4xb7": 50844,
  "Rb5": 51288,
  "Rb5+": 53073,
  "Rb5b3": 52283,
  "Rb5b7": 50592,
  "Rb5xb2": 53017,
  "Rb5xb3+": 51712,
  "Rb5xb6": 50538,
  "Rb6": 50672,
  "Rb6+": 50388,
  "Rb6b4": 53245,
  "Rb6b5+": 50372,
  "Rb6b7": 52651,
  "Rb6b7+": 50590,
  "Rb6xb3": 51316,
  "Rb6xb5": 51359,
  "Rb6xb7": 51836,
  "Rb7": 51242,
  "Rb7+": 53885,
  "Rb7b1": 52331,
  "Rb7b2": 52541,
  "Rb7b3": 51968,
  "Rb7b4": 50871,
  "Rb7b5": 52862,
  "Rb7b6": 53123,
  "Rb7b8": 53645,
  "Rb7b8+": 50344,
  "Rb7xb2": 50269,
  "Rb7xb2+": 52903,
  "Rb8": 53437,
  "Rb8#": 52842,
  "Rb8+": 53338,
  "Rb8b2+": 50597,
  "Rb8b3": 51408,
  "Rb8b4": 50815,
  "Rb8b4+": 52359,
  "Rb8b7": 51997,
  "Rb8xb4": 52853,
  "Rb8xb6": 51615,
  "Rba1": 50506,
  "Rba2": 51443,
  "Rba3": 50679,
  "Rba4": 50329,
  "Rba6": 51967,
  "Rba7": 50941,
  "Rba8": 51684,
  "Rba8+": 52682,
  "Rbb1": 50364,
  "Rbb2": 52196,
  "Rbb3": 53656,
  "Rbb4": 51460,
  "Rbb5": 50484,
  "Rbb6": 52660,
  "Rbb7": 52516,
  "Rbb8": 51136,
  "Rbc1": 53308,
  "Rbc1+": 51585,
  "Rbc2": 50277,
  "Rbc3": 52599,
  "Rbc3+": 53805,
  "Rbc4": 51745,
  "Rbc5": 53862,
  "Rbc6": 50691,
  "Rbc7": 51293,
  "Rbc7+": 51771,
  "Rbc8": 52272,
  "Rbd1": 53687,
  "Rbd2": 53870,
  "Rbd3": 50703,
  "Rbd3+": 53292,
  "Rbd4": 51313,
  "Rbd5": 52050,
  "Rbd6": 52500,
  "Rbd7": 50856,
  "Rbd8": 52889,
  "Rbd8+": 52709,
  "Rbe1": 53299,
  "Rbe2": 51883,
  "Rbe3": 53549,
  "Rbe5": 51785,
  "Rbe8": 53770,
  "Rbf1": 52168,
  "Rbf2": 53346,
  "Rbf4": 51905,
  "Rbf4+": 53760,
  "Rbf8": 52778,
  "Rbg1": 52009,
  "Rbg2+": 50859,
  "Rbg6": 50720,
  "Rbg7+": 50640,
  "Rbg8": 52471,
  "Rbh1": 51592,
  "Rbh8": 51208,
  "Rbxa6": 51438,
  "Rbxa7": 50514,
  "Rbxa7+": 52677,
  "Rbxb2+": 50287,
  "Rbxb3": 51535,
  "Rbxb3+": 51165,
  "Rbxb4": 50850,
  "Rbxb5": 51426,
  "Rbxb7": 52073,
  "Rbxc1": 52501,
  "Rbxc2": 50452,
  "Rbxc4": 50690,
  "Rbxc5": 51624,
  "Rbxc8": 51061,
  "Rbxd1": 53066,
  "Rbxd5": 51238,
  "Rbxd5+": 53475,
  "Rbxf7+": 53626,
  "Rbxh1": 52985,
  "Rc1": 53208,
  "Rc1#": 52507,
  "Rc1+": 51057,
  "Rc1c2": 53779,
  "Rc1c2+": 52284,
  "Rc1c6": 53278,
  "Rc1c7": 51252,
  "Rc1xc5": 50648,
  "Rc2": 50734,
  "Rc2+": 50858,
  "Rc2c1+": 50565,
  "Rc2c3": 52362,
  "Rc2c4": 50908,
  "Rc2c6": 51406,
  "Rc2c7": 51400,
  "Rc2c7+": 52353,
  "Rc2c8": 50786,
  "Rc2xc4": 53550,
  "Rc2xc5": 53727,
  "Rc2xc6": 53808,
  "Rc2xc6+": 51259,
  "Rc2xc7": 51715,
  "Rc2xc8": 50932,
  "Rc2xc8+": 53668,
  "Rc3": 52452,
  "Rc3+": 53693,
  "Rc3c1+": 52789,
  "Rc3c2": 53249,
  "Rc3c4+": 51210,
  "Rc3c5": 53732,
  "Rc3c6": 52379,
  "Rc3c7": 53182,
  "Rc3c8": 50666,
  "Rc3xc2": 51758,
  "Rc3xc4": 50744,
  "Rc3xc5": 52849,
  "Rc3xc6": 53100,
  "Rc3xc7": 53827,
  "Rc4": 53120,
  "Rc4#": 51929,
  "Rc4+": 50906,
  "Rc4c1+": 52643,
  "Rc4c2": 53876,
  "Rc4c3+": 51296,
  "Rc4c5": 52282,
  "Rc4c6": 51734,
  "Rc4c7": 53492,
  "Rc4xc1+": 50274,
  "Rc4xc3": 50643,
  "Rc4xc7": 52199,
  "Rc5": 51923,
  "Rc5+": 50736,
  "Rc5c2": 53405,
  "Rc5c4": 53689,
  "Rc5c7": 53429,
  "Rc5c7+": 53290,
  "Rc5xc2": 52913,
  "Rc5xc3": 51505,
  "Rc5xc4": 51636,
  "Rc5xc8": 53784,
  "Rc5xc8+": 50629,
  "Rc6": 51975,
  "Rc6+": 51200,
  "Rc6c1": 51671,
  "Rc6c1+": 53513,
  "Rc6c2+": 53370,
  "Rc6c3": 51158,
  "Rc6c4": 53685,
  "Rc6c5": 53903,
  "Rc6c7": 52213,
  "Rc6c8": 53010,
  "Rc6c8+": 50966,
  "Rc6xc3": 53607,
  "Rc6xc7": 53715,
  "Rc6xc7+": 51801,
  "Rc6xc8": 50552,
  "Rc7": 52011,
  "Rc7+": 52900,
  "Rc7c1+": 52584,
  "Rc7c2": 53872,
  "Rc7c3": 53265,
  "Rc7c4": 53772,
  "Rc7c5": 50909,
  "Rc7c6": 53841,
  "Rc7c8": 51133,
  "Rc7c8+": 52655,
  "Rc7xc2": 53221,
  "Rc7xc2+": 50404,
  "Rc7xc3": 52053,
  "Rc7xc4": 52971,
  "Rc7xc5": 51700,
  "Rc7xc8": 52714,
  "Rc8": 51075,
  "Rc8#": 53219,
  "Rc8+": 52175,
  "Rc8c2": 52535,
  "Rc8c3": 51434,
  "Rc8c3+": 51306,
  "Rc8c4": 51678,
  "Rc8c5": 53476,
  "Rc8c6": 52007,
  "Rc8c7": 51228,
  "Rc8xc2": 50595,
  "Rc8xc7": 53383,
  "Rca1": 53487,
  "Rca2": 50994,
  "Rca3": 50820,
  "Rca4": 52703,
  "Rca5": 53608,
  "Rca5+": 50757,
  "Rca7": 52616,
  "Rca8": 50835,
  "Rca8+": 52799,
  "Rcb1": 51083,
  "Rcb1+": 53022,
  "Rcb2": 51203,
  "Rcb2+": 50897,
  "Rcb3": 50621,
  "Rcb3+": 52629,
  "Rcb4": 51127,
  "Rcb7": 50422,
  "Rcb7+": 52543,
  "Rcb8": 53111,
  "Rcc1": 50963,
  "Rcc2": 50389,
  "Rcc3": 53622,
  "Rcc4": 53226,
  "Rcc5": 50615,
  "Rcc6": 50610,
  "Rcc7": 51298,
  "Rcc8": 53031,
  "Rcd1": 51456,
  "Rcd1+": 53691,
  "Rcd2": 52329,
  "Rcd2+": 53510,
  "Rcd3": 51512,
  "Rcd3+": 52702,
  "Rcd5": 51295,
  "Rcd6": 53556,
  "Rcd7": 51080,
  "Rcd8": 51389,
  "Rcd8+": 51422,
  "Rce1": 53657,
  "Rce1+": 51369,
  "Rce2": 53660,
  "Rce4": 52585,
  "Rce5": 51822,
  "Rce6": 51130,
  "Rce7": 51173,
  "Rce7+": 53246,
  "Rce8": 53372,
  "Rce8+": 51374,
  "Rcf1": 53798,
  "Rcf2": 53509,
  "Rcf3": 53575,
  "Rcf6": 51002,
  "Rcf7": 51738,
  "Rcf8": 52957,
  "Rcg1": 51250,
  "Rcg2": 51380,
  "Rcg2+": 50356,
  "Rcg7+": 51023,
  "Rcg8": 53118,
  "Rch1": 52664,
  "Rch8": 50837,
  "Rcxa1": 52366,
  "Rcxa3": 51694,
  "Rcxa7": 53649,
  "Rcxb3": 53257,
  "Rcxb5": 53735,
  "Rcxb5+": 53072,
  "Rcxb6": 52133,
  "Rcxb7": 51844,
  "Rcxc2": 50719,
  "Rcxc3": 51669,
  "Rcxc3+": 52416,
  "Rcxc6": 50727,
  "Rcxc6+": 53723,
  "Rcxc7": 53199,
  "Rcxc7+": 53578,
  "Rcxd1": 51838,
  "Rcxd6": 52818,
  "Rcxd7+": 52987,
  "Rcxd8": 52487,
  "Rcxe2": 52775,
  "Rcxe5": 52041,
  "Rcxe6": 50386,
  "Rcxf2": 50324,
  "Rcxf3": 50549,
  "Rcxf4": 52608,
  "Rcxf6+": 52841,
  "Rcxf7": 53654,
  "Rcxf8": 52397,
  "Rcxg7+": 51557,
  "Rcxh2": 50724,
  "Rd1": 51652,
  "Rd1#": 53186,
  "Rd1+": 51314,
  "Rd1d2": 53825,
  "Rd1d3": 53672,
  "Rd1d3+": 51197,
  "Rd1d4": 53826,
  "Rd1d4#": 52019,
  "Rd1d5": 52581,
  "Rd1d6+": 53410,
  "Rd1d7": 52877,
  "Rd1d7#": 52785,
  "Rd1xd3": 53261,
  "Rd2": 53525,
  "Rd2+": 51093,
  "Rd2d1": 53225,
  "Rd2d1+": 50526,
  "Rd2d3": 51317,
  "Rd2d4": 50559,
  "Rd2d6": 51556,
  "Rd2d7+": 52700,
  "Rd2d8": 52043,
  "Rd2d8+": 53287,
  "Rd2xd1+": 51188,
  "Rd2xd3": 50747,
  "Rd2xd4": 53234,
  "Rd2xd5": 51871,
  "Rd2xd6": 53911,
  "Rd2xd7+": 52030,
  "Rd2xd8+": 53802,
  "Rd3": 53734,
  "Rd3#": 50654,
  "Rd3+": 51384,
  "Rd3d2": 51623,
  "Rd3d2+": 51919,
  "Rd3d4": 51016,
  "Rd3d5": 53520,
  "Rd3d6": 52387,
  "Rd3d7": 51581,
  "Rd3xd2": 53271,
  "Rd3xd2+": 52829,
  "Rd3xd4": 53914,
  "Rd3xd5": 53697,
  "Rd3xd7": 53486,
  "Rd3xd7+": 52309,
  "Rd3xd8": 51249,
  "Rd4": 51639,
  "Rd4#": 52180,
  "Rd4+": 53021,
  "Rd4d1": 53272,
  "Rd4d2": 53534,
  "Rd4d2#": 52130,
  "Rd4d3": 50951,
  "Rd4d5": 50493,
  "Rd4d5+": 50577,
  "Rd4d6": 51280,
  "Rd4d7+": 51258,
  "Rd4d8": 50793,
  "Rd4d8+": 53150,
  "Rd4xd1": 51462,
  "Rd4xd3": 52817,
  "Rd4xd5": 51073,
  "Rd4xd6": 51433,
  "Rd4xd6+": 52642,
  "Rd4xd8": 52018,
  "Rd4xd8+": 50558,
  "Rd5": 52179,
  "Rd5+": 53277,
  "Rd5d1": 53752,
  "Rd5d1+": 53144,
  "Rd5d2": 50279,
  "Rd5d3": 53362,
  "Rd5d4": 50508,
  "Rd5d6": 50331,
  "Rd5d6+": 51692,
  "Rd5d7": 51276,
  "Rd5d7+": 50748,
  "Rd5d8+": 50887,
  "Rd5xd2": 51500,
  "Rd5xd3": 53259,
  "Rd5xd4": 52693,
  "Rd5xd6": 53439,
  "Rd5xd7": 52932,
  "Rd5xd8": 53328,
  "Rd6": 50349,
  "Rd6+": 53067,
  "Rd6d1": 51865,
  "Rd6d2": 53707,
  "Rd6d4": 50742,
  "Rd6d5": 50353,
  "Rd6d7": 51213,
  "Rd6d7+": 52623,
  "Rd6d8": 51379,
  "Rd6d8+": 51650,
  "Rd6xd1": 52694,
  "Rd6xd3": 50472,
  "Rd6xd4": 51342,
  "Rd6xd5": 52002,
  "Rd6xd7+": 51055,
  "Rd6xd8+": 52562,
  "Rd7": 51947,
  "Rd7#": 53409,
  "Rd7+": 51029,
  "Rd7d2": 51308,
  "Rd7d2+": 51227,
  "Rd7d3": 53750,
  "Rd7d3+": 50512,
  "Rd7d4": 52860,
  "Rd7d4+": 51067,
  "Rd7d5": 50669,
  "Rd7d6": 51229,
  "Rd7d6+": 51852,
  "Rd7d8": 53722,
  "Rd7d8+": 51163,
  "Rd7xd1": 53829,
  "Rd7xd1+": 52161,
  "Rd7xd2": 50743,
  "Rd7xd3": 52372,
  "Rd7xd4": 51713,
  "Rd7xd5": 50420,
  "Rd7xd5+": 50899,
  "Rd7xd6": 51993,
  "Rd7xd8+": 52615,
  "Rd8": 52251,
  "Rd8#": 53242,
  "Rd8+": 53521,
  "Rd8d2+": 51885,
  "Rd8d3": 52663,
  "Rd8d4": 52839,
  "Rd8d5": 53857,
  "Rd8d6": 51511,
  "Rd8d6+": 52661,
  "Rd8d7": 50299,
  "Rd8xd4": 50362,
  "Rd8xd7": 52230,
  "Rda1": 50968,
  "Rda1+": 50342,
  "Rda2": 53251,
  "Rda3": 52532,
  "Rda6": 50280,
  "Rda8": 52121,
  "Rdb1": 51869,
  "Rdb2": 52333,
  "Rdb3": 52757,
  "Rdb7": 50528,
  "Rdb8": 50562,
  "Rdb8+": 52428,
  "Rdc1": 50775,
  "Rdc1+": 52888,
  "Rdc2": 53368,
  "Rdc2+": 52190,
  "Rdc3": 50824,
  "Rdc3+": 51735,
  "Rdc5": 52231,
  "Rdc6": 53353,
  "Rdc7": 51166,
  "Rdc7#": 50583,
  "Rdc8": 53141,
  "Rdd1": 51363,
  "Rdd2": 51092,
  "Rdd3": 50933,
  "Rdd4": 51192,
  "Rdd6": 52855,
  "Rdd7": 53363,
  "Rdd8": 52064,
  "Rde1": 53407,
  "Rde1+": 53809,
  "Rde2": 50297,
  "Rde3": 50433,
  "Rde4": 53481,
  "Rde6": 51442,
  "Rde7": 52191,
  "Rde7+": 52465,
  "Rde8": 51515,
  "Rdf1": 50922,
  "Rdf1+": 52402,
  "Rdf2": 52206,
  "Rdf2+": 51393,
  "Rdf3": 53557,
  "Rdf4": 51451,
  "Rdf5": 52756,
  "Rdf6": 53005,
  "Rdf7": 52419,
  "Rdf8": 53449,
  "Rdf8+": 51703,
  "Rdg1": 53915,
  "Rdg1+": 53089,
  "Rdg2": 50447,
  "Rdg2#": 51811,
  "Rdg7#": 52498,
  "Rdg8": 50272,
  "Rdg8+": 51797,
  "Rdh1": 52247,
  "Rdh2": 52962,
  "Rdh2#": 53588,
  "Rdh2+": 50301,
  "Rdh5": 51665,
  "Rdh7": 53376,
  "Rdh8": 50987,
  "Rdxa2": 52005,
  "Rdxa5": 51297,
  "Rdxa7+": 52673,
  "Rdxb8": 50961,
  "Rdxc1": 52446,
  "Rdxc2": 50347,
  "Rdxc3": 52811,
  "Rdxc5": 53806,
  "Rdxc5+": 50785,
  "Rdxc6": 51450,
  "Rdxc7": 53615,
  "Rdxc7+": 51371,
  "Rdxc8": 51237,
  "Rdxd1": 51635,
  "Rdxd3": 53776,
  "Rdxd5": 52178,
  "Rdxd6": 52481,
  "Rdxd7": 52587,
  "Rdxd7+": 51622,
  "Rdxe1": 51510,
  "Rdxe2": 51373,
  "Rdxe3": 52837,
  "Rdxe4": 51659,
  "Rdxe5": 51726,
  "Rdxe8": 52762,
  "Rdxf1": 51283,
  "Rdxf2": 53729,
  "Rdxf8+": 52042,
  "Rdxg2+": 53682,
  "Re1": 51392,
  "Re1#": 52443,
  "Re1+": 52286,
  "Re1e2": 51273,
  "Re1e3": 51985,
  "Re1e4": 51565,
  "Re1e4+": 51728,
  "Re1e5": 51939,
  "Re1e6": 50955,
  "Re1e6+": 52723,
  "Re1e7": 52118,
  "Re1e7+": 52784,
  "Re1xe3": 53169,
  "Re1xe4": 50609,
  "Re1xe6": 50864,
  "Re1xe6+": 51934,
  "Re2": 53145,
  "Re2#": 50825,
  "Re2+": 53568,
  "Re2e1": 53220,
  "Re2e1+": 52124,
  "Re2e3": 51441,
  "Re2e3+": 52518,
  "Re2e4": 53609,
  "Re2e5": 51287,
  "Re2e6": 51973,
  "Re2e7": 52488,
  "Re2e8+": 52119,
  "Re2xe1": 53297,
  "Re2xe1+": 50527,
  "Re2xe3": 52174,
  "Re2xe4": 50812,
  "Re2xe5": 52420,
  "Re2xe6": 51789,
  "Re2xe6+": 53444,
  "Re2xe8": 51506,
  "Re2xe8+": 52809,
  "Re3": 53349,
  "Re3+": 52289,
  "Re3e1": 53592,
  "Re3e1+": 50838,
  "Re3e2": 50613,
  "Re3e4": 52368,
  "Re3e6": 53555,
  "Re3e7": 53652,
  "Re3e8+": 51819,
  "Re3xe1": 52808,
  "Re3xe2+": 51424,
  "Re3xe4": 53393,
  "Re3xe5": 50695,
  "Re3xe6": 51423,
  "Re3xe6+": 50309,
  "Re3xe8+": 50728,
  "Re4": 51761,
  "Re4#": 53412,
  "Re4+": 50355,
  "Re4e1": 51710,
  "Re4e1+": 51191,
  "Re4e2": 53385,
  "Re4e3": 50400,
  "Re4e5": 51545,
  "Re4e6": 50773,
  "Re4e6+": 53651,
  "Re4e7": 50536,
  "Re4e7+": 53463,
  "Re4e8+": 53584,
  "Re4xe3": 53057,
  "Re4xe3+": 50948,
  "Re4xe5": 53778,
  "Re4xe6": 52965,
  "Re4xe7": 50921,
  "Re5": 53516,
  "Re5#": 51768,
  "Re5+": 52264,
  "Re5e1+": 50969,
  "Re5e3": 53854,
  "Re5e6": 50903,
  "Re5e7": 51157,
  "Re5e7+": 51944,
  "Re5xe1": 50571,
  "Re5xe1+": 52830,
  "Re5xe2": 50843,
  "Re5xe2+": 50882,
  "Re5xe3+": 51779,
  "Re5xe4": 51880,
  "Re5xe6": 53341,
  "Re5xe7": 53451,
  "Re5xe7+": 50325,
  "Re5xe8": 51513,
  "Re5xe8+": 52865,
  "Re6": 51942,
  "Re6+": 53054,
  "Re6e1": 51111,
  "Re6e1+": 50604,
  "Re6e2": 51144,
  "Re6e3": 50375,
  "Re6e4": 52614,
  "Re6e5": 51821,
  "Re6e7": 50833,
  "Re6e7+": 52788,
  "Re6e8": 51164,
  "Re6xe3": 51747,
  "Re6xe5": 53554,
  "Re6xe7": 51486,
  "Re6xe7+": 51081,
  "Re7": 51056,
  "Re7#": 51284,
  "Re7+": 53782,
  "Re7e1+": 52513,
  "Re7e2": 53504,
  "Re7e2+": 53114,
  "Re7e3": 53187,
  "Re7e5": 53677,
  "Re7e6": 52371,
  "Re7e6+": 52261,
  "Re7xe1": 51105,
  "Re7xe1+": 50958,
  "Re7xe2": 52184,
  "Re7xe3": 53211,
  "Re7xe4": 52894,
  "Re7xe4+": 51267,
  "Re7xe6": 50534,
  "Re7xe8+": 50507,
  "Re8": 51465,
  "Re8#": 51908,
  "Re8+": 50377,
  "Re8e2": 51524,
  "Re8e2+": 50722,
  "Re8e4": 50681,
  "Re8e5": 53797,
  "Re8e5+": 50799,
  "Re8e6": 52834,
  "Re8e7": 53161,
  "Re8e7+": 53590,
  "Re8xe7": 50424,
  "Rea1": 52537,
  "Rea3": 52773,
  "Rea7": 53714,
  "Rea8": 50964,
  "Reb1": 53425,
  "Reb1+": 53756,
  "Reb2": 52070,
  "Reb7": 50602,
  "Reb7+": 52100,
  "Reb8": 51998,
  "Reb8+": 50980,
  "Rec1": 53546,
  "Rec2": 52528,
  "Rec3": 52727,
  "Rec5": 52529,
  "Rec6": 50516,
  "Rec7": 53076,
  "Rec8": 52538,
  "Rec8+": 52540,
  "Red1": 53461,
  "Red1+": 50470,
  "Red2": 50894,
  "Red3": 51920,
  "Red4": 52917,
  "Red5": 50904,
  "Red6": 52280,
  "Red7": 53659,
  "Red8": 52764,
  "Red8#": 51362,
  "Red8+": 50984,
  "Ree1": 53468,
  "Ree2": 50541,
  "Ree3": 51691,
  "Ree4": 52752,
  "Ree5": 52626,
  "Ree6": 50866,
  "Ree7": 53082,
  "Ree8": 53418,
  "Ref1": 53595,
  "Ref1+": 53206,
  "Ref2": 53358,
  "Ref3": 51285,
  "Ref6": 53109,
  "Ref7": 52048,
  "Ref7+": 50896,
  "Ref8": 50458,
  "Reg1": 51642,
  "Reg2": 53529,
  "Reg2#": 51386,
  "Reg2+": 51420,
  "Reg3": 51490,
  "Reg5": 51606,
  "Reg6": 51608,
  "Reg7#": 50814,
  "Reg7+": 52364,
  "Reg8": 52451,
  "Reg8+": 51471,
  "Reh1": 52621,
  "Reh3": 52517,
  "Reh4": 52448,
  "Reh5": 52665,
  "Reh8": 50570,
  "Reh8+": 53819,
  "Rexa2": 51216,
  "Rexa7": 53339,
  "Rexb7": 51013,
  "Rexc1": 53293,
  "Rexc2": 50544,
  "Rexc6": 52145,
  "Rexc7": 52422,
  "Rexc8": 50403,
  "Rexd1": 51058,
  "Rexd3": 50834,
  "Rexd4": 52431,
  "Rexd7": 53422,
  "Rexd8": 52649,
  "Rexe2": 51463,
  "Rexe2#": 50900,
  "Rexe2+": 50709,
  "Rexe3": 53262,
  "Rexe4": 52343,
  "Rexe5": 52417,
  "Rexe6": 51800,
  "Rexe7": 52229,
  "Rexf1": 50663,
  "Rexf2+": 52355,
  "Rexf5": 52193,
  "Rexf7": 51024,
  "Rexf7+": 52951,
  "Rexf8": 51390,
  "Rexg2+": 53897,
  "Rexg5": 53600,
  "Rexg6#": 53055,
  "Rexg7": 52265,
  "Rexg7+": 51984,
  "Rexh1": 50800,
  "Rexh7": 53427,
  "Rf1": 51888,
  "Rf1#": 53690,
  "Rf1+": 52171,
  "Rf1f2": 51494,
  "Rf1f3": 53185,
  "Rf1f4": 51078,
  "Rf1f6#": 53075,
  "Rf1f6+": 51696,
  "Rf1xf2": 51106,
  "Rf1xf5": 53873,
  "Rf2": 50696,
  "Rf2#": 51891,
  "Rf2+": 50357,
  "Rf2f1+": 52520,
  "Rf2f3": 50418,
  "Rf2f4": 51300,
  "Rf2f6": 50599,
  "Rf2f6+": 53508,
  "Rf2f7+": 50396,
  "Rf2f8+": 50923,
  "Rf2xf1+": 50532,
  "Rf2xf4": 50791,
  "Rf2xf6": 52102,
  "Rf2xf7": 53356,
  "Rf2xf7+": 53175,
  "Rf2xf8": 53757,
  "Rf2xf8+": 50618,
  "Rf3": 50317,
  "Rf3#": 52074,
  "Rf3+": 53851,
  "Rf3f1+": 50282,
  "Rf3f2": 51523,
  "Rf3f2+": 51461,
  "Rf3f4": 51759,
  "Rf3f4+": 51595,
  "Rf3f6": 53247,
  "Rf3f7": 52323,
  "Rf3xf2": 50288,
  "Rf3xf2+": 53561,
  "Rf3xf6": 53764,
  "Rf3xf7": 53154,
  "Rf3xf7+": 52444,
  "Rf4": 51468,
  "Rf4+": 51931,
  "Rf4f1": 51243,
  "Rf4f1+": 52132,
  "Rf4f2": 53535,
  "Rf4f2+": 52997,
  "Rf4f3": 53102,
  "Rf4f3+": 51940,
  "Rf4f5": 53285,
  "Rf4f5+": 50582,
  "Rf4f6": 53032,
  "Rf4f7": 50495,
  "Rf4f7+": 50523,
  "Rf4xf3": 52263,
  "Rf4xf3+": 52197,
  "Rf4xf7": 50782,
  "Rf5": 52508,
  "Rf5+": 51481,
  "Rf5f2": 52276,
  "Rf5f3": 53482,
  "Rf5f4": 53157,
  "Rf5f6": 51204,
  "Rf5f6+": 51035,
  "Rf5f7": 50671,
  "Rf5xf2": 53404,
  "Rf5xf3": 53506,
  "Rf5xf4": 52637,
  "Rf5xf6": 50451,
  "Rf5xf7": 50749,
  "Rf6": 53775,
  "Rf6#": 52103,
  "Rf6+": 51241,
  "Rf6f3": 51126,
  "Rf6f4": 53638,
  "Rf6f5": 53197,
  "Rf6f7": 50693,
  "Rf6xf1": 53090,
  "Rf6xf2": 50713,
  "Rf6xf3": 50326,
  "Rf7": 52495,
  "Rf7#": 52813,
  "Rf7+": 51816,
  "Rf7f2+": 50286,
  "Rf7f3": 53149,
  "Rf7f3+": 53255,
  "Rf7f4": 53695,
  "Rf7f5": 51881,
  "Rf7f6": 53274,
  "Rf7f8": 50750,
  "Rf7f8#": 52075,
  "Rf7f8+": 53355,
  "Rf7xf2": 53450,
  "Rf7xf2+": 51994,
  "Rf7xf3": 51385,
  "Rf7xf4": 51304,
  "Rf7xf5": 50898,
  "Rf7xf6": 53472,
  "Rf8": 51102,
  "Rf8#": 53818,
  "Rf8+": 53585,
  "Rf8f2+": 50346,
  "Rf8f3": 52597,
  "Rf8f5": 53526,
  "Rf8f7": 51698,
  "Rfa1": 51020,
  "Rfa2": 51781,
  "Rfa3": 53751,
  "Rfa7": 51858,
  "Rfa8": 50759,
  "Rfb1": 50551,
  "Rfb1#": 52710,
  "Rfb1+": 53103,
  "Rfb2": 53890,
  "Rfb3": 53632,
  "Rfb5": 52920,
  "Rfb7+": 52271,
  "Rfb8": 53696,
  "Rfc1": 52786,
  "Rfc1+": 52505,
  "Rfc2": 51561,
  "Rfc2+": 53758,
  "Rfc6": 51711,
  "Rfc7+": 52418,
  "Rfc8": 52603,
  "Rfd1": 50725,
  "Rfd1+": 50517,
  "Rfd2": 51628,
  "Rfd3": 51270,
  "Rfd4": 53058,
  "Rfd6": 53004,
  "Rfd7": 51604,
  "Rfd8": 50836,
  "Rfd8+": 51340,
  "Rfe1": 53473,
  "Rfe1+": 53496,
  "Rfe2": 53530,
  "Rfe3": 51716,
  "Rfe4+": 51894,
  "Rfe6": 52063,
  "Rfe7": 53627,
  "Rfe8": 51807,
  "Rfe8+": 51277,
  "Rff1": 52382,
  "Rff2": 53883,
  "Rff3": 51945,
  "Rff4": 52838,
  "Rff5": 51372,
  "Rff6": 50310,
  "Rff7": 53648,
  "Rff8": 51912,
  "Rfg1": 52594,
  "Rfg1+": 51788,
  "Rfg2": 51233,
  "Rfg2+": 52447,
  "Rfg3": 53414,
  "Rfg4": 53241,
  "Rfg5+": 53172,
  "Rfg6": 51925,
  "Rfg6+": 52198,
  "Rfg7": 51520,
  "Rfg7+": 50275,
  "Rfg8": 53028,
  "Rfg8+": 51813,
  "Rfh1": 52186,
  "Rfh1+": 51444,
  "Rfh2": 50292,
  "Rfh3": 53639,
  "Rfh5": 51264,
  "Rfh7": 52044,
  "Rfh7+": 53538,
  "Rfh8": 51323,
  "Rfxb6": 50751,
  "Rfxb7": 51835,
  "Rfxc1": 53227,
  "Rfxc7+": 51381,
  "Rfxc8": 51791,
  "Rfxd1": 51870,
  "Rfxd2+": 50522,
  "Rfxd7+": 50704,
  "Rfxd8": 53630,
  "Rfxd8+": 53389,
  "Rfxe1": 52729,
  "Rfxe6+": 53849,
  "Rfxe8": 50614,
  "Rfxf2": 50619,
  "Rfxf2+": 52687,
  "Rfxf3": 51733,
  "Rfxf3#": 51446,
  "Rfxf5": 51704,
  "Rfxf7": 51833,
  "Rfxg1": 50889,
  "Rfxg2": 53258,
  "Rfxg2+": 53041,
  "Rfxg5+": 51626,
  "Rfxg6": 52274,
  "Rfxg6+": 50991,
  "Rfxg7": 53896,
  "Rfxg7+": 51196,
  "Rfxh2": 52036,
  "Rfxh6": 53096,
  "Rfxh7+": 51326,
  "Rg1": 53052,
  "Rg1#": 51963,
  "Rg1+": 53016,
  "Rg1g2": 52574,
  "Rg1g6#": 51518,
  "Rg2": 52870,
  "Rg2+": 52403,
  "Rg2g1#": 50823,
  "Rg2g1+": 53531,
  "Rg2g3": 50596,
  "Rg2g3#": 52644,
  "Rg2g7": 50545,
  "Rg2g7+": 50869,
  "Rg2xg5": 51240,
  "Rg2xg6+": 53391,
  "Rg2xg7+": 51875,
  "Rg3": 51038,
  "Rg3#": 52907,
  "Rg3+": 51366,
  "Rg3g2": 53419,
  "Rg3g4": 50487,
  "Rg3g5": 52675,
  "Rg3g6+": 53500,
  "Rg3xg4": 53166,
  "Rg3xg5+": 53295,
  "Rg3xg6+": 52691,
  "Rg3xg7": 51645,
  "Rg3xg8": 52411,
  "Rg4": 53683,
  "Rg4#": 50847,
  "Rg4+": 51795,
  "Rg4g3": 51155,
  "Rg4g5": 52334,
  "Rg4g6": 53107,
  "Rg4xg2": 52873,
  "Rg4xg2+": 51933,
  "Rg4xg3+": 52868,
  "Rg4xg5+": 52787,
  "Rg4xg7+": 52734,
  "Rg5": 52807,
  "Rg5#": 50580,
  "Rg5+": 53237,
  "Rg5g3": 52921,
  "Rg5g6": 52670,
  "Rg5g8+": 51303,
  "Rg5xg6": 53009,
  "Rg5xg6+": 51898,
  "Rg5xg7+": 53767,
  "Rg6": 53216,
  "Rg6#": 53387,
